iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define AON_EVENT_0 (*(volatile struct AON_EVENT_0_tag *) 0x40093000)

struct AON_IOC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRAY_CODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOSTRMIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRAY_CODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOSTRMED;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GRAY_CODE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOSTRMAX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCLATCH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OE_N:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLK32KCTL;

};

#define AON_IOC_0 (*(volatile struct AON_IOC_0_tag *) 0x40094000)

struct AON_RTC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t RTC_UPD_EN:1;
      uint64_t RTC_4KHZ_EN:1;
      uint64_t reservedSpace0:4;
      uint64_t RESET:1;
      uint64_t EV_DELAY:4;
      uint64_t reservedSpace1:4;
      uint64_t COMB_EV_MASK:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0:1;
      uint64_t reservedSpace0:7;
      uint64_t CH1:1;
      uint64_t reservedSpace1:7;
      uint64_t CH2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFLAGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUBSEC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUEINC:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SUBSECINC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t CH1_EN:1;
      uint64_t CH1_CAPT_EN:1;
      uint64_t reservedSpace1:6;
      uint64_t CH2_EN:1;
      uint64_t reservedSpace2:1;
      uint64_t CH2_CONT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH0CMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1CMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2CMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH2CMPINC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SUBSEC:16;
      uint64_t SEC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CH1CAPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WBUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNC;

};

#define AON_RTC_0 (*(volatile struct AON_RTC_0_tag *) 0x40092000)

struct AON_SYSCTL_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_EN:1;
      uint64_t EXT_REG_MODE:1;
      uint64_t DCDC_ACTIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RESET_SRC:3;
      uint64_t CLK_LOSS_EN:1;
      uint64_t VDD_LOSS_EN:1;
      uint64_t VDDR_LOSS_EN:1;
      uint64_t VDDS_LOSS_EN:1;
      uint64_t reservedSpace1:1;
      uint64_t VDD_LOSS_EN_OVR:1;
      uint64_t VDDR_LOSS_EN_OVR:1;
      uint64_t VDDS_LOSS_EN_OVR:1;
      uint64_t BOOT_DET_0:1;
      uint64_t BOOT_DET_1:1;
      uint64_t GPIO_WU_FROM_SD:1;
      uint64_t WU_FROM_SD:1;
      uint64_t BOOT_DET_0_SET:1;
      uint64_t BOOT_DET_1_SET:1;
      uint64_t reservedSpace2:6;
      uint64_t BOOT_DET_0_CLR:1;
      uint64_t BOOT_DET_1_CLR:1;
      uint64_t reservedSpace3:5;
      uint64_t SYSRESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESETCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO_PAD_SLEEP_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SLEEPCTL;

};

#define AON_SYSCTL_0 (*(volatile struct AON_SYSCTL_0_tag *) 0x40090000)

struct AON_WUC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PWR_DWN_SRC:2;
      uint64_t RCOSC_HF_CAL_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUCLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC:3;
      uint64_t reservedSpace0:5;
      uint64_t SCLK_HF_DIV:3;
      uint64_t PWR_DWN_SRC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUXCLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRAM_RET_EN:4;
      uint64_t reservedSpace0:12;
      uint64_t FIXED_WU_EN:1;
      uint64_t VIRT_OFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RAM_RET_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUXCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUX_FORCE_ON:1;
      uint64_t SWEV:1;
      uint64_t SCE_RUN_EN:1;
      uint64_t reservedSpace0:28;
      uint64_t RESET_REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUXCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t AUX_RESET_DONE:1;
      uint64_t AUX_BUS_CONNECTED:1;
      uint64_t reservedSpace1:1;
      uint64_t MCU_PD_ON:1;
      uint64_t AUX_PD_ON:1;
      uint64_t JTAG_PD_ON:1;
      uint64_t reservedSpace2:2;
      uint64_t AUX_PWR_DWN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHUTDOWN;

