iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define AUX_SCE_0 (*(volatile struct AUX_SCE_0_tag *) 0x400e1000)

struct AUX_SMPH_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMPH_ID:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUTOTAKE;

};

#define AUX_SMPH_0 (*(volatile struct AUX_SMPH_0_tag *) 0x400c8000)

struct AUX_TDCIF_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATE:6;
      uint64_t DONE:1;
      uint64_t SAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:25;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RESULT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LIMIT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SATCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START_SRC:5;
      uint64_t START_POL:1;
      uint64_t reservedSpace0:2;
      uint64_t STOP_SRC:5;
      uint64_t STOP_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIGSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIGCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIGCNTLOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRIGCNTCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC:5;
      uint64_t reservedSpace0:1;
      uint64_t RATIO:1;
      uint64_t RESET_N:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRECTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRECNT;

};

#define AUX_TDCIF_0 (*(volatile struct AUX_TDCIF_0_tag *) 0x400c4000)

struct AUX_TIMER_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:1;
      uint64_t MODE:1;
      uint64_t reservedSpace0:2;
      uint64_t PRE:4;
      uint64_t TICK_SRC:5;
      uint64_t TICK_SRC_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:1;
      uint64_t MODE:1;
      uint64_t reservedSpace0:2;
      uint64_t PRE:4;
      uint64_t TICK_SRC:5;
      uint64_t TICK_SRC_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T1CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T0TARGET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T1TARGET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) T1CTL;

};

#define AUX_TIMER_0 (*(volatile struct AUX_TIMER_0_tag *) 0x400c7000)

struct AUX_WUC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SMPH_bitfield:1;
      uint64_t AIODIO0:1;
      uint64_t AIODIO1:1;
      uint64_t TIMER:1;
      uint64_t ANAIF:1;
      uint64_t TDC:1;
      uint64_t AUX_DDI0_OSC_bitfield:1;
      uint64_t AUX_ADI4_bitfield:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODCLKEN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWROFFREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRDWNREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRDWNACK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKLFREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKLFACK;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AON_PROG_WU:1;
      uint64_t AON_SW:1;
      uint64_t AON_RTC_CH2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WUEVFLAGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AON_PROG_WU:1;
      uint64_t AON_SW:1;
      uint64_t AON_RTC_CH2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WUEVCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ:1;
      uint64_t ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCCLKCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ:1;
      uint64_t ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TDCCLKCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REQ:1;
      uint64_t ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REFCLKCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INC15_0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCSUBSECINC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INC23_16:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCSUBSECINC1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPD_REQ:1;
      uint64_t UPD_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCSUBSECINCCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISCONNECT_REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUBUSCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISCONNECT_ACK:1;
      uint64_t DISCONNECTED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUBUSSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCE_RUN_EN:1;
      uint64_t AUX_FORCE_ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AONCTLSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUXIOLATCH;

