iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH13BSEL;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH14BSEL;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH15BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH16SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH16BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH17SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH17BSEL;

  uint8_t res8[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH21SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH21BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH22SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH22BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH23SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH23BSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH24SSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UDMACH24BSEL;

  uint8_t res9[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPT3ACAPTSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPT3BCAPTSEL;

  uint8_t res10[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUXSEL0;

  uint8_t res11[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CM3NMISEL0;

  uint8_t res12[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SSTMPSEL0;

  uint8_t res13[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRZSEL0;

  uint8_t res14[1276];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWEV0:1;
      uint64_t reservedSpace0:7;
      uint64_t SWEV1:1;
      uint64_t reservedSpace1:7;
      uint64_t SWEV2:1;
      uint64_t reservedSpace2:7;
      uint64_t SWEV3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWEV;

};

#define EVENT_0 (*(volatile struct EVENT_0_tag *) 0x40083000)

struct FCFG1_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEVICE_MINOR_REV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISC_CONF_1;

  uint8_t res0[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFLDO_TRIM_OUTPUT:7;
      uint64_t reservedSpace0:7;
      uint64_t CTL_PA0_TRIM:5;
      uint64_t IFAMP_TRIM:5;
      uint64_t LNA_IB:4;
      uint64_t IFAMP_IB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_RF_FRONTEND_DIV5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFLDO_TRIM_OUTPUT:7;
      uint64_t reservedSpace0:7;
      uint64_t CTL_PA0_TRIM:5;
      uint64_t IFAMP_TRIM:5;
      uint64_t LNA_IB:4;
      uint64_t IFAMP_IB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_RF_FRONTEND_DIV6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFLDO_TRIM_OUTPUT:7;
      uint64_t reservedSpace0:7;
      uint64_t CTL_PA0_TRIM:5;
      uint64_t IFAMP_TRIM:5;
      uint64_t LNA_IB:4;
      uint64_t IFAMP_IB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_RF_FRONTEND_DIV10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFLDO_TRIM_OUTPUT:7;
      uint64_t reservedSpace0:7;
      uint64_t CTL_PA0_TRIM:5;
      uint64_t IFAMP_TRIM:5;
      uint64_t LNA_IB:4;
      uint64_t IFAMP_IB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_RF_FRONTEND_DIV12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFLDO_TRIM_OUTPUT:7;
      uint64_t reservedSpace0:7;
      uint64_t CTL_PA0_TRIM:5;
      uint64_t IFAMP_TRIM:5;
      uint64_t LNA_IB:4;
      uint64_t IFAMP_IB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_RF_FRONTEND_DIV15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFLDO_TRIM_OUTPUT:7;
      uint64_t reservedSpace0:7;
      uint64_t CTL_PA0_TRIM:5;
      uint64_t IFAMP_TRIM:5;
      uint64_t LNA_IB:4;
      uint64_t IFAMP_IB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_RF_FRONTEND_DIV30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLDO_TRIM_OUTPUT:6;
      uint64_t LDOVCO_TRIM_OUTPUT:6;
      uint64_t RFC_MDM_DEMIQMC0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_SYNTH_DIV5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLDO_TRIM_OUTPUT:6;
      uint64_t LDOVCO_TRIM_OUTPUT:6;
      uint64_t RFC_MDM_DEMIQMC0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_SYNTH_DIV6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLDO_TRIM_OUTPUT:6;
      uint64_t LDOVCO_TRIM_OUTPUT:6;
      uint64_t RFC_MDM_DEMIQMC0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_SYNTH_DIV10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLDO_TRIM_OUTPUT:6;
      uint64_t LDOVCO_TRIM_OUTPUT:6;
      uint64_t RFC_MDM_DEMIQMC0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_SYNTH_DIV12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLDO_TRIM_OUTPUT:6;
      uint64_t LDOVCO_TRIM_OUTPUT:6;
      uint64_t RFC_MDM_DEMIQMC0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_SYNTH_DIV15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SLDO_TRIM_OUTPUT:6;
      uint64_t LDOVCO_TRIM_OUTPUT:6;
      uint64_t RFC_MDM_DEMIQMC0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_SYNTH_DIV30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACTRIM:6;
      uint64_t QUANTCTLTHRES:3;
      uint64_t RSSI_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_MISC_ADC_DIV5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACTRIM:6;
      uint64_t QUANTCTLTHRES:3;
      uint64_t RSSI_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_MISC_ADC_DIV6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACTRIM:6;
      uint64_t QUANTCTLTHRES:3;
      uint64_t RSSI_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_MISC_ADC_DIV10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACTRIM:6;
      uint64_t QUANTCTLTHRES:3;
      uint64_t RSSI_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_MISC_ADC_DIV12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACTRIM:6;
      uint64_t QUANTCTLTHRES:3;
      uint64_t RSSI_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_MISC_ADC_DIV15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DACTRIM:6;
      uint64_t QUANTCTLTHRES:3;
      uint64_t RSSI_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CONFIG_MISC_ADC_DIV30;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID_31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHDW_DIE_ID_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID_63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHDW_DIE_ID_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID_95_64:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHDW_DIE_ID_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ID_127_96:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHDW_DIE_ID_3;

