iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res2[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCOSCHF_CTRIM:8;
      uint64_t VTRIM_COARSE:4;
      uint64_t VTRIM_DIG:4;
      uint64_t ITRIM_DIG_LDO:2;
      uint64_t TRIMIREF:5;
      uint64_t TRIMMAG:4;
      uint64_t SET_RCOSC_HF_COARSE_RESISTOR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHDW_OSC_BIAS_LDO_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRIMTEMP:6;
      uint64_t TRIMBOD_EXTMODE:5;
      uint64_t TRIMBOD_INTMODE:5;
      uint64_t VDDR_TRIM:5;
      uint64_t IPTAT_TRIM:2;
      uint64_t VDDR_OK_HYS:1;
      uint64_t VDDR_ENABLE_PG1:1;
      uint64_t BOD_BANDGAP_TRIM_CNF:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHDW_ANA_TRIM;

  uint8_t res3[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOT_NUMBER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_NUMBER;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t YCOORDINATE:16;
      uint64_t XCOORDINATE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_COORDINATE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVSU:8;
      uint64_t PVSU:8;
      uint64_t ESU:8;
      uint64_t PSU:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_E_P;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CVSU:12;
      uint64_t A_EXEZ_SETUP:4;
      uint64_t PV_ACCESS:8;
      uint64_t RVSU:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_C_E_P_R;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PVH2:8;
      uint64_t PVH:8;
      uint64_t RH:8;
      uint64_t PH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_P_R_PV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SM_FREQUENCY:12;
      uint64_t VSTAT:4;
      uint64_t SEQ:8;
      uint64_t EH:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_EH_SEQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VHV_E_STEP_HIGHT:16;
      uint64_t VHV_E_START:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_VHV_E;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAX_PP:16;
      uint64_t reservedSpace0:8;
      uint64_t PUMP_SU:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_PP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PROGRAM_PW:16;
      uint64_t MAX_EP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_PROG_EP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERASE_PW:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_ERA_PW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VHV_E:4;
      uint64_t reservedSpace0:4;
      uint64_t TRIM13_E:4;
      uint64_t reservedSpace1:4;
      uint64_t VHV_P:4;
      uint64_t reservedSpace2:4;
      uint64_t TRIM13_P:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_VHV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VINH:8;
      uint64_t VCG2P5:8;
      uint64_t VHV_PV:4;
      uint64_t reservedSpace0:4;
      uint64_t TRIM13_PV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_VHV_PV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t V_READ:8;
      uint64_t VWL_P:8;
      uint64_t VSL_P:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_V;

  uint8_t res5[248];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t PROTOCOL:4;
      uint64_t PKG:3;
      uint64_t SEQUENCE:4;
      uint64_t reservedSpace1:3;
      uint64_t VER:2;
      uint64_t PG_REV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) USER_ID;

  uint8_t res6[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAIT_SYSCODE:8;
      uint64_t FLASH_SIZE:8;
      uint64_t TRIM_1P7:2;
      uint64_t MAX_EC_LEVEL:4;
      uint64_t DO_PRECOND:1;
      uint64_t EC_STEP_SIZE:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_OTP_DATA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DCDC_HIGH_EN_SEL:3;
      uint64_t DCDC_LOW_EN_SEL:3;
      uint64_t DEAD_TIME_TRIM:2;
      uint64_t DCDC_IPEAK:3;
      uint64_t DITHER_EN:1;
      uint64_t reservedSpace0:4;
      uint64_t NANOAMP_RES_TRIM:6;
      uint64_t ATESTLF_UDIGLDO_IBIAS_TRIM:1;
      uint64_t SET_RCOSC_HF_FINE_RESISTOR:2;
      uint64_t reservedSpace1:1;
      uint64_t RCOSCHFCTRIMFRACT:5;
      uint64_t RCOSCHFCTRIMFRACT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANA2_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VTRIM_DELTA:3;
      uint64_t reservedSpace0:5;
      uint64_t ITRIM_UDIGLDO:3;
      uint64_t ITRIM_DIGLDO_LOAD:2;
      uint64_t reservedSpace1:3;
      uint64_t GLDO_CURSRC:3;
      uint64_t reservedSpace2:5;
      uint64_t VDDR_TRIM_SLEEP:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDO_TRIM;

  uint8_t res7[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR_0_31:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_BLE_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR_32_63:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_BLE_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR_0_31:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_15_4_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR_32_63:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MAC_15_4_1;

  uint8_t res8[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VIN_AT_X_EXT_RD:3;
      uint64_t DIS_IDLE_EXT_RD:1;
      uint64_t DIS_STANDBY_EXT_RD:1;
      uint64_t STANDBY_PW_SEL_EXT_RD:2;
      uint64_t STANDBY_MODE_SEL_EXT_RD:1;
      uint64_t VIN_AT_X_INT_RD:3;
      uint64_t DIS_IDLE_INT_RD:1;
      uint64_t DIS_STANDBY_INT_RD:1;
      uint64_t STANDBY_PW_SEL_INT_RD:2;
      uint64_t STANDBY_MODE_SEL_INT_RD:1;
      uint64_t VIN_AT_X_EXT_WRT:3;
      uint64_t DIS_IDLE_EXT_WRT:1;
      uint64_t DIS_STANDBY_EXT_WRT:1;
      uint64_t STANDBY_PW_SEL_EXT_WRT:2;
      uint64_t STANDBY_MODE_SEL_EXT_WRT:1;
      uint64_t VIN_AT_X_INT_WRT:3;
      uint64_t DIS_IDLE_INT_WRT:1;
      uint64_t DIS_STANDBY_INT_WRT:1;
      uint64_t STANDBY_PW_SEL_INT_WRT:2;
      uint64_t STANDBY_MODE_SEL_INT_WRT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_OTP_DATA4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEMPVSLOPE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISC_TRIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTRIMFRACT_SLOPE:8;
      uint64_t CTRIMFRACT_QUAD:8;
      uint64_t CTRIM:8;
      uint64_t FINE_RESISTOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RCOSC_HF_TEMPCOMP;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MANUFACTURER_ID:12;
      uint64_t WAFER_ID:16;
      uint64_t PG_REV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICEPICK_DEVICE_ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG1_REVISION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEST_PROGRAM_REV:8;
      uint64_t PO_TAIL_RES_TRIM:4;
      uint64_t PER_E:3;
      uint64_t PER_M:5;
      uint64_t RCOSC_HF_CRIM:8;
      uint64_t RCOSC_HF_ITUNE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MISC_OTP_DATA;

