iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define AUX_DDI0_OSC_1 (*(volatile struct AUX_DDI0_OSC_1_tag *) 0x400ca000)

struct AUX_EVCTL_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VEC0_EV:5;
      uint64_t VEC0_EN:1;
      uint64_t VEC0_POL:1;
      uint64_t reservedSpace0:1;
      uint64_t VEC1_EV:5;
      uint64_t VEC1_EN:1;
      uint64_t VEC1_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VECCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VEC2_EV:5;
      uint64_t VEC2_EN:1;
      uint64_t VEC2_POL:1;
      uint64_t reservedSpace0:1;
      uint64_t VEC3_EV:5;
      uint64_t VEC3_EN:1;
      uint64_t VEC3_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VECCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WEV7_EV:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCEWEVSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWEV0:1;
      uint64_t SWEV1:1;
      uint64_t SWEV2:1;
      uint64_t AUX_COMPA:1;
      uint64_t AUX_COMPB:1;
      uint64_t ADC_DONE:1;
      uint64_t TDC_DONE:1;
      uint64_t TIMER0_EV:1;
      uint64_t TIMER1_EV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTOAONFLAGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t AUX_COMPA:1;
      uint64_t AUX_COMPB:1;
      uint64_t ADC_DONE:1;
      uint64_t TDC_DONE:1;
      uint64_t TIMER0_EV:1;
      uint64_t TIMER1_EV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTOAONPOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEL:1;
      uint64_t EN:1;
      uint64_t REQ_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWEV0:1;
      uint64_t SWEV1:1;
      uint64_t SWEV2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWEVSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AON_RTC_CH2:1;
      uint64_t AUX_COMPA:1;
      uint64_t AUX_COMPB:1;
      uint64_t TDC_DONE:1;
      uint64_t TIMER0_EV:1;
      uint64_t TIMER1_EV:1;
      uint64_t SMPH_AUTOTAKE_DONE:1;
      uint64_t ADC_DONE:1;
      uint64_t ADC_FIFO_ALMOST_FULL:1;
      uint64_t OBSMUX0:1;
      uint64_t OBSMUX1:1;
      uint64_t AON_SW:1;
      uint64_t AON_PROG_WU:1;
      uint64_t AUXIO0:1;
      uint64_t AUXIO1:1;
      uint64_t AUXIO2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSTAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AUXIO3:1;
      uint64_t AUXIO4:1;
      uint64_t AUXIO5:1;
      uint64_t AUXIO6:1;
      uint64_t AUXIO7:1;
      uint64_t AUXIO8:1;
      uint64_t AUXIO9:1;
      uint64_t AUXIO10:1;
      uint64_t AUXIO11:1;
      uint64_t AUXIO12:1;
      uint64_t AUXIO13:1;
      uint64_t AUXIO14:1;
      uint64_t AUXIO15:1;
      uint64_t ACLK_REF:1;
      uint64_t MCU_EV:1;
      uint64_t ADC_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVSTAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AON_WU_EV:1;
      uint64_t AUX_COMPA:1;
      uint64_t AUX_COMPB:1;
      uint64_t TDC_DONE:1;
      uint64_t TIMER0_EV:1;
      uint64_t TIMER1_EV:1;
      uint64_t SMPH_AUTOTAKE_DONE:1;
      uint64_t ADC_DONE:1;
      uint64_t ADC_FIFO_ALMOST_FULL:1;
      uint64_t OBSMUX0:1;
      uint64_t ADC_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTOMCUPOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AON_WU_EV:1;
      uint64_t AUX_COMPA:1;
      uint64_t AUX_COMPB:1;
      uint64_t TDC_DONE:1;
      uint64_t TIMER0_EV:1;
      uint64_t TIMER1_EV:1;
      uint64_t SMPH_AUTOTAKE_DONE:1;
      uint64_t ADC_DONE:1;
      uint64_t ADC_FIFO_ALMOST_FULL:1;
      uint64_t OBSMUX0:1;
      uint64_t ADC_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTOMCUFLAGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AON_WU_EV:1;
      uint64_t AUX_COMPA:1;
      uint64_t AUX_COMPB:1;
      uint64_t TDC_DONE:1;
      uint64_t TIMER0_EV:1;
      uint64_t TIMER1_EV:1;
      uint64_t SMPH_AUTOTAKE_DONE:1;
      uint64_t ADC_DONE:1;
      uint64_t ADC_FIFO_ALMOST_FULL:1;
      uint64_t OBSMUX0:1;
      uint64_t ADC_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COMBEVTOMCUMASK;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VEC0:1;
      uint64_t VEC1:1;
      uint64_t VEC2:1;
      uint64_t VEC3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VECFLAGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AON_WU_EV:1;
      uint64_t AUX_COMPA:1;
      uint64_t AUX_COMPB:1;
      uint64_t TDC_DONE:1;
      uint64_t TIMER0_EV:1;
      uint64_t TIMER1_EV:1;
      uint64_t SMPH_AUTOTAKE_DONE:1;
      uint64_t ADC_DONE:1;
      uint64_t ADC_FIFO_ALMOST_FULL:1;
      uint64_t OBSMUX0:1;
      uint64_t ADC_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTOMCUFLAGSCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWEV0:1;
      uint64_t SWEV1:1;
      uint64_t SWEV2:1;
      uint64_t AUX_COMPA:1;
      uint64_t AUX_COMPB:1;
      uint64_t ADC_DONE:1;
      uint64_t TDC_DONE:1;
      uint64_t TIMER0_EV:1;
      uint64_t TIMER1_EV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTOAONFLAGSCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VEC0:1;
      uint64_t VEC1:1;
      uint64_t VEC2:1;
      uint64_t VEC3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VECFLAGSCLR;

};

#define AUX_EVCTL_1 (*(volatile struct AUX_EVCTL_1_tag *) 0x400c5000)

struct AUX_SCE_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
      uint64_t SUSPEND:1;
      uint64_t SINGLE_STEP:1;
      uint64_t RESTART:1;
      uint64_t FORCE_WU_HIGH:1;
      uint64_t FORCE_WU_LOW:1;
      uint64_t DBG_FREEZE_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t RESET_VECTOR:4;
      uint64_t reservedSpace1:4;
      uint64_t FORCE_EV_HIGH:8;
      uint64_t FORCE_EV_LOW:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PC:16;
      uint64_t OPCODE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FETCHSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Z_FLAG:1;
      uint64_t N_FLAG:1;
      uint64_t C_FLAG:1;
      uint64_t V_FLAG:1;
      uint64_t reservedSpace0:4;
      uint64_t SELF_STOP:1;
      uint64_t WEV:1;
      uint64_t SLEEP:1;
      uint64_t BUS_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EV_SIGNALS:8;
      uint64_t WU_SIGNAL:1;
      uint64_t reservedSpace0:7;
      uint64_t EXC_VECTOR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WUSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG0:16;
      uint64_t REG1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG1_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG2:16;
      uint64_t REG3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG3_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG4:16;
      uint64_t REG5:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG5_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REG6:16;
      uint64_t REG7:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REG7_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t START:16;
      uint64_t STOP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOOPADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ITER_LEFT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOOPCNT;

