iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res12[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAV_ERA_PUL:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_SAV_ERA_PUL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSM_TIMER:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_TIMER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:3;
      uint64_t MODE:3;
      uint64_t SAV_ERA_MODE:3;
      uint64_t SAV_PGM_CMD:3;
      uint64_t SUBMODE:2;
      uint64_t ERA_SUBMODE:2;
      uint64_t PGM_SUBMODE:2;
      uint64_t RDV_SUBMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_MODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PGM_ADDR:23;
      uint64_t PGM_BANK:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_PGM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERA_ADDR:23;
      uint64_t ERA_BANK:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_ERA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAX_PRG_PUL:12;
      uint64_t reservedSpace0:4;
      uint64_t BEG_EC_LEVEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_PRG_PUL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAX_ERA_PUL:12;
      uint64_t reservedSpace0:4;
      uint64_t MAX_EC_LEVEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_ERA_PUL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t EC_STEP_SIZE:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_STEP_SIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PUL_CNTR:12;
      uint64_t reservedSpace0:4;
      uint64_t CUR_EC_LEVEL:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_PUL_CNTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EC_STEP_HEIGHT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_EC_STEP_HEIGHT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OVERRIDE:1;
      uint64_t INV_DATA:1;
      uint64_t CMD_EN:1;
      uint64_t DIS_TST_EN:1;
      uint64_t PREC_STOP_EN:1;
      uint64_t PGM_SEC_COF_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t DBG_SHORT_ROW:4;
      uint64_t DO_REDU_COL:1;
      uint64_t reservedSpace1:2;
      uint64_t ONE_TIME_GOOD:1;
      uint64_t reservedSpace2:1;
      uint64_t RV_INT_EN:1;
      uint64_t RV_RES:1;
      uint64_t RV_SEC_EN:1;
      uint64_t RANDOM:1;
      uint64_t CMPV_ALLOWED:1;
      uint64_t ALL_BANKS:1;
      uint64_t FSM_INT_EN:1;
      uint64_t DO_PRECOND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_ST_MACHINE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLK_OTP:8;
      uint64_t BLK_TIOTP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_FLES;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WR_ENA:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_WR_ENA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSM_ACC_PP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_ACC_PP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACC_EP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_ACC_EP;

  uint8_t res14[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CUR_ADDR:28;
      uint64_t BANK:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEC_OUT:4;
      uint64_t SECTOR:4;
      uint64_t FSM_SECTOR_EXTENSION:8;
      uint64_t SECT_ERASED:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_SECTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CONFIG_CRC:12;
      uint64_t MOD_VERSION:20;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FMC_REV_ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSM_ERR_BANK:4;
      uint64_t reservedSpace0:4;
      uint64_t FSM_ERR_ADDR:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_ERR_ADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSM_PGM_MAXPUL:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_PGM_MAXPUL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSMEXECUTE:5;
      uint64_t reservedSpace0:11;
      uint64_t SUSPEND_NOW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_EXECUTE;

  uint8_t res15[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSM_SECTOR1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_SECTOR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSM_SECTOR2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_SECTOR2;

  uint8_t res16[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSM_BSLE0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_BSLE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSM_BSL1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_BSLE1;

  uint8_t res17[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSM_BSLP0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_BSLP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FSM_BSL1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSM_BSLP1;

  uint8_t res18[264];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAIN_NUM_BANK:4;
      uint64_t MAIN_BANK_WIDTH:12;
      uint64_t EE_NUM_BANK:4;
      uint64_t EE_BANK_WIDTH:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG_BANK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CPU_TYPE1:4;
      uint64_t UERR:2;
      uint64_t AUTO_SUSP:2;
      uint64_t ECCA:1;
      uint64_t SIL3:1;
      uint64_t IFLUSH:1;
      uint64_t ROM:1;
      uint64_t EE_IN_MAIN:4;
      uint64_t CPU2:4;
      uint64_t MEM_MAP:1;
      uint64_t reservedSpace0:3;
      uint64_t FAMILY_TYPE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG_WRAPPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_TYPE:4;
      uint64_t B1_TYPE:4;
      uint64_t B2_TYPE:4;
      uint64_t B3_TYPE:4;
      uint64_t B4_TYPE:4;
      uint64_t B5_TYPE:4;
      uint64_t B6_TYPE:4;
      uint64_t B7_TYPE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG_BNK_TYPE;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_START_ADDR:24;
      uint64_t B0_MUX_FACTOR:4;
      uint64_t B0_MAX_SECTOR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG_B0_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B1_START_ADDR:24;
      uint64_t B1_MUX_FACTOR:4;
      uint64_t B1_MAX_SECTOR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG_B1_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B2_START_ADDR:24;
      uint64_t B2_MUX_FACTOR:4;
      uint64_t B2_MAX_SECTOR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG_B2_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B3_START_ADDR:24;
      uint64_t B3_MUX_FACTOR:4;
      uint64_t B3_MAX_SECTOR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG_B3_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B4_START_ADDR:24;
      uint64_t B4_MUX_FACTOR:4;
      uint64_t B4_MAX_SECTOR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG_B4_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B5_START_ADDR:24;
      uint64_t B5_MUX_FACTOR:4;
      uint64_t B5_MAX_SECTOR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG_B5_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B6_START_ADDR:24;
      uint64_t B6_MUX_FACTOR:4;
      uint64_t B6_MAX_SECTOR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG_B6_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B7_START_ADDR:24;
      uint64_t B7_MUX_FACTOR:4;
      uint64_t B7_MAX_SECTOR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG_B7_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t B0_SECT_SIZE:4;
      uint64_t reservedSpace0:12;
      uint64_t B0_NUM_SECTORS:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FCFG_B0_SSIZE0;

