iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res0[1024];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TEST_EN:1;
      uint64_t reservedSpace0:7;
      uint64_t STALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAUSE_INTR:1;
      uint64_t CAUSE_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT_CAUS;

  uint8_t res1[2016];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTLOCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOCK;

};

#define WDT_1 (*(volatile struct WDT_1_tag *) 0x40080000)

struct WORKFLASH_IF_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WFASZR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WFRWTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDY:1;
      uint64_t HNG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WFSTR;

};

#define WORKFLASH_IF_0 (*(volatile struct WORKFLASH_IF_0_tag *) 0x200e0000)

struct FLASH_IF_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASZ:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FASZR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RWT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRWTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDY:1;
      uint64_t HNG:1;
      uint64_t ERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSTR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSYNDN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BE:1;
      uint64_t BS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FBFCR;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDYIE:1;
      uint64_t HANGIE:1;
      uint64_t ERRIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDYIF:1;
      uint64_t HANGIF:1;
      uint64_t ERRIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FISR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDYIC:1;
      uint64_t HANGIC:1;
      uint64_t ERRIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FICLR;

  uint8_t res2[212];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRMM:10;
      uint64_t reservedSpace0:6;
      uint64_t TTRMM:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRTRMM;

};

#define FLASH_IF_0 (*(volatile struct FLASH_IF_0_tag *) 0x40000000)

struct UNIQUE_ID_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t UID:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UIDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UID:13;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UIDR1;

};

#define UNIQUE_ID_0 (*(volatile struct UNIQUE_ID_0_tag *) 0x40000200)

struct ECC_CAPTURE_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ERRAD:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FERRAD;

};

#define ECC_CAPTURE_0 (*(volatile struct ECC_CAPTURE_0_tag *) 0x40000300)

struct CRG_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MOSCE:1;
      uint64_t reservedSpace1:1;
      uint64_t SOSCE:1;
      uint64_t PLLE:1;
      uint64_t RCS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SCM_CTL;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MORDY:1;
      uint64_t reservedSpace1:1;
      uint64_t SORDY:1;
      uint64_t PLRDY:1;
      uint64_t RCM:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SCM_STR;

  uint8_t res1[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STM:2;
      uint64_t DSTM:1;
      uint64_t reservedSpace0:1;
      uint64_t SPL:1;
      uint64_t reservedSpace1:11;
      uint64_t KEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STB_CTL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PONR:1;
      uint64_t INITX:1;
      uint64_t reservedSpace0:2;
      uint64_t SWDT:1;
      uint64_t HWDT:1;
      uint64_t CSVR:1;
      uint64_t FCSR:1;
      uint64_t SRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RST_STR;

  uint8_t res2[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) BSC_PSR;

  uint8_t res3[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t APBC0:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) APBC0_PSR;

  uint8_t res4[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t APBC1:2;
      uint64_t reservedSpace0:2;
      uint64_t APBC1RST:1;
      uint64_t reservedSpace1:2;
      uint64_t APBC1EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) APBC1_PSR;

  uint8_t res5[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t APBC2:2;
      uint64_t reservedSpace0:2;
      uint64_t APBC2RST:1;
      uint64_t reservedSpace1:2;
      uint64_t APBC2EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) APBC2_PSR;

  uint8_t res6[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SWDS:2;
      uint64_t reservedSpace0:5;
      uint64_t TESTB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SWC_PSR;

  uint8_t res7[7];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TTC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) TTC_PSR;

