iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res8[7];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MOWT:4;
      uint64_t SOWT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CSW_TMR;

  uint8_t res9[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t POWT:3;
      uint64_t reservedSpace0:1;
      uint64_t PINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PSW_TMR;

  uint8_t res10[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PLLM:4;
      uint64_t PLLK:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PLL_CTL1;

  uint8_t res11[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PLLN:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PLL_CTL2;

  uint8_t res12[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MCSVE:1;
      uint64_t SCSVE:1;
      uint64_t reservedSpace0:6;
      uint64_t FCSDE:1;
      uint64_t FCSRE:1;
      uint64_t reservedSpace1:2;
      uint64_t FCD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CSV_CTL;

  uint8_t res13[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MCMF:1;
      uint64_t SCMF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CSV_STR;

  uint8_t res14[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FWH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FCSWH_CTL;

  uint8_t res15[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FWL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FCSWL_CTL;

  uint8_t res16[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FWD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FCSWD_CTL;

  uint8_t res17[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t DPSWBE:1;
      uint64_t reservedSpace1:1;
      uint64_t DPHWBE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DBWDT_CTL;

  uint8_t res18[11];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MCSE:1;
      uint64_t SCSE:1;
      uint64_t PCSE:1;
      uint64_t reservedSpace0:2;
      uint64_t FCSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) INT_ENR;

  uint8_t res19[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MCSI:1;
      uint64_t SCSI:1;
      uint64_t PCSI:1;
      uint64_t reservedSpace0:2;
      uint64_t FCSI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) INT_STR;

  uint8_t res20[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MCSC:1;
      uint64_t SCSC:1;
      uint64_t PCSC:1;
      uint64_t reservedSpace0:2;
      uint64_t FCSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) INT_CLR;

};

#define CRG_0 (*(volatile struct CRG_0_tag *) 0x40010000)

struct CRTRIM_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t CSR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCR_PSR;

  uint8_t res0[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TRD:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MCR_FTRM;

  uint8_t res1[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TRT:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MCR_TTRM;

  uint8_t res2[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRMLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR_RLR;

};

#define CRTRIM_0 (*(volatile struct CRTRIM_0_tag *) 0x4002e000)

struct SWWDT_0_tag
{
  uint32_t WDOGLOAD;
  uint32_t WDOGVALUE;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t INTEN:1;
      uint64_t RESEN:1;
      uint64_t TWD:2;
      uint64_t SPM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WDOGCONTROL;

  uint8_t res0[3];

  uint32_t WDOGINTCLR;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WDOGRIS;

  uint8_t res1[7];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TRG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WDOGSPMC;

  uint8_t res2[3047];

  uint32_t WDOGLOCK;
};

#define SWWDT_0 (*(volatile struct SWWDT_0_tag *) 0x40012000)

struct HWWDT_0_tag
{
  uint32_t WDG_LDR;
  uint32_t WDG_VLR;
  union
  {
    uint8_t R;
    struct
    {
      uint64_t INTEN:1;
      uint64_t RESEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WDG_CTL;

  uint8_t res0[3];

  uint8_t WDG_ICL;
  uint8_t res1[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WDG_RIS;

  uint8_t res2[3055];

  uint32_t WDG_LCK;
};

#define HWWDT_0 (*(volatile struct HWWDT_0_tag *) 0x40011000)

struct DTIM_0_tag
{
  uint32_t TIMER1LOAD;
  uint32_t TIMER1VALUE;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OneShot:1;
      uint64_t TimerSize:1;
      uint64_t TimerPre:2;
      uint64_t reservedSpace0:1;
      uint64_t IntEnable:1;
      uint64_t TimerMode:1;
      uint64_t TimerEn:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER1CONTROL;

  uint32_t TIMER1INTCLR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER1RIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER1RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER1MIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER1MIS;

  uint32_t TIMER1BGLOAD;
  uint8_t res0[4];

  uint32_t TIMER2LOAD;
  uint32_t TIMER2VALUE;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OneShot:1;
      uint64_t TimerSize:1;
      uint64_t TimerPre:2;
      uint64_t reservedSpace0:1;
      uint64_t IntEnable:1;
      uint64_t TimerMode:1;
      uint64_t TimerEn:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2CONTROL;

  uint32_t TIMER2INTCLR;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER1RIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMER1MIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMER2MIS;

  uint32_t TIMER2BGLOAD;
};

