iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
#define DTIM_0 (*(volatile struct DTIM_0_tag *) 0x40015000)

struct BTIOSEL03_0_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SEL01:4;
      uint64_t SEL23:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BTSEL0123;

};

#define BTIOSEL03_0 (*(volatile struct BTIOSEL03_0_tag *) 0x40025100)

struct BTIOSEL47_0_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SEL45:4;
      uint64_t SEL67:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BTSEL4567;

};

#define BTIOSEL47_0 (*(volatile struct BTIOSEL47_0_tag *) 0x40025300)

struct BTIOSEL8B_0_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SEL89:4;
      uint64_t SELAB:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BTSEL89AB;

};

#define BTIOSEL8B_0 (*(volatile struct BTIOSEL8B_0_tag *) 0x40025500)

struct BTIOSELCF_0_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SELCD:4;
      uint64_t SELEF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BTSELCDEF;

};

#define BTIOSELCF_0 (*(volatile struct BTIOSELCF_0_tag *) 0x40025700)

struct SBSSR_0_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t SSSR0:1;
      uint64_t SSSR1:1;
      uint64_t SSSR2:1;
      uint64_t SSSR3:1;
      uint64_t SSSR4:1;
      uint64_t SSSR5:1;
      uint64_t SSSR6:1;
      uint64_t SSSR7:1;
      uint64_t SSSR8:1;
      uint64_t SSSR9:1;
      uint64_t SSSR10:1;
      uint64_t SSSR11:1;
      uint64_t SSSR12:1;
      uint64_t SSSR13:1;
      uint64_t SSSR14:1;
      uint64_t SSSR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BTSSSR;

};

#define SBSSR_0 (*(volatile struct SBSSR_0_tag *) 0x40025ffc)

struct QPRC0_0_tag
{
  uint16_t QPCR;
  uint8_t res0[2];

  uint16_t QRCR;
  uint8_t res1[2];

  uint16_t QPCCR;
  uint8_t res2[2];

  uint16_t QPRCR;
  uint8_t res3[2];

  uint16_t QMPR;
  uint8_t res4[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t QPCMIE:1;
      uint64_t QPCMF:1;
      uint64_t QPRCMIE:1;
      uint64_t QPRCMF:1;
      uint64_t OUZIE:1;
      uint64_t UFDF:1;
      uint64_t OFDF:1;
      uint64_t ZIIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) QICRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CDCIE:1;
      uint64_t CDCF:1;
      uint64_t DIRPC:1;
      uint64_t DIROU:1;
      uint64_t QPCNRCMIE:1;
      uint64_t QPCNRCMF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) QICRH;

  uint8_t res5[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PCM:2;
      uint64_t RCM:2;
      uint64_t PSTP:1;
      uint64_t CGSC:1;
      uint64_t RSEL:1;
      uint64_t SWAP:1;
      uint64_t PCRM:2;
      uint64_t AES:2;
      uint64_t BES:2;
      uint64_t CGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QCR;

  uint8_t res6[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ORNGMD:1;
      uint64_t ORNGF:1;
      uint64_t ORNGIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QECR;

  uint8_t res7[30];

  uint16_t QRCRR;
  uint16_t QPCRR;
};

#define QPRC0_0 (*(volatile struct QPRC0_0_tag *) 0x40026000)

struct QPRC1_0_tag
{
  uint16_t QPCR;
  uint8_t res0[2];

  uint16_t QRCR;
  uint8_t res1[2];

  uint16_t QPCCR;
  uint8_t res2[2];

  uint16_t QPRCR;
  uint8_t res3[2];

  uint16_t QMPR;
  uint8_t res4[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t QPCMIE:1;
      uint64_t QPCMF:1;
      uint64_t QPRCMIE:1;
      uint64_t QPRCMF:1;
      uint64_t OUZIE:1;
      uint64_t UFDF:1;
      uint64_t OFDF:1;
      uint64_t ZIIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) QICRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CDCIE:1;
      uint64_t CDCF:1;
      uint64_t DIRPC:1;
      uint64_t DIROU:1;
      uint64_t QPCNRCMIE:1;
      uint64_t QPCNRCMF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) QICRH;

  uint8_t res5[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PCM:2;
      uint64_t RCM:2;
      uint64_t PSTP:1;
      uint64_t CGSC:1;
      uint64_t RSEL:1;
      uint64_t SWAP:1;
      uint64_t PCRM:2;
      uint64_t AES:2;
      uint64_t BES:2;
      uint64_t CGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QCR;

  uint8_t res6[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ORNGMD:1;
      uint64_t ORNGF:1;
      uint64_t ORNGIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QECR;

  uint8_t res7[30];

  uint16_t QRCRR;
  uint16_t QPCRR;
};

#define QPRC1_0 (*(volatile struct QPRC1_0_tag *) 0x40026040)

struct QPRC2_0_tag
{
  uint16_t QPCR;
  uint8_t res0[2];

  uint16_t QRCR;
  uint8_t res1[2];

  uint16_t QPCCR;
  uint8_t res2[2];

  uint16_t QPRCR;
  uint8_t res3[2];

  uint16_t QMPR;
  uint8_t res4[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t QPCMIE:1;
      uint64_t QPCMF:1;
      uint64_t QPRCMIE:1;
      uint64_t QPRCMF:1;
      uint64_t OUZIE:1;
      uint64_t UFDF:1;
      uint64_t OFDF:1;
      uint64_t ZIIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) QICRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CDCIE:1;
      uint64_t CDCF:1;
      uint64_t DIRPC:1;
      uint64_t DIROU:1;
      uint64_t QPCNRCMIE:1;
      uint64_t QPCNRCMF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) QICRH;

  uint8_t res5[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PCM:2;
      uint64_t RCM:2;
      uint64_t PSTP:1;
      uint64_t CGSC:1;
      uint64_t RSEL:1;
      uint64_t SWAP:1;
      uint64_t PCRM:2;
      uint64_t AES:2;
      uint64_t BES:2;
      uint64_t CGE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QCR;

  uint8_t res6[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ORNGMD:1;
      uint64_t ORNGF:1;
      uint64_t ORNGIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QECR;

  uint8_t res7[30];

