iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define ADC2_0 (*(volatile struct ADC2_0_tag *) 0x40027200)

struct DAC0_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t DAE:1;
      uint64_t DRDY:1;
      uint64_t reservedSpace0:2;
      uint64_t DAC10:1;
      uint64_t DDAS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DACR;

  uint8_t res0[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DA:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DADR;

};

#define DAC0_0 (*(volatile struct DAC0_0_tag *) 0x40033000)

struct DAC1_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t DAE:1;
      uint64_t DRDY:1;
      uint64_t reservedSpace0:2;
      uint64_t DAC10:1;
      uint64_t DDAS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DACR;

  uint8_t res0[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DA:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DADR;

};

#define DAC1_0 (*(volatile struct DAC1_0_tag *) 0x40033008)

struct EXTI_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN0:1;
      uint64_t EN1:1;
      uint64_t EN2:1;
      uint64_t EN3:1;
      uint64_t EN4:1;
      uint64_t EN5:1;
      uint64_t EN6:1;
      uint64_t EN7:1;
      uint64_t EN8:1;
      uint64_t EN9:1;
      uint64_t EN10:1;
      uint64_t EN11:1;
      uint64_t EN12:1;
      uint64_t EN13:1;
      uint64_t EN14:1;
      uint64_t EN15:1;
      uint64_t EN16:1;
      uint64_t EN17:1;
      uint64_t EN18:1;
      uint64_t EN19:1;
      uint64_t EN20:1;
      uint64_t EN21:1;
      uint64_t EN22:1;
      uint64_t EN23:1;
      uint64_t EN24:1;
      uint64_t EN25:1;
      uint64_t EN26:1;
      uint64_t EN27:1;
      uint64_t EN28:1;
      uint64_t EN29:1;
      uint64_t EN30:1;
      uint64_t EN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ENIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ER0:1;
      uint64_t ER1:1;
      uint64_t ER2:1;
      uint64_t ER3:1;
      uint64_t ER4:1;
      uint64_t ER5:1;
      uint64_t ER6:1;
      uint64_t ER7:1;
      uint64_t ER8:1;
      uint64_t ER9:1;
      uint64_t ER10:1;
      uint64_t ER11:1;
      uint64_t ER12:1;
      uint64_t ER13:1;
      uint64_t ER14:1;
      uint64_t ER15:1;
      uint64_t ER16:1;
      uint64_t ER17:1;
      uint64_t ER18:1;
      uint64_t ER19:1;
      uint64_t ER20:1;
      uint64_t ER21:1;
      uint64_t ER22:1;
      uint64_t ER23:1;
      uint64_t ER24:1;
      uint64_t ER25:1;
      uint64_t ER26:1;
      uint64_t ER27:1;
      uint64_t ER28:1;
      uint64_t ER29:1;
      uint64_t ER30:1;
      uint64_t ER31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EIRR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECL0:1;
      uint64_t ECL1:1;
      uint64_t ECL2:1;
      uint64_t ECL3:1;
      uint64_t ECL4:1;
      uint64_t ECL5:1;
      uint64_t ECL6:1;
      uint64_t ECL7:1;
      uint64_t ECL8:1;
      uint64_t ECL9:1;
      uint64_t ECL10:1;
      uint64_t ECL11:1;
      uint64_t ECL12:1;
      uint64_t ECL13:1;
      uint64_t ECL14:1;
      uint64_t ECL15:1;
      uint64_t ECL16:1;
      uint64_t ECL17:1;
      uint64_t ECL18:1;
      uint64_t ECL19:1;
      uint64_t ECL20:1;
      uint64_t ECL21:1;
      uint64_t ECL22:1;
      uint64_t ECL23:1;
      uint64_t ECL24:1;
      uint64_t ECL25:1;
      uint64_t ECL26:1;
      uint64_t ECL27:1;
      uint64_t ECL28:1;
      uint64_t ECL29:1;
      uint64_t ECL30:1;
      uint64_t ECL31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EICL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LA0:1;
      uint64_t LB0:1;
      uint64_t LA1:1;
      uint64_t LB1:1;
      uint64_t LA2:1;
      uint64_t LB2:1;
      uint64_t LA3:1;
      uint64_t LB3:1;
      uint64_t LA4:1;
      uint64_t LB4:1;
      uint64_t LA5:1;
      uint64_t LB5:1;
      uint64_t LA6:1;
      uint64_t LB6:1;
      uint64_t LA7:1;
      uint64_t LB7:1;
      uint64_t LA8:1;
      uint64_t LB8:1;
      uint64_t LA9:1;
      uint64_t LB9:1;
      uint64_t LA10:1;
      uint64_t LB10:1;
      uint64_t LA11:1;
      uint64_t LB11:1;
      uint64_t LA12:1;
      uint64_t LB12:1;
      uint64_t LA13:1;
      uint64_t LB13:1;
      uint64_t LA14:1;
      uint64_t LB14:1;
      uint64_t LA15:1;
      uint64_t LB15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LA16:1;
      uint64_t LB16:1;
      uint64_t LA17:1;
      uint64_t LB17:1;
      uint64_t LA18:1;
      uint64_t LB18:1;
      uint64_t LA19:1;
      uint64_t LB19:1;
      uint64_t LA20:1;
      uint64_t LB20:1;
      uint64_t LA21:1;
      uint64_t LB21:1;
      uint64_t LA22:1;
      uint64_t LB22:1;
      uint64_t LA23:1;
      uint64_t LB23:1;
      uint64_t LA24:1;
      uint64_t LB24:1;
      uint64_t LA25:1;
      uint64_t LB25:1;
      uint64_t LA26:1;
      uint64_t LB26:1;
      uint64_t LA27:1;
      uint64_t LB27:1;
      uint64_t LA28:1;
      uint64_t LB28:1;
      uint64_t LA29:1;
      uint64_t LB29:1;
      uint64_t LA30:1;
      uint64_t LB30:1;
      uint64_t LA31:1;
      uint64_t LB31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ELVR1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NMIRR;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t NCL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) NMICL;

};

#define EXTI_0 (*(volatile struct EXTI_0_tag *) 0x40030000)

struct INTREQ_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBEP1:1;
      uint64_t USBEP2:1;
      uint64_t USBEP3:1;
      uint64_t USBEP4:1;
      uint64_t USBEP5:1;
      uint64_t ADCSCAN0:1;
      uint64_t ADCSCAN1:1;
      uint64_t ADCSCAN2:1;
      uint64_t IRQ0BT0:1;
      uint64_t IRQ0BT2:1;
      uint64_t IRQ0BT4:1;
      uint64_t IRQ0BT6:1;
      uint64_t MFS0RX:1;
      uint64_t MFS0TX:1;
      uint64_t MFS1RX:1;
      uint64_t MFS1TX:1;
      uint64_t MFS2RX:1;
      uint64_t MFS2TX:1;
      uint64_t MFS3RX:1;
      uint64_t MFS3TX:1;
      uint64_t MFS4RX:1;
      uint64_t MFS4TX:1;
      uint64_t MFS5RX:1;
      uint64_t MFS5TX:1;
      uint64_t MFS6RX:1;
      uint64_t MFS6TX:1;
      uint64_t MFS7RX:1;
      uint64_t MFS7TX:1;
      uint64_t EXINT0:1;
      uint64_t EXINT1:1;
      uint64_t EXINT2:1;
      uint64_t EXINT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DRQSEL;

  uint8_t res0[12];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ODDPKS0:1;
      uint64_t ODDPKS1:1;
      uint64_t ODDPKS2:1;
      uint64_t ODDPKS3:1;
      uint64_t ODDPKS4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ODDPKS;

