iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_INT0:1;
      uint64_t USB_INT1:1;
      uint64_t USB_INT2:1;
      uint64_t USB_INT3:1;
      uint64_t USB_INT4:1;
      uint64_t USB_INT5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ114MON;

  uint32_t IRQ115MON;
  uint32_t IRQ116MON;
  uint32_t IRQ117MON;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDINT0:1;
      uint64_t SDINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ118MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FLINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ119MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ120MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ121MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ122MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ123MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ124MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ125MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ126MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ127MON;

};

#define INTREQ_0 (*(volatile struct INTREQ_0_tag *) 0x40031000)

struct GPIO_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t P00:1;
      uint64_t P01:1;
      uint64_t P02:1;
      uint64_t P03:1;
      uint64_t P04:1;
      uint64_t P05:1;
      uint64_t P06:1;
      uint64_t P07:1;
      uint64_t P08:1;
      uint64_t P09:1;
      uint64_t P0A:1;
      uint64_t P0B:1;
      uint64_t P0C:1;
      uint64_t P0D:1;
      uint64_t P0E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P10:1;
      uint64_t P11:1;
      uint64_t P12:1;
      uint64_t P13:1;
      uint64_t P14:1;
      uint64_t P15:1;
      uint64_t P16:1;
      uint64_t P17:1;
      uint64_t P18:1;
      uint64_t P19:1;
      uint64_t P1A:1;
      uint64_t P1B:1;
      uint64_t P1C:1;
      uint64_t P1D:1;
      uint64_t P1E:1;
      uint64_t P1F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P20:1;
      uint64_t P21:1;
      uint64_t P22:1;
      uint64_t P23:1;
      uint64_t P24:1;
      uint64_t P25:1;
      uint64_t P26:1;
      uint64_t P27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P30:1;
      uint64_t P31:1;
      uint64_t P32:1;
      uint64_t P33:1;
      uint64_t P34:1;
      uint64_t P35:1;
      uint64_t P36:1;
      uint64_t P37:1;
      uint64_t P38:1;
      uint64_t P39:1;
      uint64_t P3A:1;
      uint64_t P3B:1;
      uint64_t P3C:1;
      uint64_t P3D:1;
      uint64_t P3E:1;
      uint64_t P3F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P40:1;
      uint64_t P41:1;
      uint64_t P42:1;
      uint64_t P43:1;
      uint64_t P44:1;
      uint64_t P45:1;
      uint64_t P46:1;
      uint64_t P47:1;
      uint64_t P48:1;
      uint64_t P49:1;
      uint64_t P4A:1;
      uint64_t P4B:1;
      uint64_t P4C:1;
      uint64_t P4D:1;
      uint64_t P4E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P50:1;
      uint64_t P51:1;
      uint64_t P52:1;
      uint64_t P53:1;
      uint64_t P54:1;
      uint64_t P55:1;
      uint64_t P56:1;
      uint64_t P57:1;
      uint64_t P58:1;
      uint64_t P59:1;
      uint64_t P5A:1;
      uint64_t P5B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P60:1;
      uint64_t P61:1;
      uint64_t P62:1;
      uint64_t P63:1;
      uint64_t P64:1;
      uint64_t P65:1;
      uint64_t P66:1;
      uint64_t P67:1;
      uint64_t P68:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P70:1;
      uint64_t P71:1;
      uint64_t P72:1;
      uint64_t P73:1;
      uint64_t P74:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P80:1;
      uint64_t P81:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFR8;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE0:1;
      uint64_t reservedSpace0:1;
      uint64_t PE2:1;
      uint64_t PE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFRE;

  uint8_t res1[196];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P00:1;
      uint64_t P01:1;
      uint64_t P02:1;
      uint64_t P03:1;
      uint64_t P04:1;
      uint64_t P05:1;
      uint64_t P06:1;
      uint64_t P07:1;
      uint64_t P08:1;
      uint64_t P09:1;
      uint64_t P0A:1;
      uint64_t P0B:1;
      uint64_t P0C:1;
      uint64_t P0D:1;
      uint64_t P0E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P10:1;
      uint64_t P11:1;
      uint64_t P12:1;
      uint64_t P13:1;
      uint64_t P14:1;
      uint64_t P15:1;
      uint64_t P16:1;
      uint64_t P17:1;
      uint64_t P18:1;
      uint64_t P19:1;
      uint64_t P1A:1;
      uint64_t P1B:1;
      uint64_t P1C:1;
      uint64_t P1D:1;
      uint64_t P1E:1;
      uint64_t P1F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P20:1;
      uint64_t P21:1;
      uint64_t P22:1;
      uint64_t P23:1;
      uint64_t P24:1;
      uint64_t P25:1;
      uint64_t P26:1;
      uint64_t P27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P30:1;
      uint64_t P31:1;
      uint64_t P32:1;
      uint64_t P33:1;
      uint64_t P34:1;
      uint64_t P35:1;
      uint64_t P36:1;
      uint64_t P37:1;
      uint64_t P38:1;
      uint64_t P39:1;
      uint64_t P3A:1;
      uint64_t P3B:1;
      uint64_t P3C:1;
      uint64_t P3D:1;
      uint64_t P3E:1;
      uint64_t P3F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P40:1;
      uint64_t P41:1;
      uint64_t P42:1;
      uint64_t P43:1;
      uint64_t P44:1;
      uint64_t P45:1;
      uint64_t P46:1;
      uint64_t P47:1;
      uint64_t P48:1;
      uint64_t P49:1;
      uint64_t P4A:1;
      uint64_t P4B:1;
      uint64_t P4C:1;
      uint64_t P4D:1;
      uint64_t P4E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P50:1;
      uint64_t P51:1;
      uint64_t P52:1;
      uint64_t P53:1;
      uint64_t P54:1;
      uint64_t P55:1;
      uint64_t P56:1;
      uint64_t P57:1;
      uint64_t P58:1;
      uint64_t P59:1;
      uint64_t P5A:1;
      uint64_t P5B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P60:1;
      uint64_t P61:1;
      uint64_t P62:1;
      uint64_t P63:1;
      uint64_t P64:1;
      uint64_t P65:1;
      uint64_t P66:1;
      uint64_t P67:1;
      uint64_t P68:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P70:1;
      uint64_t P71:1;
      uint64_t P72:1;
      uint64_t P73:1;
      uint64_t P74:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P80:1;
      uint64_t P81:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCR8;

