iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res2[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE0:1;
      uint64_t reservedSpace0:1;
      uint64_t PE2:1;
      uint64_t PE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCRE;

  uint8_t res3[196];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P00:1;
      uint64_t P01:1;
      uint64_t P02:1;
      uint64_t P03:1;
      uint64_t P04:1;
      uint64_t P05:1;
      uint64_t P06:1;
      uint64_t P07:1;
      uint64_t P08:1;
      uint64_t P09:1;
      uint64_t P0A:1;
      uint64_t P0B:1;
      uint64_t P0C:1;
      uint64_t P0D:1;
      uint64_t P0E:1;
      uint64_t P0F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P10:1;
      uint64_t P11:1;
      uint64_t P12:1;
      uint64_t P13:1;
      uint64_t P14:1;
      uint64_t P15:1;
      uint64_t P16:1;
      uint64_t P17:1;
      uint64_t P18:1;
      uint64_t P19:1;
      uint64_t P1A:1;
      uint64_t P1B:1;
      uint64_t P1C:1;
      uint64_t P1D:1;
      uint64_t P1E:1;
      uint64_t P1F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P20:1;
      uint64_t P21:1;
      uint64_t P22:1;
      uint64_t P23:1;
      uint64_t P24:1;
      uint64_t P25:1;
      uint64_t P26:1;
      uint64_t P27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P30:1;
      uint64_t P31:1;
      uint64_t P32:1;
      uint64_t P33:1;
      uint64_t P34:1;
      uint64_t P35:1;
      uint64_t P36:1;
      uint64_t P37:1;
      uint64_t P38:1;
      uint64_t P39:1;
      uint64_t P3A:1;
      uint64_t P3B:1;
      uint64_t P3C:1;
      uint64_t P3D:1;
      uint64_t P3E:1;
      uint64_t P3F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P40:1;
      uint64_t P41:1;
      uint64_t P42:1;
      uint64_t P43:1;
      uint64_t P44:1;
      uint64_t P45:1;
      uint64_t P46:1;
      uint64_t P47:1;
      uint64_t P48:1;
      uint64_t P49:1;
      uint64_t P4A:1;
      uint64_t P4B:1;
      uint64_t P4C:1;
      uint64_t P4D:1;
      uint64_t P4E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P50:1;
      uint64_t P51:1;
      uint64_t P52:1;
      uint64_t P53:1;
      uint64_t P54:1;
      uint64_t P55:1;
      uint64_t P56:1;
      uint64_t P57:1;
      uint64_t P58:1;
      uint64_t P59:1;
      uint64_t P5A:1;
      uint64_t P5B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P60:1;
      uint64_t P61:1;
      uint64_t P62:1;
      uint64_t P63:1;
      uint64_t P64:1;
      uint64_t P65:1;
      uint64_t P66:1;
      uint64_t P67:1;
      uint64_t P68:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P70:1;
      uint64_t P71:1;
      uint64_t P72:1;
      uint64_t P73:1;
      uint64_t P74:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P80:1;
      uint64_t P81:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDR8;

  uint8_t res4[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE0:1;
      uint64_t reservedSpace0:1;
      uint64_t PE2:1;
      uint64_t PE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DDRE;

  uint8_t res5[196];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P00:1;
      uint64_t P01:1;
      uint64_t P02:1;
      uint64_t P03:1;
      uint64_t P04:1;
      uint64_t P05:1;
      uint64_t P06:1;
      uint64_t P07:1;
      uint64_t P08:1;
      uint64_t P09:1;
      uint64_t P0A:1;
      uint64_t P0B:1;
      uint64_t P0C:1;
      uint64_t P0D:1;
      uint64_t P0E:1;
      uint64_t P0F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDIR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P10:1;
      uint64_t P11:1;
      uint64_t P12:1;
      uint64_t P13:1;
      uint64_t P14:1;
      uint64_t P15:1;
      uint64_t P16:1;
      uint64_t P17:1;
      uint64_t P18:1;
      uint64_t P19:1;
      uint64_t P1A:1;
      uint64_t P1B:1;
      uint64_t P1C:1;
      uint64_t P1D:1;
      uint64_t P1E:1;
      uint64_t P1F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDIR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P20:1;
      uint64_t P21:1;
      uint64_t P22:1;
      uint64_t P23:1;
      uint64_t P24:1;
      uint64_t P25:1;
      uint64_t P26:1;
      uint64_t P27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDIR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P30:1;
      uint64_t P31:1;
      uint64_t P32:1;
      uint64_t P33:1;
      uint64_t P34:1;
      uint64_t P35:1;
      uint64_t P36:1;
      uint64_t P37:1;
      uint64_t P38:1;
      uint64_t P39:1;
      uint64_t P3A:1;
      uint64_t P3B:1;
      uint64_t P3C:1;
      uint64_t P3D:1;
      uint64_t P3E:1;
      uint64_t P3F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDIR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P40:1;
      uint64_t P41:1;
      uint64_t P42:1;
      uint64_t P43:1;
      uint64_t P44:1;
      uint64_t P45:1;
      uint64_t P46:1;
      uint64_t P47:1;
      uint64_t P48:1;
      uint64_t P49:1;
      uint64_t P4A:1;
      uint64_t P4B:1;
      uint64_t P4C:1;
      uint64_t P4D:1;
      uint64_t P4E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDIR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P50:1;
      uint64_t P51:1;
      uint64_t P52:1;
      uint64_t P53:1;
      uint64_t P54:1;
      uint64_t P55:1;
      uint64_t P56:1;
      uint64_t P57:1;
      uint64_t P58:1;
      uint64_t P59:1;
      uint64_t P5A:1;
      uint64_t P5B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDIR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P60:1;
      uint64_t P61:1;
      uint64_t P62:1;
      uint64_t P63:1;
      uint64_t P64:1;
      uint64_t P65:1;
      uint64_t P66:1;
      uint64_t P67:1;
      uint64_t P68:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDIR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P70:1;
      uint64_t P71:1;
      uint64_t P72:1;
      uint64_t P73:1;
      uint64_t P74:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDIR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P80:1;
      uint64_t P81:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDIR8;

  uint8_t res6[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE0:1;
      uint64_t reservedSpace0:1;
      uint64_t PE2:1;
      uint64_t PE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDIRE;

  uint8_t res7[196];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P00:1;
      uint64_t P01:1;
      uint64_t P02:1;
      uint64_t P03:1;
      uint64_t P04:1;
      uint64_t P05:1;
      uint64_t P06:1;
      uint64_t P07:1;
      uint64_t P08:1;
      uint64_t P09:1;
      uint64_t P0A:1;
      uint64_t P0B:1;
      uint64_t P0C:1;
      uint64_t P0D:1;
      uint64_t P0E:1;
      uint64_t P0F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDOR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P10:1;
      uint64_t P11:1;
      uint64_t P12:1;
      uint64_t P13:1;
      uint64_t P14:1;
      uint64_t P15:1;
      uint64_t P16:1;
      uint64_t P17:1;
      uint64_t P18:1;
      uint64_t P19:1;
      uint64_t P1A:1;
      uint64_t P1B:1;
      uint64_t P1C:1;
      uint64_t P1D:1;
      uint64_t P1E:1;
      uint64_t P1F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDOR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P20:1;
      uint64_t P21:1;
      uint64_t P22:1;
      uint64_t P23:1;
      uint64_t P24:1;
      uint64_t P25:1;
      uint64_t P26:1;
      uint64_t P27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDOR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P30:1;
      uint64_t P31:1;
      uint64_t P32:1;
      uint64_t P33:1;
      uint64_t P34:1;
      uint64_t P35:1;
      uint64_t P36:1;
      uint64_t P37:1;
      uint64_t P38:1;
      uint64_t P39:1;
      uint64_t P3A:1;
      uint64_t P3B:1;
      uint64_t P3C:1;
      uint64_t P3D:1;
      uint64_t P3E:1;
      uint64_t P3F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDOR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P40:1;
      uint64_t P41:1;
      uint64_t P42:1;
      uint64_t P43:1;
      uint64_t P44:1;
      uint64_t P45:1;
      uint64_t P46:1;
      uint64_t P47:1;
      uint64_t P48:1;
      uint64_t P49:1;
      uint64_t P4A:1;
      uint64_t P4B:1;
      uint64_t P4C:1;
      uint64_t P4D:1;
      uint64_t P4E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDOR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P50:1;
      uint64_t P51:1;
      uint64_t P52:1;
      uint64_t P53:1;
      uint64_t P54:1;
      uint64_t P55:1;
      uint64_t P56:1;
      uint64_t P57:1;
      uint64_t P58:1;
      uint64_t P59:1;
      uint64_t P5A:1;
      uint64_t P5B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDOR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P60:1;
      uint64_t P61:1;
      uint64_t P62:1;
      uint64_t P63:1;
      uint64_t P64:1;
      uint64_t P65:1;
      uint64_t P66:1;
      uint64_t P67:1;
      uint64_t P68:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDOR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P70:1;
      uint64_t P71:1;
      uint64_t P72:1;
      uint64_t P73:1;
      uint64_t P74:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDOR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P80:1;
      uint64_t P81:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDOR8;

  uint8_t res8[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE0:1;
      uint64_t reservedSpace0:1;
      uint64_t PE2:1;
      uint64_t PE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDORE;

  uint8_t res9[196];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AN00:1;
      uint64_t AN01:1;
      uint64_t AN02:1;
      uint64_t AN03:1;
      uint64_t AN04:1;
      uint64_t AN05:1;
      uint64_t AN06:1;
      uint64_t AN07:1;
      uint64_t AN08:1;
      uint64_t AN09:1;
      uint64_t AN10:1;
      uint64_t AN11:1;
      uint64_t AN12:1;
      uint64_t AN13:1;
      uint64_t AN14:1;
      uint64_t AN15:1;
      uint64_t AN16:1;
      uint64_t AN17:1;
      uint64_t AN18:1;
      uint64_t AN19:1;
      uint64_t AN20:1;
      uint64_t AN21:1;
      uint64_t AN22:1;
      uint64_t AN23:1;
      uint64_t AN24:1;
      uint64_t AN25:1;
      uint64_t AN26:1;
      uint64_t AN27:1;
      uint64_t AN28:1;
      uint64_t AN29:1;
      uint64_t AN30:1;
      uint64_t AN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADE;

  uint8_t res10[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t MAINXC:2;
      uint64_t USB0C:1;
      uint64_t USB1C:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPSR;

  uint8_t res11[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMIS:1;
      uint64_t CROUTE:2;
      uint64_t reservedSpace0:1;
      uint64_t RTCCOE:2;
      uint64_t SUBOUTE:2;
      uint64_t reservedSpace1:1;
      uint64_t USBP0E:1;
      uint64_t reservedSpace2:3;
      uint64_t USBP1E:1;
      uint64_t reservedSpace3:2;
      uint64_t JTAGEN0B:1;
      uint64_t JTAGEN1S:1;
      uint64_t reservedSpace4:6;
      uint64_t TRC0E:1;
      uint64_t TRC1E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR00;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTO00E:2;
      uint64_t RTO01E:2;
      uint64_t RTO02E:2;
      uint64_t RTO03E:2;
      uint64_t RTO04E:2;
      uint64_t RTO05E:2;
      uint64_t DTTI0C:1;
      uint64_t reservedSpace0:3;
      uint64_t DTTI0S:2;
      uint64_t FRCK0S:2;
      uint64_t IC00S:3;
      uint64_t IC01S:3;
      uint64_t IC02S:3;
      uint64_t IC03S:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR01;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTO10E:2;
      uint64_t RTO11E:2;
      uint64_t RTO12E:2;
      uint64_t RTO13E:2;
      uint64_t RTO14E:2;
      uint64_t RTO15E:2;
      uint64_t DTTI1C:1;
      uint64_t reservedSpace0:3;
      uint64_t DTTI1S:2;
      uint64_t FRCK1S:2;
      uint64_t IC10S:3;
      uint64_t IC11S:3;
      uint64_t IC12S:3;
      uint64_t IC13S:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR02;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTO20E:2;
      uint64_t RTO21E:2;
      uint64_t RTO22E:2;
      uint64_t RTO23E:2;
      uint64_t RTO24E:2;
      uint64_t RTO25E:2;
      uint64_t DTTI2C:1;
      uint64_t reservedSpace0:3;
      uint64_t DTTI2S:2;
      uint64_t FRCK2S:2;
      uint64_t IC20S:3;
      uint64_t IC21S:3;
      uint64_t IC22S:3;
      uint64_t IC23S:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR03;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TIOA0E:2;
      uint64_t TIOB0S:3;
      uint64_t reservedSpace1:1;
      uint64_t TIOA1S:2;
      uint64_t TIOA1E:2;
      uint64_t TIOB1S:2;
      uint64_t reservedSpace2:4;
      uint64_t TIOA2E:2;
      uint64_t TIOB2S:2;
      uint64_t reservedSpace3:2;
      uint64_t TIOA3S:2;
      uint64_t TIOA3E:2;
      uint64_t TIOB3S:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR04;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TIOA4E:2;
      uint64_t TIOB4S:2;
      uint64_t reservedSpace1:2;
      uint64_t TIOA5S:2;
      uint64_t TIOA5E:2;
      uint64_t TIOB5S:2;
      uint64_t reservedSpace2:4;
      uint64_t TIOA6E:2;
      uint64_t TIOB6S:2;
      uint64_t reservedSpace3:2;
      uint64_t TIOA7S:2;
      uint64_t TIOA7E:2;
      uint64_t TIOB7S:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR05;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EINT00S:2;
      uint64_t EINT01S:2;
      uint64_t EINT02S:2;
      uint64_t EINT03S:2;
      uint64_t EINT04S:2;
      uint64_t EINT05S:2;
      uint64_t EINT06S:2;
      uint64_t EINT07S:2;
      uint64_t EINT08S:2;
      uint64_t EINT09S:2;
      uint64_t EINT10S:2;
      uint64_t EINT11S:2;
      uint64_t EINT12S:2;
      uint64_t EINT13S:2;
      uint64_t EINT14S:2;
      uint64_t EINT15S:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR06;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SIN0S:2;
      uint64_t SOT0B:2;
      uint64_t SCK0B:2;
      uint64_t SIN1S:2;
      uint64_t SOT1B:2;
      uint64_t SCK1B:2;
      uint64_t SIN2S:2;
      uint64_t SOT2B:2;
      uint64_t SCK2B:2;
      uint64_t SIN3S:2;
      uint64_t SOT3B:2;
      uint64_t SCK3B:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR07;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTS4E:2;
      uint64_t CTS4S:2;
      uint64_t SIN4S:2;
      uint64_t SOT4B:2;
      uint64_t SCK4B:2;
      uint64_t SIN5S:2;
      uint64_t SOT5B:2;
      uint64_t SCK5B:2;
      uint64_t SIN6S:2;
      uint64_t SOT6B:2;
      uint64_t SCK6B:2;
      uint64_t SIN7S:2;
      uint64_t SOT7B:2;
      uint64_t SCK7B:2;
      uint64_t RTS5E:2;
      uint64_t CTS5S:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR08;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QAIN0S:2;
      uint64_t QBIN0S:2;
      uint64_t QZIN0S:2;
      uint64_t QAIN1S:2;
      uint64_t QBIN1S:2;
      uint64_t QZIN1S:2;
      uint64_t ADTRG0S:4;
      uint64_t ADTRG1S:4;
      uint64_t ADTRG2S:4;
      uint64_t CRX0S:2;
      uint64_t CTX0E:2;
      uint64_t CRX1S:2;
      uint64_t CTX1E:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR09;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UEDEFB:1;
      uint64_t UEDTHB:1;
      uint64_t UECLKE:1;
      uint64_t UEWEXE:1;
      uint64_t UEDQME:1;
      uint64_t UEOEXE:1;
      uint64_t UEFLSE:1;
      uint64_t UECS1E:1;
      uint64_t UECS2E:1;
      uint64_t UECS3E:1;
      uint64_t UECS4E:1;
      uint64_t UECS5E:1;
      uint64_t UECS6E:1;
      uint64_t UECS7E:1;
      uint64_t UEAOOE:1;
      uint64_t UEA08E:1;
      uint64_t UEA09E:1;
      uint64_t UEA10E:1;
      uint64_t UEA11E:1;
      uint64_t UEA12E:1;
      uint64_t UEA13E:1;
      uint64_t UEA14E:1;
      uint64_t UEA15E:1;
      uint64_t UEA16E:1;
      uint64_t UEA17E:1;
      uint64_t UEA18E:1;
      uint64_t UEA19E:1;
      uint64_t UEA20E:1;
      uint64_t UEA21E:1;
      uint64_t UEA22E:1;
      uint64_t UEA23E:1;
      uint64_t UEA24E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UEALEE:1;
      uint64_t UECS0E:1;
      uint64_t UEA01E:1;
      uint64_t UEA02E:1;
      uint64_t UEA03E:1;
      uint64_t UEA04E:1;
      uint64_t UEA05E:1;
      uint64_t UEA06E:1;
      uint64_t UEA07E:1;
      uint64_t UED00B:1;
      uint64_t UED01B:1;
      uint64_t UED02B:1;
      uint64_t UED03B:1;
      uint64_t UED04B:1;
      uint64_t UED05B:1;
      uint64_t UED06B:1;
      uint64_t UED07B:1;
      uint64_t UED08B:1;
      uint64_t UED09B:1;
      uint64_t UED10B:1;
      uint64_t UED11B:1;
      uint64_t UED12B:1;
      uint64_t UED13B:1;
      uint64_t UED14B:1;
      uint64_t UED15B:1;
      uint64_t UERLC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TIOA8E:2;
      uint64_t TIOB8S:2;
      uint64_t reservedSpace1:2;
      uint64_t TIOA9S:2;
      uint64_t TIOA9E:2;
      uint64_t TIOB9S:2;
      uint64_t reservedSpace2:4;
      uint64_t TIOA10E:2;
      uint64_t TIOB10S:2;
      uint64_t reservedSpace3:2;
      uint64_t TIOA11S:2;
      uint64_t TIOA11E:2;
      uint64_t TIOB11S:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t TIOA12E:2;
      uint64_t TIOB12S:2;
      uint64_t reservedSpace1:2;
      uint64_t TIOA13S:2;
      uint64_t TIOA13E:2;
      uint64_t TIOB13S:2;
      uint64_t reservedSpace2:4;
      uint64_t TIOA14E:2;
      uint64_t TIOB14S:2;
      uint64_t reservedSpace3:2;
      uint64_t TIOA15S:2;
      uint64_t TIOA15E:2;
      uint64_t TIOB15S:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QAIN2S:2;
      uint64_t QBIN2S:2;
      uint64_t QZIN2S:2;
      uint64_t reservedSpace0:12;
      uint64_t E_TD0E:1;
      uint64_t E_TD1E:1;
      uint64_t E_TE0E:1;
      uint64_t E_TE1E:1;
      uint64_t E_MC0E:1;
      uint64_t E_MC1B:1;
      uint64_t E_MD0B:1;
      uint64_t E_MD1B:1;
      uint64_t E_CKE:1;
      uint64_t E_PSE:1;
      uint64_t E_SPLC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EINT16S:2;
      uint64_t EINT17S:2;
      uint64_t EINT18S:2;
      uint64_t EINT19S:2;
      uint64_t EINT20S:2;
      uint64_t EINT21S:2;
      uint64_t EINT22S:2;
      uint64_t EINT23S:2;
      uint64_t EINT24S:2;
      uint64_t EINT25S:2;
      uint64_t EINT26S:2;
      uint64_t EINT27S:2;
      uint64_t EINT28S:2;
      uint64_t EINT29S:2;
      uint64_t EINT30S:2;
      uint64_t EINT31S:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCS6B:2;
      uint64_t SCS7B:2;
      uint64_t SIN8S:2;
      uint64_t SOT8B:2;
      uint64_t SCK8B:2;
      uint64_t SIN9S:2;
      uint64_t SOT9B:2;
      uint64_t SCK9B:2;
      uint64_t SIN10S:2;
      uint64_t SOT10B:2;
      uint64_t SCK10B:2;
      uint64_t SIN11S:2;
      uint64_t SOT11B:2;
      uint64_t SCK11B:2;
      uint64_t SFMPAC:1;
      uint64_t SFMPBC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t SIN12S:2;
      uint64_t SOT12B:2;
      uint64_t SCK12B:2;
      uint64_t SIN13S:2;
      uint64_t SOT13B:2;
      uint64_t SCK13B:2;
      uint64_t SIN14S:2;
      uint64_t SOT14B:2;
      uint64_t SCK14B:2;
      uint64_t SIN15S:2;
      uint64_t SOT15B:2;
      uint64_t SCK15B:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t QAIN3S:2;
      uint64_t QBIN3S:2;
      uint64_t QZIN3S:2;
      uint64_t reservedSpace1:4;
      uint64_t SDCLKE:2;
      uint64_t SDCMDB:2;
      uint64_t SDDATA0B:2;
      uint64_t SDDATA1B:2;
      uint64_t SDDATA2B:2;
      uint64_t SDDATA3B:2;
      uint64_t SDCDS:2;
      uint64_t SDWPS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR18;

  uint32_t EPFR19;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t UESMCKE:1;
      uint64_t UESMCEE:1;
      uint64_t UERASE:1;
      uint64_t UECASE:1;
      uint64_t UEDWEXE:1;
      uint64_t UECSXE:1;
      uint64_t UEDQM2E:1;
      uint64_t UEDQM3E:1;
      uint64_t UEDTHHB:1;
      uint64_t UED16B:1;
      uint64_t UED17B:1;
      uint64_t UED18B:1;
      uint64_t UED19B:1;
      uint64_t UED20B:1;
      uint64_t UED21B:1;
      uint64_t UED22B:1;
      uint64_t UED23B:1;
      uint64_t UED24B:1;
      uint64_t UED25B:1;
      uint64_t UED26B:1;
      uint64_t UED27B:1;
      uint64_t UED28B:1;
      uint64_t UED29B:1;
      uint64_t UED30B:1;
      uint64_t UED31B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EPFR20;

