iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t BUR01;
  uint8_t BUR02;
  uint8_t BUR03;
  uint8_t BUR04;
  uint8_t BUR05;
  uint8_t BUR06;
  uint8_t BUR07;
  uint8_t BUR08;
  uint8_t BUR09;
  uint8_t BUR10;
  uint8_t BUR11;
  uint8_t BUR12;
  uint8_t BUR13;
  uint8_t BUR14;
  uint8_t BUR15;
  uint8_t BUR16;
};

#define DS_0 (*(volatile struct DS_0_tag *) 0x40035104)

struct CRC_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t CRC32:1;
      uint64_t LTLEND:1;
      uint64_t LSBFST:1;
      uint64_t CRCLTE:1;
      uint64_t CRCLSF:1;
      uint64_t FXOR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CRCCR;

  uint8_t res0[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCINIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRCR;

};

#define CRC_0 (*(volatile struct CRC_0_tag *) 0x40039000)

struct WC_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t CTR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WCRD;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RLC:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WCRL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WCIF:1;
      uint64_t WCIE:1;
      uint64_t CS:2;
      uint64_t reservedSpace0:2;
      uint64_t WCOP:1;
      uint64_t WCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WCCR;

  uint8_t res0[13];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SEL_IN:2;
      uint64_t reservedSpace0:6;
      uint64_t SEL_OUT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_SEL;

  uint8_t res1[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CLK_EN:1;
      uint64_t CLK_EN_R:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CLK_EN;

};

#define WC_0 (*(volatile struct WC_0_tag *) 0x4003a000)

struct RTC_0_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t ST:1;
      uint64_t reservedSpace0:1;
      uint64_t RUN:1;
      uint64_t SRST:1;
      uint64_t SCST:1;
      uint64_t SCRST:1;
      uint64_t BUSY:1;
      uint64_t TRANS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTCR10;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MIEN:1;
      uint64_t HEN:1;
      uint64_t DEN:1;
      uint64_t MOEN:1;
      uint64_t YEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTCR11;

  uint8_t res1[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INTSSI:1;
      uint64_t INTSI:1;
      uint64_t INTMI:1;
      uint64_t INTHI:1;
      uint64_t INTTMI:1;
      uint64_t INTALI:1;
      uint64_t INTERI:1;
      uint64_t INTCRI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTCR12;

  uint8_t res2[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t INTSSIE:1;
      uint64_t INTSIE:1;
      uint64_t INTMIE:1;
      uint64_t INTHIE:1;
      uint64_t INTTMIE:1;
      uint64_t INTALIE:1;
      uint64_t INTERIE:1;
      uint64_t INTCRIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTCR13;

  uint8_t res3[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CREAD:1;
      uint64_t CWRITE:1;
      uint64_t BREAD:1;
      uint64_t BWRITE:1;
      uint64_t PREAD:1;
      uint64_t PWRITE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTCR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TMST:1;
      uint64_t TMEN:1;
      uint64_t TMRUN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WTCR21;

  uint8_t res4[4];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t S:4;
      uint64_t TS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTSR;

  uint8_t res5[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MI:4;
      uint64_t TMI:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTMIR;

  uint8_t res6[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t H:4;
      uint64_t TH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTHR;

  uint8_t res7[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t D:4;
      uint64_t TD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTDR;

  uint8_t res8[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DW:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTDW;

  uint8_t res9[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t MO:4;
      uint64_t TMO0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTMOR;

  uint8_t res10[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t Y:4;
      uint64_t TY:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTYR;

  uint8_t res11[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AMI:4;
      uint64_t TAMI:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ALMIR;

  uint8_t res12[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AH:4;
      uint64_t TAH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ALHR;

  uint8_t res13[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AD:4;
      uint64_t TAD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ALDR;

  uint8_t res14[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AMO:4;
      uint64_t TAMO0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ALMOR;

  uint8_t res15[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AY:4;
      uint64_t TAY:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ALYR;

  uint8_t res16[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TM0:1;
      uint64_t TM1:1;
      uint64_t TM2:1;
      uint64_t TM3:1;
      uint64_t TM4:1;
      uint64_t TM5:1;
      uint64_t TM6:1;
      uint64_t TM7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTTR0;

  uint8_t res17[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TM8:1;
      uint64_t TM9:1;
      uint64_t TM10:1;
      uint64_t TM11:1;
      uint64_t TM12:1;
      uint64_t TM13:1;
      uint64_t TM14:1;
      uint64_t TM15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTTR1;

  uint8_t res18[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TM16:1;
      uint64_t TM17:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTTR2;

  uint8_t res19[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WTCAL0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTCAL0;

