iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define CAN0_0 (*(volatile struct CAN0_0_tag *) 0x40062000)

struct CAN1_0_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t IE:1;
      uint64_t SIE:1;
      uint64_t EIE:1;
      uint64_t reservedSpace0:1;
      uint64_t DAR:1;
      uint64_t CCE:1;
      uint64_t TEST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CTRLR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TXOK:1;
      uint64_t RXOK:1;
      uint64_t EPASS:1;
      uint64_t EWARN:1;
      uint64_t BOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) STATR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TEC:8;
      uint64_t REC:7;
      uint64_t RP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ERRCNT;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSEG1:4;
      uint64_t TSEG2:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BTR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t INTID:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) INTR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t BASIC:1;
      uint64_t SILENT:1;
      uint64_t LBACK:1;
      uint64_t TX:2;
      uint64_t RX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TESTR;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BRPE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BRPER;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MESSAGENUMBER:8;
      uint64_t reservedSpace0:7;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1CREQ;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATAB:1;
      uint64_t DATAA:1;
      uint64_t NEWDAT:1;
      uint64_t CIP:1;
      uint64_t CONTROL:1;
      uint64_t ARB:1;
      uint64_t MASK:1;
      uint64_t WRRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1CMSK;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK0:1;
      uint64_t MSK1:1;
      uint64_t MSK2:1;
      uint64_t MSK3:1;
      uint64_t MSK4:1;
      uint64_t MSK5:1;
      uint64_t MSK6:1;
      uint64_t MSK7:1;
      uint64_t MSK8:1;
      uint64_t MSK9:1;
      uint64_t MSK10:1;
      uint64_t MSK11:1;
      uint64_t MSK12:1;
      uint64_t MSK13:1;
      uint64_t MSK14:1;
      uint64_t MSK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1MSK1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK16:1;
      uint64_t MSK17:1;
      uint64_t MSK18:1;
      uint64_t MSK19:1;
      uint64_t MSK20:1;
      uint64_t MSK21:1;
      uint64_t MSK22:1;
      uint64_t MSK23:1;
      uint64_t MSK24:1;
      uint64_t MSK25:1;
      uint64_t MSK26:1;
      uint64_t MSK27:1;
      uint64_t MSK28:1;
      uint64_t reservedSpace0:1;
      uint64_t MDIR:1;
      uint64_t MXTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1MSK2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ID0:1;
      uint64_t ID1:1;
      uint64_t ID2:1;
      uint64_t ID3:1;
      uint64_t ID4:1;
      uint64_t ID5:1;
      uint64_t ID6:1;
      uint64_t ID7:1;
      uint64_t ID8:1;
      uint64_t ID9:1;
      uint64_t ID10:1;
      uint64_t ID11:1;
      uint64_t ID12:1;
      uint64_t ID13:1;
      uint64_t ID14:1;
      uint64_t ID15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1ARB1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ID16:1;
      uint64_t ID17:1;
      uint64_t ID18:1;
      uint64_t ID19:1;
      uint64_t ID20:1;
      uint64_t ID21:1;
      uint64_t ID22:1;
      uint64_t ID23:1;
      uint64_t ID24:1;
      uint64_t ID25:1;
      uint64_t ID26:1;
      uint64_t ID27:1;
      uint64_t ID28:1;
      uint64_t DIR:1;
      uint64_t XTD:1;
      uint64_t MSGVAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1ARB2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DLC:4;
      uint64_t reservedSpace0:3;
      uint64_t EOB:1;
      uint64_t TXRQST:1;
      uint64_t RMTEN:1;
      uint64_t RXIE:1;
      uint64_t TXIE:1;
      uint64_t UMASK:1;
      uint64_t INTPND:1;
      uint64_t MSGLST:1;
      uint64_t NEWDAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1MCTR;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_0:8;
      uint64_t DATA_1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1DTA1_L;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_2:8;
      uint64_t DATA_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1DTA2_L;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_4:8;
      uint64_t DATA_5:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1DTB1_L;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_6:8;
      uint64_t DATA_7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1DTB2_L;

  uint8_t res2[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_3:8;
      uint64_t DATA_2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1DTA2_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_1:8;
      uint64_t DATA_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1DTA1_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_7:8;
      uint64_t DATA_6:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1DTB2_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_5:8;
      uint64_t DATA_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1DTB1_B;

  uint8_t res3[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MESSAGENUMBER:8;
      uint64_t reservedSpace0:7;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2CREQ;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATAB:1;
      uint64_t DATAA:1;
      uint64_t NEWDAT:1;
      uint64_t CIP:1;
      uint64_t CONTROL:1;
      uint64_t ARB:1;
      uint64_t MASK:1;
      uint64_t WRRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2CMSK;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK0:1;
      uint64_t MSK1:1;
      uint64_t MSK2:1;
      uint64_t MSK3:1;
      uint64_t MSK4:1;
      uint64_t MSK5:1;
      uint64_t MSK6:1;
      uint64_t MSK7:1;
      uint64_t MSK8:1;
      uint64_t MSK9:1;
      uint64_t MSK10:1;
      uint64_t MSK11:1;
      uint64_t MSK12:1;
      uint64_t MSK13:1;
      uint64_t MSK14:1;
      uint64_t MSK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2MSK1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK16:1;
      uint64_t MSK17:1;
      uint64_t MSK18:1;
      uint64_t MSK19:1;
      uint64_t MSK20:1;
      uint64_t MSK21:1;
      uint64_t MSK22:1;
      uint64_t MSK23:1;
      uint64_t MSK24:1;
      uint64_t MSK25:1;
      uint64_t MSK26:1;
      uint64_t MSK27:1;
      uint64_t MSK28:1;
      uint64_t reservedSpace0:1;
      uint64_t MDIR:1;
      uint64_t MXTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2MSK2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ID0:1;
      uint64_t ID1:1;
      uint64_t ID2:1;
      uint64_t ID3:1;
      uint64_t ID4:1;
      uint64_t ID5:1;
      uint64_t ID6:1;
      uint64_t ID7:1;
      uint64_t ID8:1;
      uint64_t ID9:1;
      uint64_t ID10:1;
      uint64_t ID11:1;
      uint64_t ID12:1;
      uint64_t ID13:1;
      uint64_t ID14:1;
      uint64_t ID15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2ARB1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ID16:1;
      uint64_t ID17:1;
      uint64_t ID18:1;
      uint64_t ID19:1;
      uint64_t ID20:1;
      uint64_t ID21:1;
      uint64_t ID22:1;
      uint64_t ID23:1;
      uint64_t ID24:1;
      uint64_t ID25:1;
      uint64_t ID26:1;
      uint64_t ID27:1;
      uint64_t ID28:1;
      uint64_t DIR:1;
      uint64_t XTD:1;
      uint64_t MSGVAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2ARB2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DLC:4;
      uint64_t reservedSpace0:3;
      uint64_t EOB:1;
      uint64_t TXRQST:1;
      uint64_t RMTEN:1;
      uint64_t RXIE:1;
      uint64_t TXIE:1;
      uint64_t UMASK:1;
      uint64_t INTPND:1;
      uint64_t MSGLST:1;
      uint64_t NEWDAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2MCTR;

  uint8_t res4[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_0:8;
      uint64_t DATA_1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTA1_L;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_2:8;
      uint64_t DATA_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTA2_L;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_4:8;
      uint64_t DATA_5:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTB1_L;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_6:8;
      uint64_t DATA_7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTB2_L;

