iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res5[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_3:8;
      uint64_t DATA_2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTA2_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_1:8;
      uint64_t DATA_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTA1_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_7:8;
      uint64_t DATA_6:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTB2_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_5:8;
      uint64_t DATA_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTB1_B;

  uint8_t res6[24];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TXRQST1:1;
      uint64_t TXRQST2:1;
      uint64_t TXRQST3:1;
      uint64_t TXRQST4:1;
      uint64_t TXRQST5:1;
      uint64_t TXRQST6:1;
      uint64_t TXRQST7:1;
      uint64_t TXRQST8:1;
      uint64_t TXRQST9:1;
      uint64_t TXRQST10:1;
      uint64_t TXRQST11:1;
      uint64_t TXRQST12:1;
      uint64_t TXRQST13:1;
      uint64_t TXRQST14:1;
      uint64_t TXRQST15:1;
      uint64_t TXRQST16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TREQR1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TXRQST17:1;
      uint64_t TXRQST18:1;
      uint64_t TXRQST19:1;
      uint64_t TXRQST20:1;
      uint64_t TXRQST21:1;
      uint64_t TXRQST22:1;
      uint64_t TXRQST23:1;
      uint64_t TXRQST24:1;
      uint64_t TXRQST25:1;
      uint64_t TXRQST26:1;
      uint64_t TXRQST27:1;
      uint64_t TXRQST28:1;
      uint64_t TXRQST29:1;
      uint64_t TXRQST30:1;
      uint64_t TXRQST31:1;
      uint64_t TXRQST32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TREQR2;

  uint8_t res7[12];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NEWDAT1:1;
      uint64_t NEWDAT2:1;
      uint64_t NEWDAT3:1;
      uint64_t NEWDAT4:1;
      uint64_t NEWDAT5:1;
      uint64_t NEWDAT6:1;
      uint64_t NEWDAT7:1;
      uint64_t NEWDAT8:1;
      uint64_t NEWDAT9:1;
      uint64_t NEWDAT10:1;
      uint64_t NEWDAT11:1;
      uint64_t NEWDAT12:1;
      uint64_t NEWDAT13:1;
      uint64_t NEWDAT14:1;
      uint64_t NEWDAT15:1;
      uint64_t NEWDAT16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NEWDT1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NEWDAT17:1;
      uint64_t NEWDAT18:1;
      uint64_t NEWDAT19:1;
      uint64_t NEWDAT20:1;
      uint64_t NEWDAT21:1;
      uint64_t NEWDAT22:1;
      uint64_t NEWDAT23:1;
      uint64_t NEWDAT24:1;
      uint64_t NEWDAT25:1;
      uint64_t NEWDAT26:1;
      uint64_t NEWDAT27:1;
      uint64_t NEWDAT28:1;
      uint64_t NEWDAT29:1;
      uint64_t NEWDAT30:1;
      uint64_t NEWDAT31:1;
      uint64_t NEWDAT32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NEWDT2;

  uint8_t res8[12];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t INTPND1:1;
      uint64_t INTPND2:1;
      uint64_t INTPND3:1;
      uint64_t INTPND4:1;
      uint64_t INTPND5:1;
      uint64_t INTPND6:1;
      uint64_t INTPND7:1;
      uint64_t INTPND8:1;
      uint64_t INTPND9:1;
      uint64_t INTPND10:1;
      uint64_t INTPND11:1;
      uint64_t INTPND12:1;
      uint64_t INTPND13:1;
      uint64_t INTPND14:1;
      uint64_t INTPND15:1;
      uint64_t INTPND16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) INTPND1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t INTPND17:1;
      uint64_t INTPND18:1;
      uint64_t INTPND19:1;
      uint64_t INTPND20:1;
      uint64_t INTPND21:1;
      uint64_t INTPND22:1;
      uint64_t INTPND23:1;
      uint64_t INTPND24:1;
      uint64_t INTPND25:1;
      uint64_t INTPND26:1;
      uint64_t INTPND27:1;
      uint64_t INTPND28:1;
      uint64_t INTPND29:1;
      uint64_t INTPND30:1;
      uint64_t INTPND31:1;
      uint64_t INTPND32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) INTPND2;

  uint8_t res9[12];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSGVAL1:1;
      uint64_t MSGVAL2:1;
      uint64_t MSGVAL3:1;
      uint64_t MSGVAL4:1;
      uint64_t MSGVAL5:1;
      uint64_t MSGVAL6:1;
      uint64_t MSGVAL7:1;
      uint64_t MSGVAL8:1;
      uint64_t MSGVAL9:1;
      uint64_t MSGVAL10:1;
      uint64_t MSGVAL11:1;
      uint64_t MSGVAL12:1;
      uint64_t MSGVAL13:1;
      uint64_t MSGVAL14:1;
      uint64_t MSGVAL15:1;
      uint64_t MSGVAL16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MSGVAL1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSGVAL17:1;
      uint64_t MSGVAL18:1;
      uint64_t MSGVAL19:1;
      uint64_t MSGVAL20:1;
      uint64_t MSGVAL21:1;
      uint64_t MSGVAL22:1;
      uint64_t MSGVAL23:1;
      uint64_t MSGVAL24:1;
      uint64_t MSGVAL25:1;
      uint64_t MSGVAL26:1;
      uint64_t MSGVAL27:1;
      uint64_t MSGVAL28:1;
      uint64_t MSGVAL29:1;
      uint64_t MSGVAL30:1;
      uint64_t MSGVAL31:1;
      uint64_t MSGVAL32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MSGVAL2;

};

#define CAN1_0 (*(volatile struct CAN1_0_tag *) 0x40063000)

struct SDIF_0_tag
{
  uint32_t DUMMY;
};

#define SDIF_0 (*(volatile struct SDIF_0_tag *) 0x4006e000)

struct System_Control_Space_System_Control_Block_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VARIANT:4;
      uint64_t PARTNO:12;
      uint64_t reservedSpace0:4;
      uint64_t REVISION:4;
      uint64_t IMPLEMENTER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VECTACTIVE:8;
      uint64_t reservedSpace0:3;
      uint64_t RETTOBASE:1;
      uint64_t VECTPENDING:10;
      uint64_t ISRPENDING:1;
      uint64_t ISRPREEMPT:1;
      uint64_t reservedSpace1:1;
      uint64_t PENDSTCLR:1;
      uint64_t PENDSTSET:1;
      uint64_t PENDSVCLR:1;
      uint64_t PENDSVSET:1;
      uint64_t reservedSpace2:2;
      uint64_t NMIPENDSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t TBLOFF:22;
      uint64_t TBLBASE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VTOR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VECTRESET:1;
      uint64_t VECTCLRACTIVE:1;
      uint64_t SYSRESETREQ:1;
      uint64_t reservedSpace0:5;
      uint64_t PRIGROUP:3;
      uint64_t reservedSpace1:4;
      uint64_t ENDIANESS:1;
      uint64_t VECTKEYVECTKEYSTAT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SLEEPONEXIT:1;
      uint64_t SLEEPDEEP:1;
      uint64_t reservedSpace1:1;
      uint64_t SEVONPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NONEBASETHRDENA:1;
      uint64_t USERSETMPEND:1;
      uint64_t reservedSpace0:1;
      uint64_t UNALIGN_TRP:1;
      uint64_t DIV_0_TRP:1;
      uint64_t reservedSpace1:3;
      uint64_t BFHFNMIGN:1;
      uint64_t STKALIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_4:8;
      uint64_t PRI_5:8;
      uint64_t PRI_6:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PRI_11:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PRI_14:8;
      uint64_t PRI_15:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEMFAULTACT:1;
      uint64_t BUSFAULTACT:1;
      uint64_t reservedSpace0:1;
      uint64_t USGFAULTACT:1;
      uint64_t reservedSpace1:3;
      uint64_t SVCALLACT:1;
      uint64_t MONITORACT:1;
      uint64_t reservedSpace2:1;
      uint64_t PENDSVACT:1;
      uint64_t SYSTICKACT:1;
      uint64_t USGFAULTPENDED:1;
      uint64_t MEMFAULTPENDED:1;
      uint64_t BUSFAULTPENDED:1;
      uint64_t SVCALLPENDED:1;
      uint64_t MEMFAULTENA:1;
      uint64_t BUSFAULTENA:1;
      uint64_t USGFAULTENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHCRS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IACCVIOL:1;
      uint64_t DACCVIOL:1;
      uint64_t reservedSpace0:1;
      uint64_t MUNSTKERR:1;
      uint64_t MSTKERR:1;
      uint64_t reservedSpace1:2;
      uint64_t MMARVALID:1;
      uint64_t IBUSERR:1;
      uint64_t PRECISERR:1;
      uint64_t IMPRECISERR:1;
      uint64_t UNSTKERR:1;
      uint64_t STKERR:1;
      uint64_t reservedSpace2:2;
      uint64_t BFARVALID:1;
      uint64_t UNDEFINSTR:1;
      uint64_t INVSTATE:1;
      uint64_t INVPC:1;
      uint64_t NOCP:1;
      uint64_t reservedSpace3:4;
      uint64_t UNALIGNED:1;
      uint64_t DIVBYZERO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t VECTTBL:1;
      uint64_t reservedSpace1:28;
      uint64_t FORCED:1;
      uint64_t DEBUGEVT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HFSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HALTED:1;
      uint64_t BKPT:1;
      uint64_t DWTTRAP:1;
      uint64_t VCATCH:1;
      uint64_t EXTERNAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DFSR;

  uint32_t MMFAR;
  uint32_t BFAR;
  uint32_t AFSR;
  uint32_t PFR0;
  uint32_t PFR1;
  uint32_t DFR0;
  uint32_t AFR0;
  uint32_t MMFR0;
  uint32_t MMFR1;
  uint32_t MMFR2;
  uint32_t MMFR3;
  uint32_t ISAR0;
  uint32_t ISAR1;
  uint32_t ISAR2;
  uint32_t ISAR3;
  uint32_t ISAR4;
  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CP0:2;
      uint64_t CP1:2;
      uint64_t CP2:2;
      uint64_t CP3:2;
      uint64_t CP4:2;
      uint64_t CP5:2;
      uint64_t CP6:2;
      uint64_t CP7:2;
      uint64_t reservedSpace0:4;
      uint64_t CP10:2;
      uint64_t CP11:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPACR;

