iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint32_t Mem_Manage_Address;
  uint32_t Bus_Fault_Address;
  uint8_t res9[84];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEPARATE:1;
      uint64_t reservedSpace0:7;
      uint64_t DREGION:8;
      uint64_t IREGION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUTYPE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t HFNMIENA:1;
      uint64_t PRIVDEFEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NUMBER:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUNUMBER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:3;
      uint64_t reservedSpace0:1;
      uint64_t VALID:27;
      uint64_t ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUBASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUATTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:3;
      uint64_t reservedSpace0:1;
      uint64_t VALID:27;
      uint64_t ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUBASE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUATTR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:3;
      uint64_t reservedSpace0:1;
      uint64_t VALID:27;
      uint64_t ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUBASE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUATTR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REGION:3;
      uint64_t reservedSpace0:1;
      uint64_t VALID:27;
      uint64_t ADDR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUBASE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t SIZE:5;
      uint64_t reservedSpace0:2;
      uint64_t SRD:8;
      uint64_t B:1;
      uint64_t C:1;
      uint64_t S:1;
      uint64_t TEX:3;
      uint64_t reservedSpace1:2;
      uint64_t AP:3;
      uint64_t reservedSpace2:1;
      uint64_t XN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MPUATTR3;

  uint8_t res10[324];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTID:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) Software_Trigger_Interrupt_Register;

};

#define M3_Peripherals (*(volatile struct M3_Peripherals_tag *) 0xe000e008)

struct AON_BATMON_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MEAS_EN:1;
      uint64_t CALC_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEASCFG;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEMPP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEMPP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEMPP2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BATMONP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BATMONP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG1:4;
      uint64_t CFG2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOSTRP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG:4;
      uint64_t OVR:1;
      uint64_t LOWLIM:1;
      uint64_t HIGHLIM:2;
      uint64_t FALLB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASHPUMPP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAC:8;
      uint64_t INT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BATUPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t INT:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TEMPUPD;

};

#define AON_BATMON (*(volatile struct AON_BATMON_tag *) 0x40095000)

struct AON_EVENT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WU0_EV:6;
      uint64_t reservedSpace0:2;
      uint64_t WU1_EV:6;
      uint64_t reservedSpace1:2;
      uint64_t WU2_EV:6;
      uint64_t reservedSpace2:2;
      uint64_t WU3_EV:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCUWUSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WU0_EV:6;
      uint64_t reservedSpace0:2;
      uint64_t WU1_EV:6;
      uint64_t reservedSpace1:2;
      uint64_t WU2_EV:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AUXWUSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AON_PROG0_EV:6;
      uint64_t reservedSpace0:2;
      uint64_t AON_PROG1_EV:6;
      uint64_t reservedSpace1:2;
      uint64_t AON_PROG2_EV:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVTOMCUSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_CH1_CAPT_EV:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCSEL;

