iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t MCU_SRAM_ERASE:1;
      uint64_t AUX_SRAM_ERASE:1;
      uint64_t reservedSpace1:4;
      uint64_t PWR_DWN_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCU_WARM_RESET:1;
      uint64_t MCU_RESET_SRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL1;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PER_E:3;
      uint64_t PER_M:5;
      uint64_t MAX_PER_E:3;
      uint64_t MAX_PER_M:5;
      uint64_t C1:4;
      uint64_t C2:4;
      uint64_t reservedSpace0:7;
      uint64_t ADAPTIVE_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RECHARGECFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MAX_USED_PER:16;
      uint64_t VDDR_SMPLS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RECHARGESTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PER_E:3;
      uint64_t PER_M:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCCFG;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t JTAG_PD_FORCE_ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JTAGCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USER_CODE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) JTAGUSERCODE;

};

#define AON_WUC (*(volatile struct AON_WUC_tag *) 0x40091000)

struct AUX_ADI4_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMPA_REF:4;
      uint64_t COMPA_IN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MUX0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMPA_IN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MUX1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMPB_REF:3;
      uint64_t ADCCOMPB_IN:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MUX2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ADCCOMPB_IN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MUX3;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:1;
      uint64_t TRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ISRC;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMPA_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t COMPB_EN:1;
      uint64_t COMPB_TRIM:3;
      uint64_t COMPA_REF_CURR_EN:1;
      uint64_t COMPA_REF_RES_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) COMP;

  uint8_t res0[1];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t COMPA_REF:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) MUX4;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t RESET_N:1;
      uint64_t reservedSpace0:1;
      uint64_t SMPL_CYCLE_EXP:4;
      uint64_t SMPL_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SCALE_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADC1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t reservedSpace0:2;
      uint64_t SRC:1;
      uint64_t EXT:1;
      uint64_t IOMUX:1;
      uint64_t REF_ON_IDLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADCREF0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VTRIM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADCREF1;

};

#define AUX_ADI4 (*(volatile struct AUX_ADI4_tag *) 0x400cb000)

struct AUX_AIODIO0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIODOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO0:2;
      uint64_t IO1:2;
      uint64_t IO2:2;
      uint64_t IO3:2;
      uint64_t IO4:2;
      uint64_t IO5:2;
      uint64_t IO6:2;
      uint64_t IO7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOMODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIODIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIODOUTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIODOUTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIODOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIODIE;

};

#define AUX_AIODIO0 (*(volatile struct AUX_AIODIO0_tag *) 0x400c1000)

struct AUX_AIODIO1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIODOUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO0:2;
      uint64_t IO1:2;
      uint64_t IO2:2;
      uint64_t IO3:2;
      uint64_t IO4:2;
      uint64_t IO5:2;
      uint64_t IO6:2;
      uint64_t IO7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOMODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIODIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIODOUTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIODOUTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIODOUTTGL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IO7_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIODIE;

