iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define FCFG1 (*(volatile struct FCFG1_tag *) 0x500010a0)

struct FLASH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t POWER_MODE:1;
      uint64_t BUSY:1;
      uint64_t SAMHOLD_DIS:1;
      uint64_t reservedSpace0:5;
      uint64_t EFUSE_ERRCODE:5;
      uint64_t EFUSE_CRC_ERROR:1;
      uint64_t EFUSE_TIMEOUT:1;
      uint64_t EFUSE_BLANK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIS_IDLE:1;
      uint64_t DIS_STANDBY:1;
      uint64_t reservedSpace0:1;
      uint64_t ENABLE_SWINTF:1;
      uint64_t DIS_READACCESS:1;
      uint64_t DIS_EFUSECLK:1;
      uint64_t STANDBY_PW_SEL:2;
      uint64_t STANDBY_MODE_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCODE_START:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSCODE_START;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECTORS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLASH_SIZE;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWLOCK:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FWLOCK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FWFLAG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FWFLAG;

  uint8_t res2[4028];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DUMPWORD:16;
      uint64_t reservedSpace0:8;
      uint64_t INSTRUCTION:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ROW:11;
      uint64_t BLOCK:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSEADDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EEN:1;
      uint64_t R:1;
      uint64_t P:1;
      uint64_t SPARE:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATAUPPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DATALOWER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GATING:1;
      uint64_t reservedSpace0:2;
      uint64_t SLAVEPOWER:2;
      uint64_t reservedSpace1:3;
      uint64_t IDLEGATING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSECFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESETDONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSESTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACCUMULATOR:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INPUTENABLE:4;
      uint64_t SYS_WS_READ_STATES:4;
      uint64_t SYS_REPAIR_EN:2;
      uint64_t SYS_DIEID_AUTOLOAD_EN:1;
      uint64_t EFC_FDI:1;
      uint64_t SYS_ECC_OVERRIDE_EN:1;
      uint64_t YS_ECC_SELF_TEST_EN:1;
      uint64_t OUTPUTENABLE:4;
      uint64_t EFC_AUTOLOAD_ERROR:1;
      uint64_t EFC_INSTRUCTION_ERROR:1;
      uint64_t EFC_INSTRUCTION_INFO:1;
      uint64_t EFC_SELF_TEST_ERROR:1;
      uint64_t SPARE:1;
      uint64_t DISROW0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BOUNDARY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KEY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSEFLAG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CODE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSEKEY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EFUSEDAY:5;
      uint64_t EFUSEMONTH:4;
      uint64_t EFUSEYEAR:7;
      uint64_t ODPDAY:5;
      uint64_t ODPMONTH:4;
      uint64_t ODPYEAR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSERELEASE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYS_WS_READ_STATES:4;
      uint64_t SYS_REPAIR_EN:2;
      uint64_t SYS_DIEID_AUTOLOAD_EN:1;
      uint64_t EFC_FCLRZ:1;
      uint64_t EFC_READY:1;
      uint64_t SYS_ECC_OVERRIDE_EN:1;
      uint64_t EFC_AUTOLOAD_ERROR:1;
      uint64_t EFC_INSTRUCTION_ERROR:1;
      uint64_t EFC_INSTRUCTION_INFO:1;
      uint64_t SYS_ECC_SELF_TEST_EN:1;
      uint64_t EFC_SELF_TEST_ERROR:1;
      uint64_t EFC_SELF_TEST_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSEPINS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DATA:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSECRA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MARGIN:2;
      uint64_t SPARE:1;
      uint64_t DEBUG:1;
      uint64_t READCLOCK:4;
      uint64_t DATABIT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSEREAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WRITECLOCK:9;
      uint64_t ITERATIONS:4;
      uint64_t VPPTOVDD:1;
      uint64_t CLOCKSTALL:16;
      uint64_t COMPAREDISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSEPROGRAM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CODE:5;
      uint64_t DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EFUSEERROR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FROM0:1;
      uint64_t FROMN:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SINGLEBIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FROM0:1;
      uint64_t FROMN:31;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TWOBIT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CYCLES:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELFTESTCYC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIGNATURE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SELFTESTSIGN;

  uint8_t res3[4016];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t RWAIT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FRDCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RM0:1;
      uint64_t RM1:1;
      uint64_t reservedSpace0:6;
      uint64_t RMBSEM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FSPRD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t SUSP_IGNR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEDACCTL1;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t FSM_DONE:1;
      uint64_t RVF_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FEDACSTAT;

