iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define FLASH (*(volatile struct FLASH_tag *) 0x4003001c)

struct GPIO_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO0:1;
      uint64_t reservedSpace0:7;
      uint64_t DIO1:1;
      uint64_t reservedSpace1:7;
      uint64_t DIO2:1;
      uint64_t reservedSpace2:7;
      uint64_t DIO3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUT3_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO4:1;
      uint64_t reservedSpace0:7;
      uint64_t DIO5:1;
      uint64_t reservedSpace1:7;
      uint64_t DIO6:1;
      uint64_t reservedSpace2:7;
      uint64_t DIO7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUT7_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO8:1;
      uint64_t reservedSpace0:7;
      uint64_t DIO9:1;
      uint64_t reservedSpace1:7;
      uint64_t DIO10:1;
      uint64_t reservedSpace2:7;
      uint64_t DIO11:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUT11_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO12:1;
      uint64_t reservedSpace0:7;
      uint64_t DIO13:1;
      uint64_t reservedSpace1:7;
      uint64_t DIO14:1;
      uint64_t reservedSpace2:7;
      uint64_t DIO15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUT15_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO16:1;
      uint64_t reservedSpace0:7;
      uint64_t DIO17:1;
      uint64_t reservedSpace1:7;
      uint64_t DIO18:1;
      uint64_t reservedSpace2:7;
      uint64_t DIO19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUT19_16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO20:1;
      uint64_t reservedSpace0:7;
      uint64_t DIO21:1;
      uint64_t reservedSpace1:7;
      uint64_t DIO22:1;
      uint64_t reservedSpace2:7;
      uint64_t DIO23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUT23_20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO24:1;
      uint64_t reservedSpace0:7;
      uint64_t DIO25:1;
      uint64_t reservedSpace1:7;
      uint64_t DIO26:1;
      uint64_t reservedSpace2:7;
      uint64_t DIO27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUT27_24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO28:1;
      uint64_t reservedSpace0:7;
      uint64_t DIO29:1;
      uint64_t reservedSpace1:7;
      uint64_t DIO30:1;
      uint64_t reservedSpace2:7;
      uint64_t DIO31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUT31_28;

  uint8_t res0[96];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO0:1;
      uint64_t DIO1:1;
      uint64_t DIO2:1;
      uint64_t DIO3:1;
      uint64_t DIO4:1;
      uint64_t DIO5:1;
      uint64_t DIO6:1;
      uint64_t DIO7:1;
      uint64_t DIO8:1;
      uint64_t DIO9:1;
      uint64_t DIO10:1;
      uint64_t DIO11:1;
      uint64_t DIO12:1;
      uint64_t DIO13:1;
      uint64_t DIO14:1;
      uint64_t DIO15:1;
      uint64_t DIO16:1;
      uint64_t DIO17:1;
      uint64_t DIO18:1;
      uint64_t DIO19:1;
      uint64_t DIO20:1;
      uint64_t DIO21:1;
      uint64_t DIO22:1;
      uint64_t DIO23:1;
      uint64_t DIO24:1;
      uint64_t DIO25:1;
      uint64_t DIO26:1;
      uint64_t DIO27:1;
      uint64_t DIO28:1;
      uint64_t DIO29:1;
      uint64_t DIO30:1;
      uint64_t DIO31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUT31_0;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO0:1;
      uint64_t DIO1:1;
      uint64_t DIO2:1;
      uint64_t DIO3:1;
      uint64_t DIO4:1;
      uint64_t DIO5:1;
      uint64_t DIO6:1;
      uint64_t DIO7:1;
      uint64_t DIO8:1;
      uint64_t DIO9:1;
      uint64_t DIO10:1;
      uint64_t DIO11:1;
      uint64_t DIO12:1;
      uint64_t DIO13:1;
      uint64_t DIO14:1;
      uint64_t DIO15:1;
      uint64_t DIO16:1;
      uint64_t DIO17:1;
      uint64_t DIO18:1;
      uint64_t DIO19:1;
      uint64_t DIO20:1;
      uint64_t DIO21:1;
      uint64_t DIO22:1;
      uint64_t DIO23:1;
      uint64_t DIO24:1;
      uint64_t DIO25:1;
      uint64_t DIO26:1;
      uint64_t DIO27:1;
      uint64_t DIO28:1;
      uint64_t DIO29:1;
      uint64_t DIO30:1;
      uint64_t DIO31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUTSET31_0;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO0:1;
      uint64_t DIO1:1;
      uint64_t DIO2:1;
      uint64_t DIO3:1;
      uint64_t DIO4:1;
      uint64_t DIO5:1;
      uint64_t DIO6:1;
      uint64_t DIO7:1;
      uint64_t DIO8:1;
      uint64_t DIO9:1;
      uint64_t DIO10:1;
      uint64_t DIO11:1;
      uint64_t DIO12:1;
      uint64_t DIO13:1;
      uint64_t DIO14:1;
      uint64_t DIO15:1;
      uint64_t DIO16:1;
      uint64_t DIO17:1;
      uint64_t DIO18:1;
      uint64_t DIO19:1;
      uint64_t DIO20:1;
      uint64_t DIO21:1;
      uint64_t DIO22:1;
      uint64_t DIO23:1;
      uint64_t DIO24:1;
      uint64_t DIO25:1;
      uint64_t DIO26:1;
      uint64_t DIO27:1;
      uint64_t DIO28:1;
      uint64_t DIO29:1;
      uint64_t DIO30:1;
      uint64_t DIO31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUTCLR31_0;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO0:1;
      uint64_t DIO1:1;
      uint64_t DIO2:1;
      uint64_t DIO3:1;
      uint64_t DIO4:1;
      uint64_t DIO5:1;
      uint64_t DIO6:1;
      uint64_t DIO7:1;
      uint64_t DIO8:1;
      uint64_t DIO9:1;
      uint64_t DIO10:1;
      uint64_t DIO11:1;
      uint64_t DIO12:1;
      uint64_t DIO13:1;
      uint64_t DIO14:1;
      uint64_t DIO15:1;
      uint64_t DIO16:1;
      uint64_t DIO17:1;
      uint64_t DIO18:1;
      uint64_t DIO19:1;
      uint64_t DIO20:1;
      uint64_t DIO21:1;
      uint64_t DIO22:1;
      uint64_t DIO23:1;
      uint64_t DIO24:1;
      uint64_t DIO25:1;
      uint64_t DIO26:1;
      uint64_t DIO27:1;
      uint64_t DIO28:1;
      uint64_t DIO29:1;
      uint64_t DIO30:1;
      uint64_t DIO31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DOUTTGL31_0;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIO0:1;
      uint64_t DIO1:1;
      uint64_t DIO2:1;
      uint64_t DIO3:1;
      uint64_t DIO4:1;
      uint64_t DIO5:1;
      uint64_t DIO6:1;
      uint64_t DIO7:1;
      uint64_t DIO8:1;
      uint64_t DIO9:1;
      uint64_t DIO10:1;
      uint64_t DIO11:1;
      uint64_t DIO12:1;
      uint64_t DIO13:1;
      uint64_t DIO14:1;
      uint64_t DIO15:1;
      uint64_t DIO16:1;
      uint64_t DIO17:1;
      uint64_t DIO18:1;
      uint64_t DIO19:1;
      uint64_t DIO20:1;
      uint64_t DIO21:1;
      uint64_t DIO22:1;
      uint64_t DIO23:1;
      uint64_t DIO24:1;
      uint64_t DIO25:1;
      uint64_t DIO26:1;
      uint64_t DIO27:1;
      uint64_t DIO28:1;
      uint64_t DIO29:1;
      uint64_t DIO30:1;
      uint64_t DIO31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIN31_0;

