iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define GPT1 (*(volatile struct GPT1_tag *) 0x40011000)

struct GPT2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFG:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMR:2;
      uint64_t TACM:1;
      uint64_t TAAMS:1;
      uint64_t TACDIR:1;
      uint64_t TAMIE:1;
      uint64_t TAWOT:1;
      uint64_t TASNAPS:1;
      uint64_t TAILD:1;
      uint64_t TAPWMIE:1;
      uint64_t TAMRSU:1;
      uint64_t TAPLO:1;
      uint64_t TACINTD:1;
      uint64_t TCACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBMR:2;
      uint64_t TBCM:1;
      uint64_t TBAMS:1;
      uint64_t TBCDIR:1;
      uint64_t TBMIE:1;
      uint64_t TBWOT:1;
      uint64_t TBSNAPS:1;
      uint64_t TBILD:1;
      uint64_t TBPWMIE:1;
      uint64_t TBMRSU:1;
      uint64_t TBPLO:1;
      uint64_t TBCINTD:1;
      uint64_t TCACT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAEN:1;
      uint64_t TASTALL:1;
      uint64_t TAEVENT:2;
      uint64_t RTCEN:1;
      uint64_t TAOTE:1;
      uint64_t TAPWML:1;
      uint64_t reservedSpace0:1;
      uint64_t TBEN:1;
      uint64_t TBSTALL:1;
      uint64_t TBEVENT:2;
      uint64_t reservedSpace1:1;
      uint64_t TBOTE:1;
      uint64_t TBPWML:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNC0:2;
      uint64_t SYNC1:2;
      uint64_t SYNC2:2;
      uint64_t SYNC3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYNC;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TATOIM:1;
      uint64_t CAMIM:1;
      uint64_t CAEIM:1;
      uint64_t RTCIM:1;
      uint64_t TAMIM:1;
      uint64_t DMAAIM:1;
      uint64_t reservedSpace0:2;
      uint64_t TBTOIM:1;
      uint64_t CBMIM:1;
      uint64_t CBEIM:1;
      uint64_t TBMIM:1;
      uint64_t reservedSpace1:1;
      uint64_t DMABIM:1;
      uint64_t reservedSpace2:2;
      uint64_t WUMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TATORIS:1;
      uint64_t CAMRIS:1;
      uint64_t CAERIS:1;
      uint64_t RTCRIS:1;
      uint64_t TAMRIS:1;
      uint64_t DMAARIS:1;
      uint64_t reservedSpace0:2;
      uint64_t TBTORIS:1;
      uint64_t CBMRIS:1;
      uint64_t CBERIS:1;
      uint64_t TBMRIS:1;
      uint64_t reservedSpace1:1;
      uint64_t DMABRIS:1;
      uint64_t reservedSpace2:2;
      uint64_t WURIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TATOMIS:1;
      uint64_t CAMMIS:1;
      uint64_t CAEMIS:1;
      uint64_t RTCMIS:1;
      uint64_t TAMMIS:1;
      uint64_t DMAAMIS:1;
      uint64_t reservedSpace0:2;
      uint64_t TBTOMIS:1;
      uint64_t CBMMIS:1;
      uint64_t CBEMIS:1;
      uint64_t TBMMIS:1;
      uint64_t reservedSpace1:1;
      uint64_t DMABMIS:1;
      uint64_t reservedSpace2:2;
      uint64_t WUMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TATOCINT:1;
      uint64_t CAMCINT:1;
      uint64_t CAECINT:1;
      uint64_t RTCCINT:1;
      uint64_t TAMCINT:1;
      uint64_t DMAAINT:1;
      uint64_t reservedSpace0:2;
      uint64_t TBTOCINT:1;
      uint64_t CBMCINT:1;
      uint64_t CBECINT:1;
      uint64_t TBMCINT:1;
      uint64_t reservedSpace1:1;
      uint64_t DMABINT:1;
      uint64_t reservedSpace2:2;
      uint64_t WUECINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAILR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAILR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBILR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBILR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAMATCHR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAMATCHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBMATCHR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBMATCHR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBPSR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAPSMR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBPSMR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBPMR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TAV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TBV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTCPD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCPD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TAPV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PSV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TBPV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TATODMAEN:1;
      uint64_t CAMDMAEN:1;
      uint64_t CAEDMAEN:1;
      uint64_t RTCDMAEN:1;
      uint64_t TAMDMAEN:1;
      uint64_t reservedSpace0:3;
      uint64_t TBTODMAEN:1;
      uint64_t CBMDMAEN:1;
      uint64_t CBEDMAEN:1;
      uint64_t TBMDMAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMAEV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TATOADCEN:1;
      uint64_t CAMADCEN:1;
      uint64_t CAEADCEN:1;
      uint64_t RTCADCEN:1;
      uint64_t TAMADCEN:1;
      uint64_t reservedSpace0:3;
      uint64_t TBTOADCEN:1;
      uint64_t CBMADCEN:1;
      uint64_t CBEADCEN:1;
      uint64_t TBMADCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ADCEV;

  uint8_t res1[3900];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VERSION:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VERSION;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CCP_AND_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ANDCCP;

