iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define GPT3 (*(volatile struct GPT3_tag *) 0x40013000)

struct I2S0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WCLK_SRC:2;
      uint64_t WCLK_INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIFWCLKSRC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t END_FRAME_IDX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIFDMACFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AD0:2;
      uint64_t reservedSpace0:2;
      uint64_t AD1:2;
      uint64_t reservedSpace1:2;
      uint64_t AD2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIFDIRCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WORD_LEN:5;
      uint64_t DUAL_PHASE:1;
      uint64_t SMPL_EDGE:1;
      uint64_t MEM_LEN_24:1;
      uint64_t DATA_DELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIFFMTCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIFWMASK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIFWMASK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIFWMASK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PULSE_WIDTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIFPWMVALUE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIFINPTRNEXT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIFINPTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIFOUTPTRNEXT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIFOUTPTR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STMP_EN:1;
      uint64_t IN_RDY:1;
      uint64_t OUT_RDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPT_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPXCNTCAPT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPXPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPT_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPWCNTCAPT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPWPER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IN_START_WCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPINTRIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OUT_START_WCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPOUTTRIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPWSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE_INC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPWADD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPXPERMIN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPWCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPXCNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPT_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPXCNTCAPT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAPT_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STMPWCNTCAPT1;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTR_ERR:1;
      uint64_t WCLK_ERR:1;
      uint64_t BUS_ERR:1;
      uint64_t WCLK_TIMEOUT:1;
      uint64_t AIF_DMA_OUT:1;
      uint64_t AIF_DMA_IN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTR_ERR:1;
      uint64_t WCLK_ERR:1;
      uint64_t BUS_ERR:1;
      uint64_t WCLK_TIMEOUT:1;
      uint64_t AIF_DMA_OUT:1;
      uint64_t AIF_DMA_IN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQFLAGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTR_ERR:1;
      uint64_t WCLK_ERR:1;
      uint64_t BUS_ERR:1;
      uint64_t WCLK_TIMEOUT:1;
      uint64_t AIF_DMA_OUT:1;
      uint64_t AIF_DMA_IN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PTR_ERR:1;
      uint64_t WCLK_ERR:1;
      uint64_t BUS_ERR:1;
      uint64_t WCLK_TIMEOUT:1;
      uint64_t AIF_DMA_OUT:1;
      uint64_t AIF_DMA_IN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQCLR;

};

#define I2S0 (*(volatile struct I2S0_tag *) 0x40021000)

struct IOC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PORT_ID:6;
      uint64_t reservedSpace0:2;
      uint64_t IOSTR:2;
      uint64_t IOCURR:2;
      uint64_t SLEW_RED:1;
      uint64_t PULL_CTL:2;
      uint64_t reservedSpace1:1;
      uint64_t EDGE_DET:2;
      uint64_t EDGE_IRQ_EN:1;
      uint64_t reservedSpace2:5;
      uint64_t IOMODE:3;
      uint64_t WU_CFG:2;
      uint64_t IE:1;
      uint64_t HYST_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCFG31;

