iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define IOC (*(volatile struct IOC_tag *) 0x40081000)

struct PRCM_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RATIO:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INFRCLKDIVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RATIO:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INFRCLKDIVS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RATIO:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INFRCLKDIVDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ULDO:1;
      uint64_t reservedSpace0:1;
      uint64_t MCU_VD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VDCTL;

  uint8_t res0[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LOAD:1;
      uint64_t LOAD_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKLOADCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCCLKG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VIMSCLKG;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_CLK_EN:1;
      uint64_t TRNG_CLK_EN:1;
      uint64_t reservedSpace0:6;
      uint64_t DMA_CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SECDMACLKGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_CLK_EN:1;
      uint64_t TRNG_CLK_EN:1;
      uint64_t reservedSpace0:6;
      uint64_t DMA_CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SECDMACLKGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_CLK_EN:1;
      uint64_t TRNG_CLK_EN:1;
      uint64_t reservedSpace0:6;
      uint64_t DMA_CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SECDMACLKGDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOCLKGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOCLKGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPIOCLKGDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPTCLKGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPTCLKGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPTCLKGDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2CCLKGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2CCLKGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2CCLKGDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTCLKGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTCLKGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) UARTCLKGDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSICLKGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSICLKGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSICLKGDS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCLKGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCLKGS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCLKGDS;

  uint8_t res2[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RATIO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUCLKDIV;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SBCLKSEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RATIO:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GPTCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t WCLK_PHASE:2;
      uint64_t SMPL_ON_POSEDGE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SCLKCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDIV:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SMCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BDIV:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SBCLKDIV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) I2SWCLKDIV;

  uint8_t res4[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t MCU:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWRESET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDT_STAT:1;
      uint64_t LOCKUP_STAT:1;
      uint64_t WR_TO_PINRESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WARMRESET;

