iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res5[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFC_ON:1;
      uint64_t SERIAL_ON:1;
      uint64_t PERIPH_ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCTL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCTL0RFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCTL0SERIAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCTL0PERIPH;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFC_ON:1;
      uint64_t SERIAL_ON:1;
      uint64_t PERIPH_ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSTAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSTAT0RFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSTAT0SERIAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSTAT0PERIPH;

  uint8_t res7[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t CPU_ON:1;
      uint64_t RFC_ON:1;
      uint64_t VIMS_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCTL1;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCTL1CPU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCTL1RFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDCTL1VIMS;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t CPU_ON:1;
      uint64_t RFC_ON:1;
      uint64_t VIMS_MODE:1;
      uint64_t BUS_ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSTAT1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSTAT1BUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSTAT1RFC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSTAT1CPU;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDSTAT1VIMS;

  uint8_t res10[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCMODESEL;

  uint8_t res11[80];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VIMS_bitfield:2;
      uint64_t RFC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMRETEN;

  uint8_t res12[40];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIZE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAMHWOPT;

};

#define PRCM (*(volatile struct PRCM_tag *) 0x40082000)

struct RFC_DBELL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMDSTA;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t FSCA:1;
      uint64_t MDMDONE:1;
      uint64_t MDMIN:1;
      uint64_t MDMOUT:1;
      uint64_t MDMSOFT:1;
      uint64_t TRCTK:1;
      uint64_t reservedSpace1:1;
      uint64_t RFEDONE:1;
      uint64_t RFESOFT0:1;
      uint64_t RFESOFT1:1;
      uint64_t RFESOFT2:1;
      uint64_t RATCH0:1;
      uint64_t RATCH1:1;
      uint64_t RATCH2:1;
      uint64_t RATCH3:1;
      uint64_t RATCH4:1;
      uint64_t RATCH5:1;
      uint64_t RATCH6:1;
      uint64_t RATCH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFHWIFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t FSCA:1;
      uint64_t MDMDONE:1;
      uint64_t MDMIN:1;
      uint64_t MDMOUT:1;
      uint64_t MDMSOFT:1;
      uint64_t TRCTK:1;
      uint64_t reservedSpace1:1;
      uint64_t RFEDONE:1;
      uint64_t RFESOFT0:1;
      uint64_t RFESOFT1:1;
      uint64_t RFESOFT2:1;
      uint64_t RATCH0:1;
      uint64_t RATCH1:1;
      uint64_t RATCH2:1;
      uint64_t RATCH3:1;
      uint64_t RATCH4:1;
      uint64_t RATCH5:1;
      uint64_t RATCH6:1;
      uint64_t RATCH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFHWIEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMMAND_DONE:1;
      uint64_t LAST_COMMAND_DONE:1;
      uint64_t FG_COMMAND_DONE:1;
      uint64_t LAST_FG_COMMAND_DONE:1;
      uint64_t TX_DONE:1;
      uint64_t TX_ACK:1;
      uint64_t TX_CTRL:1;
      uint64_t TX_CTRL_ACK:1;
      uint64_t TX_CTRL_ACK_ACK:1;
      uint64_t TX_RETRANS:1;
      uint64_t TX_ENTRY_DONE:1;
      uint64_t TX_BUFFER_CHANGED:1;
      uint64_t BG_COMMAND_SUSPENDED:1;
      uint64_t IRQ13:1;
      uint64_t IRQ14:1;
      uint64_t IRQ15:1;
      uint64_t RX_OK:1;
      uint64_t RX_NOK:1;
      uint64_t RX_IGNORED:1;
      uint64_t RX_EMPTY:1;
      uint64_t RX_CTRL:1;
      uint64_t RX_CTRL_ACK:1;
      uint64_t RX_BUF_FULL:1;
      uint64_t RX_ENTRY_DONE:1;
      uint64_t RX_DATA_WRITTEN:1;
      uint64_t RX_N_DATA_WRITTEN:1;
      uint64_t RX_ABORTED:1;
      uint64_t IRQ27:1;
      uint64_t SYNTH_NO_LOCK:1;
      uint64_t MODULES_UNLOCKED:1;
      uint64_t BOOT_DONE:1;
      uint64_t INTERNAL_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCPEIFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMMAND_DONE:1;
      uint64_t LAST_COMMAND_DONE:1;
      uint64_t FG_COMMAND_DONE:1;
      uint64_t LAST_FG_COMMAND_DONE:1;
      uint64_t TX_DONE:1;
      uint64_t TX_ACK:1;
      uint64_t TX_CTRL:1;
      uint64_t TX_CTRL_ACK:1;
      uint64_t TX_CTRL_ACK_ACK:1;
      uint64_t TX_RETRANS:1;
      uint64_t TX_ENTRY_DONE:1;
      uint64_t TX_BUFFER_CHANGED:1;
      uint64_t BG_COMMAND_SUSPENDED:1;
      uint64_t IRQ13:1;
      uint64_t IRQ14:1;
      uint64_t IRQ15:1;
      uint64_t RX_OK:1;
      uint64_t RX_NOK:1;
      uint64_t RX_IGNORED:1;
      uint64_t RX_EMPTY:1;
      uint64_t RX_CTRL:1;
      uint64_t RX_CTRL_ACK:1;
      uint64_t RX_BUF_FULL:1;
      uint64_t RX_ENTRY_DONE:1;
      uint64_t RX_DATA_WRITTEN:1;
      uint64_t RX_N_DATA_WRITTEN:1;
      uint64_t RX_ABORTED:1;
      uint64_t IRQ27:1;
      uint64_t SYNTH_NO_LOCK:1;
      uint64_t MODULES_UNLOCKED:1;
      uint64_t BOOT_DONE:1;
      uint64_t INTERNAL_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCPEIEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COMMAND_DONE:1;
      uint64_t LAST_COMMAND_DONE:1;
      uint64_t FG_COMMAND_DONE:1;
      uint64_t LAST_FG_COMMAND_DONE:1;
      uint64_t TX_DONE:1;
      uint64_t TX_ACK:1;
      uint64_t TX_CTRL:1;
      uint64_t TX_CTRL_ACK:1;
      uint64_t TX_CTRL_ACK_ACK:1;
      uint64_t TX_RETRANS:1;
      uint64_t TX_ENTRY_DONE:1;
      uint64_t TX_BUFFER_CHANGED:1;
      uint64_t BG_COMMAND_SUSPENDED:1;
      uint64_t IRQ13:1;
      uint64_t IRQ14:1;
      uint64_t IRQ15:1;
      uint64_t RX_OK:1;
      uint64_t RX_NOK:1;
      uint64_t RX_IGNORED:1;
      uint64_t RX_EMPTY:1;
      uint64_t RX_CTRL:1;
      uint64_t RX_CTRL_ACK:1;
      uint64_t RX_BUF_FULL:1;
      uint64_t RX_ENTRY_DONE:1;
      uint64_t RX_DATA_WRITTEN:1;
      uint64_t RX_N_DATA_WRITTEN:1;
      uint64_t RX_ABORTED:1;
      uint64_t IRQ27:1;
      uint64_t SYNTH_NO_LOCK:1;
      uint64_t MODULES_UNLOCKED:1;
      uint64_t BOOT_DONE:1;
      uint64_t INTERNAL_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFCPEISL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RFACKIFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GPOCTL0:4;
      uint64_t GPOCTL1:4;
      uint64_t GPOCTL2:4;
      uint64_t GPOCTL3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYSGPOCTL;

