iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define RFC_DBELL (*(volatile struct RFC_DBELL_tag *) 0x40041000)

struct RFC_PWR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFC:1;
      uint64_t CPE:1;
      uint64_t CPERAM:1;
      uint64_t MDM:1;
      uint64_t MDMRAM:1;
      uint64_t RFE:1;
      uint64_t RFERAM:1;
      uint64_t RAT:1;
      uint64_t PHA:1;
      uint64_t FSCA:1;
      uint64_t RFCTRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWMCLKEN;

};

#define RFC_PWR (*(volatile struct RFC_PWR_tag *) 0x40040000)

struct RFC_RAT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RATCNT;

  uint8_t res0[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RATCH0VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RATCH1VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RATCH2VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RATCH3VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RATCH4VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RATCH5VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RATCH6VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RATCH7VAL;

};

#define RFC_RAT (*(volatile struct RFC_RAT_tag *) 0x40043004)

struct SMPH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMPH31;

  uint8_t res0[1920];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PEEK31;

