iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res0[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t NR_OF_FROS:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWOPT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EIP_NUM:8;
      uint64_t EIP_NUM_COMPL:8;
      uint64_t HW_PATCH_LVL:4;
      uint64_t HW_MINOR_VER:4;
      uint64_t HW_MAJOR_VER:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVER0;

  uint8_t res1[8024];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RDY:1;
      uint64_t SHUTDOWN_OVF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQSTATMASK;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWVER1;

  uint8_t res3[8];

  uint32_t IRQSET;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWRESET;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQSTAT;

};

#define TRNG (*(volatile struct TRNG_tag *) 0x40028000)

struct UDMA0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASTERENABLE:1;
      uint64_t reservedSpace0:3;
      uint64_t STATE:4;
      uint64_t reservedSpace1:8;
      uint64_t TOTALCHANNELS:5;
      uint64_t reservedSpace2:7;
      uint64_t TEST:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATUS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MASTERENABLE:1;
      uint64_t reservedSpace0:4;
      uint64_t PRTOCTRL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t BASEPTR:22;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASEPTR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALTCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLSTATUS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WAITONREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SOFTREQ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SETBURST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARBURST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SETREQMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARREQMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SETCHANNELEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARCHANNELEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SETCHNLPRIALT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARCHNLPRIALT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SETCHNLPRIORITY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLEARCHNLPRIORITY;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ERROR;

  uint8_t res1[1204];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REQDONE;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHNLS:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DONEMASK;

};

#define UDMA0 (*(volatile struct UDMA0_tag *) 0x40020000)

struct VIMS_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t INV:1;
      uint64_t MODE_CHANGING:1;
      uint64_t SYSBUS_LB_DIS:1;
      uint64_t IDCODE_LB_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t PREF_EN:1;
      uint64_t ARB_CFG:1;
      uint64_t SYSBUS_LB_DIS:1;
      uint64_t IDCODE_LB_DIS:1;
      uint64_t reservedSpace0:23;
      uint64_t DYN_CG_EN:1;
      uint64_t STATS_EN:1;
      uint64_t STATS_CLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

};

#define VIMS (*(volatile struct VIMS_tag *) 0x40034000)

struct WDT_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTLOAD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTVALUE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VALUE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTEN:1;
      uint64_t RESEN:1;
      uint64_t INTTYPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTICR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTRIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RIS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTMIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIS;

