iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define ADC1_1 (*(volatile struct ADC1_1_tag *) 0x40027100)

struct ADC2_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t SCS:1;
      uint64_t PCS:1;
      uint64_t PCNS:1;
      uint64_t reservedSpace0:3;
      uint64_t FDAS:1;
      uint64_t ADSTP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADSR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t OVRIE:1;
      uint64_t CMPIE:1;
      uint64_t PCIE:1;
      uint64_t SCIE:1;
      uint64_t reservedSpace0:1;
      uint64_t CMPIF:1;
      uint64_t PCIF:1;
      uint64_t SCIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADCR;

  uint8_t res0[6];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SFS:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SFNS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SSTR:1;
      uint64_t SHEN:1;
      uint64_t RPT:1;
      uint64_t reservedSpace0:1;
      uint64_t SFCLR:1;
      uint64_t SOVR:1;
      uint64_t SFUL:1;
      uint64_t SEMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SCCR;

  uint8_t res1[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SC:5;
      uint64_t reservedSpace0:3;
      uint64_t RS:2;
      uint64_t reservedSpace1:2;
      uint64_t INVL:1;
      uint64_t reservedSpace2:7;
      uint64_t SD:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCFD;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AN16:1;
      uint64_t AN17:1;
      uint64_t AN18:1;
      uint64_t AN19:1;
      uint64_t AN20:1;
      uint64_t AN21:1;
      uint64_t AN22:1;
      uint64_t AN23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SCIS2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AN24:1;
      uint64_t AN25:1;
      uint64_t AN26:1;
      uint64_t AN27:1;
      uint64_t AN28:1;
      uint64_t AN29:1;
      uint64_t AN30:1;
      uint64_t AN31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SCIS3;

  uint8_t res2[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AN0:1;
      uint64_t AN1:1;
      uint64_t AN2:1;
      uint64_t AN3:1;
      uint64_t AN4:1;
      uint64_t AN5:1;
      uint64_t AN6:1;
      uint64_t AN7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SCIS0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t AN8:1;
      uint64_t AN9:1;
      uint64_t AN10:1;
      uint64_t AN11:1;
      uint64_t AN12:1;
      uint64_t AN13:1;
      uint64_t AN14:1;
      uint64_t AN15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SCIS1;

  uint8_t res3[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PFS:2;
      uint64_t reservedSpace0:2;
      uint64_t TEST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PFNS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PSTR:1;
      uint64_t PHEN:1;
      uint64_t PEEN:1;
      uint64_t ESCE:1;
      uint64_t PFCLR:1;
      uint64_t POVR:1;
      uint64_t PFUL:1;
      uint64_t PEMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCCR;

  uint8_t res4[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PC:5;
      uint64_t reservedSpace0:3;
      uint64_t RS:3;
      uint64_t reservedSpace1:1;
      uint64_t INVL:1;
      uint64_t reservedSpace2:7;
      uint64_t PD:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCFD;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t P1A:3;
      uint64_t P2A:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PCIS;

  uint8_t res5[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CCH:5;
      uint64_t CMD0:1;
      uint64_t CMD1:1;
      uint64_t CMPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CMPCR;

  uint8_t res6[1];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t CMAD:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CMPD;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TS16:1;
      uint64_t TS17:1;
      uint64_t TS18:1;
      uint64_t TS19:1;
      uint64_t TS20:1;
      uint64_t TS21:1;
      uint64_t TS22:1;
      uint64_t TS23:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADSS2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TS24:1;
      uint64_t TS25:1;
      uint64_t TS26:1;
      uint64_t TS27:1;
      uint64_t TS28:1;
      uint64_t TS29:1;
      uint64_t TS30:1;
      uint64_t TS31:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADSS3;

  uint8_t res7[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TS0:1;
      uint64_t TS1:1;
      uint64_t TS2:1;
      uint64_t TS3:1;
      uint64_t TS4:1;
      uint64_t TS5:1;
      uint64_t TS6:1;
      uint64_t TS7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADSS0;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t TS8:1;
      uint64_t TS9:1;
      uint64_t TS10:1;
      uint64_t TS11:1;
      uint64_t TS12:1;
      uint64_t TS13:1;
      uint64_t TS14:1;
      uint64_t TS15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADSS1;

  uint8_t res8[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ST1:5;
      uint64_t STX1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADST1;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ST0:5;
      uint64_t STX0:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADST0;

  uint8_t res9[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) ADCT;

  uint8_t res10[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t PRTSL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PRTSL;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SCTSL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) SCTSL;

  uint8_t res11[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ENBL:1;
      uint64_t READY:1;
      uint64_t reservedSpace0:6;
      uint64_t ENBLTIME:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ADCEN;

  uint8_t res12[6];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RCOOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WCMRCOT;

  uint8_t res13[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RCINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WCMRCIF;

  uint8_t res14[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RCOE:1;
      uint64_t RCOIE:1;
      uint64_t RCOIRS:1;
      uint64_t RCOCD:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WCMPCR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WCCH:5;
      uint64_t WCMD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WCMPSR;

  uint8_t res15[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t CMLD:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WCMPDL;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t CMHD:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WCMPDH;

