iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res1[255];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELIRQ:8;
      uint64_t reservedSpace0:8;
      uint64_t SELBIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ003SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELIRQ:8;
      uint64_t reservedSpace0:8;
      uint64_t SELBIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ004SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELIRQ:8;
      uint64_t reservedSpace0:8;
      uint64_t SELBIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ005SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELIRQ:8;
      uint64_t reservedSpace0:8;
      uint64_t SELBIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ006SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELIRQ:8;
      uint64_t reservedSpace0:8;
      uint64_t SELBIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ007SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELIRQ:8;
      uint64_t reservedSpace0:8;
      uint64_t SELBIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ008SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELIRQ:8;
      uint64_t reservedSpace0:8;
      uint64_t SELBIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ009SEL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SELIRQ:8;
      uint64_t reservedSpace0:8;
      uint64_t SELBIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ010SEL;

  uint8_t res2[208];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NMI:1;
      uint64_t HWINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXC02MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCSINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ000MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWWDTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ001MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LVDINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ002MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQBIT0:1;
      uint64_t IRQBIT1:1;
      uint64_t IRQBIT2:1;
      uint64_t IRQBIT3:1;
      uint64_t IRQBIT4:1;
      uint64_t IRQBIT5:1;
      uint64_t IRQBIT6:1;
      uint64_t IRQBIT7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ003MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQBIT0:1;
      uint64_t IRQBIT1:1;
      uint64_t IRQBIT2:1;
      uint64_t IRQBIT3:1;
      uint64_t IRQBIT4:1;
      uint64_t IRQBIT5:1;
      uint64_t IRQBIT6:1;
      uint64_t IRQBIT7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ004MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQBIT0:1;
      uint64_t IRQBIT1:1;
      uint64_t IRQBIT2:1;
      uint64_t IRQBIT3:1;
      uint64_t IRQBIT4:1;
      uint64_t IRQBIT5:1;
      uint64_t IRQBIT6:1;
      uint64_t IRQBIT7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ005MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQBIT0:1;
      uint64_t IRQBIT1:1;
      uint64_t IRQBIT2:1;
      uint64_t IRQBIT3:1;
      uint64_t IRQBIT4:1;
      uint64_t IRQBIT5:1;
      uint64_t IRQBIT6:1;
      uint64_t IRQBIT7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ006MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQBIT0:1;
      uint64_t IRQBIT1:1;
      uint64_t IRQBIT2:1;
      uint64_t IRQBIT3:1;
      uint64_t IRQBIT4:1;
      uint64_t IRQBIT5:1;
      uint64_t IRQBIT6:1;
      uint64_t IRQBIT7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ007MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQBIT0:1;
      uint64_t IRQBIT1:1;
      uint64_t IRQBIT2:1;
      uint64_t IRQBIT3:1;
      uint64_t IRQBIT4:1;
      uint64_t IRQBIT5:1;
      uint64_t IRQBIT6:1;
      uint64_t IRQBIT7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ008MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQBIT0:1;
      uint64_t IRQBIT1:1;
      uint64_t IRQBIT2:1;
      uint64_t IRQBIT3:1;
      uint64_t IRQBIT4:1;
      uint64_t IRQBIT5:1;
      uint64_t IRQBIT6:1;
      uint64_t IRQBIT7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ009MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRQBIT0:1;
      uint64_t IRQBIT1:1;
      uint64_t IRQBIT2:1;
      uint64_t IRQBIT3:1;
      uint64_t IRQBIT4:1;
      uint64_t IRQBIT5:1;
      uint64_t IRQBIT6:1;
      uint64_t IRQBIT7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ010MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ011MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ012MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ013MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ014MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ015MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ016MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ017MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ018MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUDINT0:1;
      uint64_t QUDINT1:1;
      uint64_t QUDINT2:1;
      uint64_t QUDINT3:1;
      uint64_t QUDINT4:1;
      uint64_t QUDINT5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ019MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUDINT0:1;
      uint64_t QUDINT1:1;
      uint64_t QUDINT2:1;
      uint64_t QUDINT3:1;
      uint64_t QUDINT4:1;
      uint64_t QUDINT5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ020MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAVEINT0:1;
      uint64_t WAVEINT1:1;
      uint64_t WAVEINT2:1;
      uint64_t WAVEINT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ021MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAVEINT0:1;
      uint64_t WAVEINT1:1;
      uint64_t WAVEINT2:1;
      uint64_t WAVEINT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ022MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAVEINT0:1;
      uint64_t WAVEINT1:1;
      uint64_t WAVEINT2:1;
      uint64_t WAVEINT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ023MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRT_PEAK_INT0:1;
      uint64_t FRT_PEAK_INT1:1;
      uint64_t FRT_PEAK_INT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ024MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRT_ZERO_INT0:1;
      uint64_t FRT_ZERO_INT1:1;
      uint64_t FRT_ZERO_INT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ025MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICUINT0:1;
      uint64_t ICUINT1:1;
      uint64_t ICUINT2:1;
      uint64_t ICUINT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ026MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCUINT0:1;
      uint64_t OCUINT1:1;
      uint64_t OCUINT2:1;
      uint64_t OCUINT3:1;
      uint64_t OCUINT4:1;
      uint64_t OCUINT5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ027MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRT_PEAK_INT0:1;
      uint64_t FRT_PEAK_INT1:1;
      uint64_t FRT_PEAK_INT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ028MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRT_ZERO_INT0:1;
      uint64_t FRT_ZERO_INT1:1;
      uint64_t FRT_ZERO_INT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ029MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICUINT0:1;
      uint64_t ICUINT1:1;
      uint64_t ICUINT2:1;
      uint64_t ICUINT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ030MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCUINT0:1;
      uint64_t OCUINT1:1;
      uint64_t OCUINT2:1;
      uint64_t OCUINT3:1;
      uint64_t OCUINT4:1;
      uint64_t OCUINT5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ031MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRT_PEAK_INT0:1;
      uint64_t FRT_PEAK_INT1:1;
      uint64_t FRT_PEAK_INT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ032MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRT_ZERO_INT0:1;
      uint64_t FRT_ZERO_INT1:1;
      uint64_t FRT_ZERO_INT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ033MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ICUINT0:1;
      uint64_t ICUINT1:1;
      uint64_t ICUINT2:1;
      uint64_t ICUINT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ034MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OCUINT0:1;
      uint64_t OCUINT1:1;
      uint64_t OCUINT2:1;
      uint64_t OCUINT3:1;
      uint64_t OCUINT4:1;
      uint64_t OCUINT5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ035MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPGINT0:1;
      uint64_t PPGINT1:1;
      uint64_t PPGINT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ036MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPGINT0:1;
      uint64_t PPGINT1:1;
      uint64_t PPGINT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ037MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPGINT0:1;
      uint64_t PPGINT1:1;
      uint64_t PPGINT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ038MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ039MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ040MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ041MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ042MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ043MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ044MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ045MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ046MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMINT1:1;
      uint64_t TIMINT2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ047MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WCINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ048MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BMEMCS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ049MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTCINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ050MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ051MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ052MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ053MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ054MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ055MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ056MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ057MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ058MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOSCINT:1;
      uint64_t SOSCINT:1;
      uint64_t MPLLINT:1;
      uint64_t UPLLINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ059MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ060MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ061MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ062MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ063MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ064MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ065MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ066MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ067MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ068MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ069MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ070MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ071MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ072MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ073MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ074MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ075MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCINT0:1;
      uint64_t ADCINT1:1;
      uint64_t ADCINT2:1;
      uint64_t ADCINT3:1;
      uint64_t ADCINT4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ076MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCINT0:1;
      uint64_t ADCINT1:1;
      uint64_t ADCINT2:1;
      uint64_t ADCINT3:1;
      uint64_t ADCINT4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ077MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_DRQ_INT0:1;
      uint64_t USB_DRQ_INT1:1;
      uint64_t USB_DRQ_INT2:1;
      uint64_t USB_DRQ_INT3:1;
      uint64_t USB_DRQ_INT4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ078MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_INT0:1;
      uint64_t USB_INT1:1;
      uint64_t USB_INT2:1;
      uint64_t USB_INT3:1;
      uint64_t USB_INT4:1;
      uint64_t USB_INT5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ079MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CANINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ080MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CANINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ081MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACSBD:1;
      uint64_t MACPMT:1;
      uint64_t MACLPI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ082MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMACINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ083MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMACINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ084MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMACINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ085MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMACINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ086MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMACINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ087MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMACINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ088MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMACINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ089MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMACINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ090MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DSTCINT0:1;
      uint64_t DSTCINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ091MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT0:1;
      uint64_t EXTINT1:1;
      uint64_t EXTINT2:1;
      uint64_t EXTINT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ092MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT0:1;
      uint64_t EXTINT1:1;
      uint64_t EXTINT2:1;
      uint64_t EXTINT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ093MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT0:1;
      uint64_t EXTINT1:1;
      uint64_t EXTINT2:1;
      uint64_t EXTINT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ094MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXTINT0:1;
      uint64_t EXTINT1:1;
      uint64_t EXTINT2:1;
      uint64_t EXTINT3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ095MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUDINT0:1;
      uint64_t QUDINT1:1;
      uint64_t QUDINT2:1;
      uint64_t QUDINT3:1;
      uint64_t QUDINT4:1;
      uint64_t QUDINT5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ096MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUDINT0:1;
      uint64_t QUDINT1:1;
      uint64_t QUDINT2:1;
      uint64_t QUDINT3:1;
      uint64_t QUDINT4:1;
      uint64_t QUDINT5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ097MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ098MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ099MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ100MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ101MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTINT0:1;
      uint64_t BTINT1:1;
      uint64_t BTINT2:1;
      uint64_t BTINT3:1;
      uint64_t BTINT4:1;
      uint64_t BTINT5:1;
      uint64_t BTINT6:1;
      uint64_t BTINT7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ102MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ103MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ104MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ105MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ106MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ107MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ108MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRINT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ109MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSINT0:1;
      uint64_t MFSINT1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ110MON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADCINT0:1;
      uint64_t ADCINT1:1;
      uint64_t ADCINT2:1;
      uint64_t ADCINT3:1;
      uint64_t ADCINT4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ111MON;

  uint32_t IRQ112MON;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t USB_DRQ_INT0:1;
      uint64_t USB_DRQ_INT1:1;
      uint64_t USB_DRQ_INT2:1;
      uint64_t USB_DRQ_INT3:1;
      uint64_t USB_DRQ_INT4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IRQ113MON;

