iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res12[172];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P00:1;
      uint64_t P01:1;
      uint64_t P02:1;
      uint64_t P03:1;
      uint64_t P04:1;
      uint64_t P05:1;
      uint64_t P06:1;
      uint64_t P07:1;
      uint64_t P08:1;
      uint64_t P09:1;
      uint64_t P0A:1;
      uint64_t P0B:1;
      uint64_t P0C:1;
      uint64_t P0D:1;
      uint64_t P0E:1;
      uint64_t P0F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PZR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P10:1;
      uint64_t P11:1;
      uint64_t P12:1;
      uint64_t P13:1;
      uint64_t P14:1;
      uint64_t P15:1;
      uint64_t P16:1;
      uint64_t P17:1;
      uint64_t P18:1;
      uint64_t P19:1;
      uint64_t P1A:1;
      uint64_t P1B:1;
      uint64_t P1C:1;
      uint64_t P1D:1;
      uint64_t P1E:1;
      uint64_t P1F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PZR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P20:1;
      uint64_t P21:1;
      uint64_t P22:1;
      uint64_t P23:1;
      uint64_t P24:1;
      uint64_t P25:1;
      uint64_t P26:1;
      uint64_t P27:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PZR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P30:1;
      uint64_t P31:1;
      uint64_t P32:1;
      uint64_t P33:1;
      uint64_t P34:1;
      uint64_t P35:1;
      uint64_t P36:1;
      uint64_t P37:1;
      uint64_t P38:1;
      uint64_t P39:1;
      uint64_t P3A:1;
      uint64_t P3B:1;
      uint64_t P3C:1;
      uint64_t P3D:1;
      uint64_t P3E:1;
      uint64_t P3F:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PZR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P40:1;
      uint64_t P41:1;
      uint64_t P42:1;
      uint64_t P43:1;
      uint64_t P44:1;
      uint64_t P45:1;
      uint64_t P46:1;
      uint64_t P47:1;
      uint64_t P48:1;
      uint64_t P49:1;
      uint64_t P4A:1;
      uint64_t P4B:1;
      uint64_t P4C:1;
      uint64_t P4D:1;
      uint64_t P4E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PZR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P50:1;
      uint64_t P51:1;
      uint64_t P52:1;
      uint64_t P53:1;
      uint64_t P54:1;
      uint64_t P55:1;
      uint64_t P56:1;
      uint64_t P57:1;
      uint64_t P58:1;
      uint64_t P59:1;
      uint64_t P5A:1;
      uint64_t P5B:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PZR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P60:1;
      uint64_t P61:1;
      uint64_t P62:1;
      uint64_t P63:1;
      uint64_t P64:1;
      uint64_t P65:1;
      uint64_t P66:1;
      uint64_t P67:1;
      uint64_t P68:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PZR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P70:1;
      uint64_t P71:1;
      uint64_t P72:1;
      uint64_t P73:1;
      uint64_t P74:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PZR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P80:1;
      uint64_t P81:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PZR8;

  uint8_t res13[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE0:1;
      uint64_t reservedSpace0:1;
      uint64_t PE2:1;
      uint64_t PE3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PZRE;

};

#define GPIO_1 (*(volatile struct GPIO_1_tag *) 0x4006f000)

struct LVD_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SVHI:4;
      uint64_t reservedSpace1:1;
      uint64_t LVDIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LVD_CTL;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LVDIR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LVD_STR;

  uint8_t res1[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LVDCL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LVD_CLR;

  uint8_t res2[3];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LVDLCK:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LVD_RLR;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t LVDIRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LVD_STR2;

};

#define LVD_1 (*(volatile struct LVD_1_tag *) 0x40035000)

struct DS_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t RTCCKE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) RCK_CTL;

  uint8_t res0[1787];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RTCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) PMD_CTL;

  uint8_t res1[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WINITX:1;
      uint64_t WLVDH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WRFSR;

  uint8_t res2[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WRTCI:1;
      uint64_t WLVDI:1;
      uint64_t WUI0:1;
      uint64_t WUI1:1;
      uint64_t WUI2:1;
      uint64_t WUI3:1;
      uint64_t WUI4:1;
      uint64_t WUI5:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WIFSR;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WRTCE:1;
      uint64_t WLVDE:1;
      uint64_t reservedSpace0:1;
      uint64_t WUI1E:1;
      uint64_t WUI2E:1;
      uint64_t WUI3E:1;
      uint64_t WUI4E:1;
      uint64_t WUI5E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WIER;

  uint8_t res4[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUI1LV:1;
      uint64_t WUI2LV:1;
      uint64_t WUI3LV:1;
      uint64_t WUI4LV:1;
      uint64_t WUI5LV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WILVR;

  uint8_t res5[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SRAMR:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) DSRAMR;

  uint8_t res6[235];

