iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res20[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WTCAL1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTCAL1;

  uint8_t res21[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WTCALEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTCALEN;

  uint8_t res22[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WTDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTDIV;

  uint8_t res23[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WTDIVEN:1;
      uint64_t WTDIVRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTDIVEN;

  uint8_t res24[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WTCALPRD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTCALPRD;

  uint8_t res25[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WTCOSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTCOSEL;

  uint8_t res26[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t DIV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) VB_CLKDIV;

  uint8_t res27[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOSCEX:1;
      uint64_t SOSCNTL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) WTOSCCNT;

  uint8_t res28[3];

  uint8_t CCS;
  uint8_t res29[3];

  uint8_t CCB;
  uint8_t res30[3];

  uint8_t TRIM;
  uint8_t res31[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t BOOST:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) BOOST;

  uint8_t res32[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t WUP0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) EWKUP;

  uint8_t res33[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t reservedSpace0:7;
      uint64_t PON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) VDET;

  uint8_t res34[3];

  uint8_t FDET;
  uint8_t res35[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HIBRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HIBRST;

  uint8_t res36[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VPFR0:1;
      uint64_t VPFR1:1;
      uint64_t VPFR2:1;
      uint64_t VPFR3:1;
      uint64_t SPSR0:1;
      uint64_t SPSR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) VBPFR;

  uint8_t res37[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VPCR0:1;
      uint64_t VPCR1:1;
      uint64_t VPCR2:1;
      uint64_t VPCR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) VBPCR;

  uint8_t res38[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VDDR0:1;
      uint64_t VDDR1:1;
      uint64_t VDDR2:1;
      uint64_t VDDR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) VBDDR;

  uint8_t res39[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VDIR0:1;
      uint64_t VDIR1:1;
      uint64_t VDIR2:1;
      uint64_t VDIR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) VBDIR;

  uint8_t res40[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VDOR0:1;
      uint64_t VDOR1:1;
      uint64_t VDOR2:1;
      uint64_t VDOR3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) VBDOR;

  uint8_t res41[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t VPZR0:1;
      uint64_t VPZR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) VBPZR;

  uint8_t res42[79];

  uint8_t BREG00;
  uint8_t BREG01;
  uint8_t BREG02;
  uint8_t BREG03;
  uint8_t BREG04;
  uint8_t BREG05;
  uint8_t BREG06;
  uint8_t BREG07;
  uint8_t BREG08;
  uint8_t BREG09;
  uint8_t BREG0A;
  uint8_t BREG0B;
  uint8_t BREG0C;
  uint8_t BREG0D;
  uint8_t BREG0E;
  uint8_t BREG0F;
  uint8_t BREG10;
  uint8_t BREG11;
  uint8_t BREG12;
  uint8_t BREG13;
  uint8_t BREG14;
  uint8_t BREG15;
  uint8_t BREG16;
  uint8_t BREG17;
  uint8_t BREG18;
  uint8_t BREG19;
  uint8_t BREG1A;
  uint8_t BREG1B;
  uint8_t BREG1C;
  uint8_t BREG1D;
  uint8_t BREG1E;
  uint8_t BREG1F;
  uint8_t BREG20;
  uint8_t BREG21;
  uint8_t BREG22;
  uint8_t BREG23;
  uint8_t BREG24;
  uint8_t BREG25;
  uint8_t BREG26;
  uint8_t BREG27;
  uint8_t BREG28;
  uint8_t BREG29;
  uint8_t BREG2A;
  uint8_t BREG2B;
  uint8_t BREG2C;
  uint8_t BREG2D;
  uint8_t BREG2E;
  uint8_t BREG2F;
  uint8_t BREG30;
  uint8_t BREG31;
  uint8_t BREG32;
  uint8_t BREG33;
  uint8_t BREG34;
  uint8_t BREG35;
  uint8_t BREG36;
  uint8_t BREG37;
  uint8_t BREG38;
  uint8_t BREG39;
  uint8_t BREG3A;
  uint8_t BREG3B;
  uint8_t BREG3C;
  uint8_t BREG3D;
  uint8_t BREG3E;
  uint8_t BREG3F;
  uint8_t BREG40;
  uint8_t BREG41;
  uint8_t BREG42;
  uint8_t BREG43;
  uint8_t BREG44;
  uint8_t BREG45;
  uint8_t BREG46;
  uint8_t BREG47;
  uint8_t BREG48;
  uint8_t BREG49;
  uint8_t BREG4A;
  uint8_t BREG4B;
  uint8_t BREG4C;
  uint8_t BREG4D;
  uint8_t BREG4E;
  uint8_t BREG4F;
  uint8_t BREG50;
  uint8_t BREG51;
  uint8_t BREG52;
  uint8_t BREG53;
  uint8_t BREG54;
  uint8_t BREG55;
  uint8_t BREG56;
  uint8_t BREG57;
  uint8_t BREG58;
  uint8_t BREG59;
  uint8_t BREG5A;
  uint8_t BREG5B;
  uint8_t BREG5C;
  uint8_t BREG5D;
  uint8_t BREG5E;
  uint8_t BREG5F;
  uint8_t BREG60;
  uint8_t BREG61;
  uint8_t BREG62;
  uint8_t BREG63;
  uint8_t BREG64;
  uint8_t BREG65;
  uint8_t BREG66;
  uint8_t BREG67;
  uint8_t BREG68;
  uint8_t BREG69;
  uint8_t BREG6A;
  uint8_t BREG6B;
  uint8_t BREG6C;
  uint8_t BREG6D;
  uint8_t BREG6E;
  uint8_t BREG6F;
  uint8_t BREG70;
  uint8_t BREG71;
  uint8_t BREG72;
  uint8_t BREG73;
  uint8_t BREG74;
  uint8_t BREG75;
  uint8_t BREG76;
  uint8_t BREG77;
  uint8_t BREG78;
  uint8_t BREG79;
  uint8_t BREG7A;
  uint8_t BREG7B;
  uint8_t BREG7C;
  uint8_t BREG7D;
  uint8_t BREG7E;
  uint8_t BREG7F;
};

#define RTC_1 (*(volatile struct RTC_1_tag *) 0x4003b100)

struct LCR_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t LCR_PRSLD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) LCR_PRSLD;

