iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define LCR_1 (*(volatile struct LCR_1_tag *) 0x4003c000)

struct CLK_GATING_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSCK0:1;
      uint64_t MFSCK1:1;
      uint64_t MFSCK2:1;
      uint64_t MFSCK3:1;
      uint64_t MFSCK4:1;
      uint64_t MFSCK5:1;
      uint64_t MFSCK6:1;
      uint64_t MFSCK7:1;
      uint64_t MFSCK8:1;
      uint64_t MFSCK9:1;
      uint64_t MFSCK10:1;
      uint64_t MFSCK11:1;
      uint64_t MFSCK12:1;
      uint64_t MFSCK13:1;
      uint64_t MFSCK14:1;
      uint64_t MFSCK15:1;
      uint64_t ADCCK0:1;
      uint64_t ADCCK1:1;
      uint64_t ADCCK2:1;
      uint64_t ADCCK3:1;
      uint64_t reservedSpace0:4;
      uint64_t DMACK:1;
      uint64_t reservedSpace1:1;
      uint64_t EXBCK:1;
      uint64_t reservedSpace2:1;
      uint64_t GIOCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKEN0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MFSRST0:1;
      uint64_t MFSRST1:1;
      uint64_t MFSRST2:1;
      uint64_t MFSRST3:1;
      uint64_t MFSRST4:1;
      uint64_t MFSRST5:1;
      uint64_t MFSRST6:1;
      uint64_t MFSRST7:1;
      uint64_t MFSRST8:1;
      uint64_t MFSRST9:1;
      uint64_t MFSRST10:1;
      uint64_t MFSRST11:1;
      uint64_t MFSRST12:1;
      uint64_t MFSRST13:1;
      uint64_t MFSRST14:1;
      uint64_t MFSRST15:1;
      uint64_t ADCRST0:1;
      uint64_t ADCRST1:1;
      uint64_t ADCRST2:1;
      uint64_t ADCRST3:1;
      uint64_t reservedSpace0:4;
      uint64_t DMARST:1;
      uint64_t reservedSpace1:1;
      uint64_t EXBRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRST0;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTMCK0:1;
      uint64_t BTMCK1:1;
      uint64_t BTMCK2:1;
      uint64_t BTMCK3:1;
      uint64_t reservedSpace0:4;
      uint64_t MFTCK0:1;
      uint64_t MFTCK1:1;
      uint64_t MFTCK2:1;
      uint64_t MFTCK3:1;
      uint64_t reservedSpace1:4;
      uint64_t QDUCK0:1;
      uint64_t QDUCK1:1;
      uint64_t QDUCK2:1;
      uint64_t QDUCK3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKEN1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BTMRST0:1;
      uint64_t BTMRST1:1;
      uint64_t BTMRST2:1;
      uint64_t BTMRST3:1;
      uint64_t reservedSpace0:4;
      uint64_t MFTRST0:1;
      uint64_t MFTRST1:1;
      uint64_t MFTRST2:1;
      uint64_t MFTRST3:1;
      uint64_t reservedSpace1:4;
      uint64_t QDURST0:1;
      uint64_t QDURST1:1;
      uint64_t QDURST2:1;
      uint64_t QDURST3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRST1;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBCK0:1;
      uint64_t USBCK1:1;
      uint64_t reservedSpace0:2;
      uint64_t CANCK0:1;
      uint64_t CANCK1:1;
      uint64_t reservedSpace1:2;
      uint64_t SDCCK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CKEN2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USBRST0:1;
      uint64_t USBRST1:1;
      uint64_t reservedSpace0:2;
      uint64_t CANRST0:1;
      uint64_t CANRST1:1;
      uint64_t reservedSpace1:2;
      uint64_t SDCRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MRST2;

};

#define CLK_GATING_1 (*(volatile struct CLK_GATING_1_tag *) 0x4003c100)

struct PLL_CONTROL_1_tag
{
  uint32_t SSCTL1;
  uint32_t SSCTL2;
};

#define PLL_CONTROL_1 (*(volatile struct PLL_CONTROL_1_tag *) 0x4003c800)

struct EXBUS_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTH:2;
      uint64_t RBMON:1;
      uint64_t WEOFF:1;
      uint64_t NAND:1;
      uint64_t PAGE:1;
      uint64_t RDY:1;
      uint64_t SHRTDOUT:1;
      uint64_t MPXMODE:1;
      uint64_t ALEINV:1;
      uint64_t reservedSpace0:1;
      uint64_t MPXDOFF:1;
      uint64_t MPXCSOF:1;
      uint64_t MOEXEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTH:2;
      uint64_t RBMON:1;
      uint64_t WEOFF:1;
      uint64_t NAND:1;
      uint64_t PAGE:1;
      uint64_t RDY:1;
      uint64_t SHRTDOUT:1;
      uint64_t MPXMODE:1;
      uint64_t ALEINV:1;
      uint64_t reservedSpace0:1;
      uint64_t MPXDOFF:1;
      uint64_t MPXCSOF:1;
      uint64_t MOEXEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTH:2;
      uint64_t RBMON:1;
      uint64_t WEOFF:1;
      uint64_t NAND:1;
      uint64_t PAGE:1;
      uint64_t RDY:1;
      uint64_t SHRTDOUT:1;
      uint64_t MPXMODE:1;
      uint64_t ALEINV:1;
      uint64_t reservedSpace0:1;
      uint64_t MPXDOFF:1;
      uint64_t MPXCSOF:1;
      uint64_t MOEXEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTH:2;
      uint64_t RBMON:1;
      uint64_t WEOFF:1;
      uint64_t NAND:1;
      uint64_t PAGE:1;
      uint64_t RDY:1;
      uint64_t SHRTDOUT:1;
      uint64_t MPXMODE:1;
      uint64_t ALEINV:1;
      uint64_t reservedSpace0:1;
      uint64_t MPXDOFF:1;
      uint64_t MPXCSOF:1;
      uint64_t MOEXEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTH:2;
      uint64_t RBMON:1;
      uint64_t WEOFF:1;
      uint64_t NAND:1;
      uint64_t PAGE:1;
      uint64_t RDY:1;
      uint64_t SHRTDOUT:1;
      uint64_t MPXMODE:1;
      uint64_t ALEINV:1;
      uint64_t reservedSpace0:1;
      uint64_t MPXDOFF:1;
      uint64_t MPXCSOF:1;
      uint64_t MOEXEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTH:2;
      uint64_t RBMON:1;
      uint64_t WEOFF:1;
      uint64_t NAND:1;
      uint64_t PAGE:1;
      uint64_t RDY:1;
      uint64_t SHRTDOUT:1;
      uint64_t MPXMODE:1;
      uint64_t ALEINV:1;
      uint64_t reservedSpace0:1;
      uint64_t MPXDOFF:1;
      uint64_t MPXCSOF:1;
      uint64_t MOEXEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTH:2;
      uint64_t RBMON:1;
      uint64_t WEOFF:1;
      uint64_t NAND:1;
      uint64_t PAGE:1;
      uint64_t RDY:1;
      uint64_t SHRTDOUT:1;
      uint64_t MPXMODE:1;
      uint64_t ALEINV:1;
      uint64_t reservedSpace0:1;
      uint64_t MPXDOFF:1;
      uint64_t MPXCSOF:1;
      uint64_t MOEXEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WDTH:2;
      uint64_t RBMON:1;
      uint64_t WEOFF:1;
      uint64_t NAND:1;
      uint64_t PAGE:1;
      uint64_t RDY:1;
      uint64_t SHRTDOUT:1;
      uint64_t MPXMODE:1;
      uint64_t ALEINV:1;
      uint64_t reservedSpace0:1;
      uint64_t MPXDOFF:1;
      uint64_t MPXCSOF:1;
      uint64_t MOEXEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MODE7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RACC:4;
      uint64_t RADC:4;
      uint64_t FRADC:4;
      uint64_t RIDLC:4;
      uint64_t WACC:4;
      uint64_t WADC:4;
      uint64_t WWEC:4;
      uint64_t WIDLC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RACC:4;
      uint64_t RADC:4;
      uint64_t FRADC:4;
      uint64_t RIDLC:4;
      uint64_t WACC:4;
      uint64_t WADC:4;
      uint64_t WWEC:4;
      uint64_t WIDLC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RACC:4;
      uint64_t RADC:4;
      uint64_t FRADC:4;
      uint64_t RIDLC:4;
      uint64_t WACC:4;
      uint64_t WADC:4;
      uint64_t WWEC:4;
      uint64_t WIDLC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RACC:4;
      uint64_t RADC:4;
      uint64_t FRADC:4;
      uint64_t RIDLC:4;
      uint64_t WACC:4;
      uint64_t WADC:4;
      uint64_t WWEC:4;
      uint64_t WIDLC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RACC:4;
      uint64_t RADC:4;
      uint64_t FRADC:4;
      uint64_t RIDLC:4;
      uint64_t WACC:4;
      uint64_t WADC:4;
      uint64_t WWEC:4;
      uint64_t WIDLC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RACC:4;
      uint64_t RADC:4;
      uint64_t FRADC:4;
      uint64_t RIDLC:4;
      uint64_t WACC:4;
      uint64_t WADC:4;
      uint64_t WWEC:4;
      uint64_t WIDLC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RACC:4;
      uint64_t RADC:4;
      uint64_t FRADC:4;
      uint64_t RIDLC:4;
      uint64_t WACC:4;
      uint64_t WADC:4;
      uint64_t WWEC:4;
      uint64_t WIDLC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RACC:4;
      uint64_t RADC:4;
      uint64_t FRADC:4;
      uint64_t RIDLC:4;
      uint64_t WACC:4;
      uint64_t WADC:4;
      uint64_t WWEC:4;
      uint64_t WIDLC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:8;
      uint64_t reservedSpace0:8;
      uint64_t MASK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AREA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:8;
      uint64_t reservedSpace0:8;
      uint64_t MASK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AREA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:8;
      uint64_t reservedSpace0:8;
      uint64_t MASK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AREA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:8;
      uint64_t reservedSpace0:8;
      uint64_t MASK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AREA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:8;
      uint64_t reservedSpace0:8;
      uint64_t MASK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AREA4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:8;
      uint64_t reservedSpace0:8;
      uint64_t MASK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AREA5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:8;
      uint64_t reservedSpace0:8;
      uint64_t MASK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AREA6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:8;
      uint64_t reservedSpace0:8;
      uint64_t MASK:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AREA7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALC:4;
      uint64_t ALES:4;
      uint64_t ALEW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATIM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALC:4;
      uint64_t ALES:4;
      uint64_t ALEW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALC:4;
      uint64_t ALES:4;
      uint64_t ALEW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATIM2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALC:4;
      uint64_t ALES:4;
      uint64_t ALEW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATIM3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALC:4;
      uint64_t ALES:4;
      uint64_t ALEW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATIM4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALC:4;
      uint64_t ALES:4;
      uint64_t ALEW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATIM5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALC:4;
      uint64_t ALES:4;
      uint64_t ALEW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATIM6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALC:4;
      uint64_t ALES:4;
      uint64_t ALEW:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATIM7;

  uint8_t res0[128];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDON:1;
      uint64_t PDON:1;
      uint64_t ROFF:1;
      uint64_t reservedSpace0:1;
      uint64_t CASEL:2;
      uint64_t reservedSpace1:2;
      uint64_t RASEL:4;
      uint64_t BASEL:4;
      uint64_t MSDCLKOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SMODE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REFC:16;
      uint64_t NREF:8;
      uint64_t PREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) REFTIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRDWN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CL:2;
      uint64_t reservedSpace0:2;
      uint64_t TRC:4;
      uint64_t TRP:4;
      uint64_t TRCD:4;
      uint64_t TRAS:4;
      uint64_t TREFC:4;
      uint64_t TDPL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDTIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SDAD:16;
      uint64_t SDWE:1;
      uint64_t SDCAS:1;
      uint64_t SDRAS:1;
      uint64_t SDCS:1;
      uint64_t SDCKE:1;
      uint64_t reservedSpace0:10;
      uint64_t PEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SDCMD;

  uint8_t res1[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SFER:1;
      uint64_t SDER:1;
      uint64_t SFION:1;
      uint64_t SDION:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MEMCERR;

