iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res2[252];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MDIV:4;
      uint64_t MCLKON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DCLKR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WEAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WERRCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ESCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AMODE;

};

#define EXBUS_1 (*(volatile struct EXBUS_1_tag *) 0x4003f000)

struct USBCLK_1_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t UCEN0:1;
      uint64_t UCSEL:1;
      uint64_t reservedSpace0:1;
      uint64_t UCEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UCCR;

  uint8_t res0[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t UPLLEN:1;
      uint64_t UPINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UPCR1;

  uint8_t res1[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t UPOWT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UPCR2;

  uint8_t res2[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t UPLLK:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UPCR3;

  uint8_t res3[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t UPLLN:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UPCR4;

  uint8_t res4[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t UPRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UP_STR;

  uint8_t res5[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t UPCSE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UPINT_ENR;

  uint8_t res6[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t UPCSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UPINT_CLR;

  uint8_t res7[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t UPCSI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UPINT_STR;

  uint8_t res8[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t UPLLM:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UPCR5;

  uint8_t res9[11];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t USBEN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USBEN0;

  uint8_t res10[3];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t USBEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) USBEN1;

};

#define USBCLK_1 (*(volatile struct USBCLK_1_tag *) 0x40036000)

struct USB0_1_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t HOST:1;
      uint64_t URST:1;
      uint64_t SOFIRE:1;
      uint64_t DIRE:1;
      uint64_t CNNIRE:1;
      uint64_t CMPIRE:1;
      uint64_t URIRE:1;
      uint64_t RWKIRE:1;
      uint64_t RETRY:1;
      uint64_t CANCEL:1;
      uint64_t SOFSTEP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) HCNT;

  uint8_t res0[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t SOFIRQ:1;
      uint64_t DIRQ:1;
      uint64_t CNNIRQ:1;
      uint64_t CMPIRQ:1;
      uint64_t URIRQ:1;
      uint64_t RWKIRQ:1;
      uint64_t reservedSpace0:1;
      uint64_t TCAN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HIRQ;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t HS:2;
      uint64_t STUFF:1;
      uint64_t TGERR:1;
      uint64_t CRC:1;
      uint64_t TOUT:1;
      uint64_t RERR:1;
      uint64_t LSTSOF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HERR;

  uint8_t res1[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CSTAT:1;
      uint64_t TMODE:1;
      uint64_t SUSP:1;
      uint64_t SOFBUSY:1;
      uint64_t CLKSEL:1;
      uint64_t ALIVE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HSTATE;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t FRAMECOMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HFCOMP;

  uint8_t res2[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RTIMER0:8;
      uint64_t RTIMER1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) HRTIMER;

  uint8_t res3[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t RTIMER2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HRTIMER2;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ADDRESS:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HADR;

  uint8_t res4[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t EOF0:8;
      uint64_t EOF1:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) HEOF;

  uint8_t res5[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FRAME0:8;
      uint64_t FRAME1:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) HFRAME;

  uint8_t res6[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t ENDPT:4;
      uint64_t TKNEN:3;
      uint64_t TGGL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) HTOKEN;

  uint8_t res7[3];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PWC:1;
      uint64_t RFBK:1;
      uint64_t reservedSpace0:1;
      uint64_t STALCLREN:1;
      uint64_t USTP:1;
      uint64_t HCONX:1;
      uint64_t RESUM:1;
      uint64_t RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UDCC;

  uint8_t res8[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PKS0:7;
      uint64_t reservedSpace0:2;
      uint64_t STAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EP0C;

  uint8_t res9[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PKS:9;
      uint64_t STAL:1;
      uint64_t NULE:1;
      uint64_t DMAE:1;
      uint64_t DIR:1;
      uint64_t TYPE:2;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EP1C;

  uint8_t res10[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PKS:7;
      uint64_t reservedSpace0:2;
      uint64_t STAL:1;
      uint64_t NULE:1;
      uint64_t DMAE:1;
      uint64_t DIR:1;
      uint64_t TYPE:2;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EP2C;

  uint8_t res11[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKS:7;
      uint64_t reservedSpace0:2;
      uint64_t STAL:1;
      uint64_t NULE:1;
      uint64_t DMAE:1;
      uint64_t DIR:1;
      uint64_t TYPE:2;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EP3C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKS:7;
      uint64_t reservedSpace0:2;
      uint64_t STAL:1;
      uint64_t NULE:1;
      uint64_t DMAE:1;
      uint64_t DIR:1;
      uint64_t TYPE:2;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EP4C;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKS:7;
      uint64_t reservedSpace0:2;
      uint64_t STAL:1;
      uint64_t NULE:1;
      uint64_t DMAE:1;
      uint64_t DIR:1;
      uint64_t TYPE:2;
      uint64_t EPEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EP5C;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TMSP:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TMSP;

  uint8_t res12[2];

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CONF:1;
      uint64_t SETP:1;
      uint64_t WKUP:1;
      uint64_t BRST:1;
      uint64_t SOF:1;
      uint64_t SUSP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UDCS;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CONFIE:1;
      uint64_t CONFN:1;
      uint64_t WKUPIE:1;
      uint64_t BRSTIE:1;
      uint64_t SOFIE:1;
      uint64_t SUSPIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) UDCIE;

  uint8_t res13[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t DRQI:1;
      uint64_t reservedSpace1:3;
      uint64_t DRQIIE:1;
      uint64_t BFINI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EP0IS;

  uint8_t res14[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SIZE:7;
      uint64_t reservedSpace0:2;
      uint64_t SPK:1;
      uint64_t DRQO:1;
      uint64_t reservedSpace1:2;
      uint64_t SPKIE:1;
      uint64_t DRQOIE:1;
      uint64_t BFINI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EP0OS;

  uint8_t res15[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SIZE:9;
      uint64_t SPK:1;
      uint64_t DRQ:1;
      uint64_t BUSY:1;
      uint64_t reservedSpace0:1;
      uint64_t SPKIE:1;
      uint64_t DRQIE:1;
      uint64_t BFINI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EP1S;

  uint8_t res16[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SIZE:7;
      uint64_t reservedSpace0:2;
      uint64_t SPK:1;
      uint64_t DRQ:1;
      uint64_t BUSY:1;
      uint64_t reservedSpace1:1;
      uint64_t SPKIE:1;
      uint64_t DRQIE:1;
      uint64_t BFINI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EP2S;

  uint8_t res17[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIZE:7;
      uint64_t reservedSpace0:2;
      uint64_t SPK:1;
      uint64_t DRQ:1;
      uint64_t BUSY:1;
      uint64_t reservedSpace1:1;
      uint64_t SPKIE:1;
      uint64_t DRQIE:1;
      uint64_t BFINI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EP3S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIZE:7;
      uint64_t reservedSpace0:2;
      uint64_t SPK:1;
      uint64_t DRQ:1;
      uint64_t BUSY:1;
      uint64_t reservedSpace1:1;
      uint64_t SPKIE:1;
      uint64_t DRQIE:1;
      uint64_t BFINI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EP4S;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SIZE:7;
      uint64_t reservedSpace0:2;
      uint64_t SPK:1;
      uint64_t DRQ:1;
      uint64_t BUSY:1;
      uint64_t reservedSpace1:1;
      uint64_t SPKIE:1;
      uint64_t DRQIE:1;
      uint64_t BFINI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EP5S;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BFDT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EP0DT;

