iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res18[2];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFDT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EP1DT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFDT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EP2DT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFDT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EP3DT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFDT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EP4DT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BFDT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EP5DT;

};

#define USB0_1 (*(volatile struct USB0_1_tag *) 0x40042100)

struct DMAC_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t DH:4;
      uint64_t PR:1;
      uint64_t reservedSpace1:1;
      uint64_t DS:1;
      uint64_t DE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACR;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:16;
      uint64_t BC:4;
      uint64_t reservedSpace0:3;
      uint64_t IS:6;
      uint64_t ST:1;
      uint64_t PB:1;
      uint64_t EB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACA0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM:1;
      uint64_t reservedSpace0:15;
      uint64_t SS:3;
      uint64_t CI:1;
      uint64_t EI:1;
      uint64_t RD:1;
      uint64_t RS:1;
      uint64_t RC:1;
      uint64_t FD:1;
      uint64_t FS:1;
      uint64_t TW:2;
      uint64_t MS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACB0;

  uint32_t DMACSA0;
  uint32_t DMACDA0;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:16;
      uint64_t BC:4;
      uint64_t reservedSpace0:3;
      uint64_t IS:6;
      uint64_t ST:1;
      uint64_t PB:1;
      uint64_t EB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACA1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM:1;
      uint64_t reservedSpace0:15;
      uint64_t SS:3;
      uint64_t CI:1;
      uint64_t EI:1;
      uint64_t RD:1;
      uint64_t RS:1;
      uint64_t RC:1;
      uint64_t FD:1;
      uint64_t FS:1;
      uint64_t TW:2;
      uint64_t MS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACB1;

  uint32_t DMACSA1;
  uint32_t DMACDA1;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:16;
      uint64_t BC:4;
      uint64_t reservedSpace0:3;
      uint64_t IS:6;
      uint64_t ST:1;
      uint64_t PB:1;
      uint64_t EB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACA2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM:1;
      uint64_t reservedSpace0:15;
      uint64_t SS:3;
      uint64_t CI:1;
      uint64_t EI:1;
      uint64_t RD:1;
      uint64_t RS:1;
      uint64_t RC:1;
      uint64_t FD:1;
      uint64_t FS:1;
      uint64_t TW:2;
      uint64_t MS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACB2;

  uint32_t DMACSA2;
  uint32_t DMACDA2;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:16;
      uint64_t BC:4;
      uint64_t reservedSpace0:3;
      uint64_t IS:6;
      uint64_t ST:1;
      uint64_t PB:1;
      uint64_t EB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACA3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM:1;
      uint64_t reservedSpace0:15;
      uint64_t SS:3;
      uint64_t CI:1;
      uint64_t EI:1;
      uint64_t RD:1;
      uint64_t RS:1;
      uint64_t RC:1;
      uint64_t FD:1;
      uint64_t FS:1;
      uint64_t TW:2;
      uint64_t MS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACB3;

  uint32_t DMACSA3;
  uint32_t DMACDA3;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:16;
      uint64_t BC:4;
      uint64_t reservedSpace0:3;
      uint64_t IS:6;
      uint64_t ST:1;
      uint64_t PB:1;
      uint64_t EB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACA4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM:1;
      uint64_t reservedSpace0:15;
      uint64_t SS:3;
      uint64_t CI:1;
      uint64_t EI:1;
      uint64_t RD:1;
      uint64_t RS:1;
      uint64_t RC:1;
      uint64_t FD:1;
      uint64_t FS:1;
      uint64_t TW:2;
      uint64_t MS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACB4;

  uint32_t DMACSA4;
  uint32_t DMACDA4;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:16;
      uint64_t BC:4;
      uint64_t reservedSpace0:3;
      uint64_t IS:6;
      uint64_t ST:1;
      uint64_t PB:1;
      uint64_t EB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACA5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM:1;
      uint64_t reservedSpace0:15;
      uint64_t SS:3;
      uint64_t CI:1;
      uint64_t EI:1;
      uint64_t RD:1;
      uint64_t RS:1;
      uint64_t RC:1;
      uint64_t FD:1;
      uint64_t FS:1;
      uint64_t TW:2;
      uint64_t MS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACB5;

  uint32_t DMACSA5;
  uint32_t DMACDA5;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:16;
      uint64_t BC:4;
      uint64_t reservedSpace0:3;
      uint64_t IS:6;
      uint64_t ST:1;
      uint64_t PB:1;
      uint64_t EB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACA6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM:1;
      uint64_t reservedSpace0:15;
      uint64_t SS:3;
      uint64_t CI:1;
      uint64_t EI:1;
      uint64_t RD:1;
      uint64_t RS:1;
      uint64_t RC:1;
      uint64_t FD:1;
      uint64_t FS:1;
      uint64_t TW:2;
      uint64_t MS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACB6;

  uint32_t DMACSA6;
  uint32_t DMACDA6;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TC:16;
      uint64_t BC:4;
      uint64_t reservedSpace0:3;
      uint64_t IS:6;
      uint64_t ST:1;
      uint64_t PB:1;
      uint64_t EB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACA7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM:1;
      uint64_t reservedSpace0:15;
      uint64_t SS:3;
      uint64_t CI:1;
      uint64_t EI:1;
      uint64_t RD:1;
      uint64_t RS:1;
      uint64_t RC:1;
      uint64_t FD:1;
      uint64_t FS:1;
      uint64_t TW:2;
      uint64_t MS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DMACB7;

  uint32_t DMACSA7;
  uint32_t DMACDA7;
};

#define DMAC_1 (*(volatile struct DMAC_1_tag *) 0x40060000)

struct DSTC_1_tag
{
  uint32_t DESTP;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHANNEL:8;
      uint64_t reservedSpace0:8;
      uint64_t HWDESP:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWDESP;

