iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res2[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_3:8;
      uint64_t DATA_2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1DTA2_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_1:8;
      uint64_t DATA_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1DTA1_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_7:8;
      uint64_t DATA_6:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1DTB2_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_5:8;
      uint64_t DATA_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF1DTB1_B;

  uint8_t res3[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MESSAGENUMBER:8;
      uint64_t reservedSpace0:7;
      uint64_t BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2CREQ;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATAB:1;
      uint64_t DATAA:1;
      uint64_t NEWDAT:1;
      uint64_t CIP:1;
      uint64_t CONTROL:1;
      uint64_t ARB:1;
      uint64_t MASK:1;
      uint64_t WRRD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2CMSK;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK0:1;
      uint64_t MSK1:1;
      uint64_t MSK2:1;
      uint64_t MSK3:1;
      uint64_t MSK4:1;
      uint64_t MSK5:1;
      uint64_t MSK6:1;
      uint64_t MSK7:1;
      uint64_t MSK8:1;
      uint64_t MSK9:1;
      uint64_t MSK10:1;
      uint64_t MSK11:1;
      uint64_t MSK12:1;
      uint64_t MSK13:1;
      uint64_t MSK14:1;
      uint64_t MSK15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2MSK1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK16:1;
      uint64_t MSK17:1;
      uint64_t MSK18:1;
      uint64_t MSK19:1;
      uint64_t MSK20:1;
      uint64_t MSK21:1;
      uint64_t MSK22:1;
      uint64_t MSK23:1;
      uint64_t MSK24:1;
      uint64_t MSK25:1;
      uint64_t MSK26:1;
      uint64_t MSK27:1;
      uint64_t MSK28:1;
      uint64_t reservedSpace0:1;
      uint64_t MDIR:1;
      uint64_t MXTD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2MSK2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ID0:1;
      uint64_t ID1:1;
      uint64_t ID2:1;
      uint64_t ID3:1;
      uint64_t ID4:1;
      uint64_t ID5:1;
      uint64_t ID6:1;
      uint64_t ID7:1;
      uint64_t ID8:1;
      uint64_t ID9:1;
      uint64_t ID10:1;
      uint64_t ID11:1;
      uint64_t ID12:1;
      uint64_t ID13:1;
      uint64_t ID14:1;
      uint64_t ID15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2ARB1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ID16:1;
      uint64_t ID17:1;
      uint64_t ID18:1;
      uint64_t ID19:1;
      uint64_t ID20:1;
      uint64_t ID21:1;
      uint64_t ID22:1;
      uint64_t ID23:1;
      uint64_t ID24:1;
      uint64_t ID25:1;
      uint64_t ID26:1;
      uint64_t ID27:1;
      uint64_t ID28:1;
      uint64_t DIR:1;
      uint64_t XTD:1;
      uint64_t MSGVAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2ARB2;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DLC:4;
      uint64_t reservedSpace0:3;
      uint64_t EOB:1;
      uint64_t TXRQST:1;
      uint64_t RMTEN:1;
      uint64_t RXIE:1;
      uint64_t TXIE:1;
      uint64_t UMASK:1;
      uint64_t INTPND:1;
      uint64_t MSGLST:1;
      uint64_t NEWDAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2MCTR;

  uint8_t res4[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_0:8;
      uint64_t DATA_1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTA1_L;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_2:8;
      uint64_t DATA_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTA2_L;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_4:8;
      uint64_t DATA_5:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTB1_L;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_6:8;
      uint64_t DATA_7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTB2_L;

  uint8_t res5[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_3:8;
      uint64_t DATA_2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTA2_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_1:8;
      uint64_t DATA_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTA1_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_7:8;
      uint64_t DATA_6:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTB2_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_5:8;
      uint64_t DATA_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTB1_B;

  uint8_t res6[24];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TXRQST1:1;
      uint64_t TXRQST2:1;
      uint64_t TXRQST3:1;
      uint64_t TXRQST4:1;
      uint64_t TXRQST5:1;
      uint64_t TXRQST6:1;
      uint64_t TXRQST7:1;
      uint64_t TXRQST8:1;
      uint64_t TXRQST9:1;
      uint64_t TXRQST10:1;
      uint64_t TXRQST11:1;
      uint64_t TXRQST12:1;
      uint64_t TXRQST13:1;
      uint64_t TXRQST14:1;
      uint64_t TXRQST15:1;
      uint64_t TXRQST16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TREQR1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TXRQST17:1;
      uint64_t TXRQST18:1;
      uint64_t TXRQST19:1;
      uint64_t TXRQST20:1;
      uint64_t TXRQST21:1;
      uint64_t TXRQST22:1;
      uint64_t TXRQST23:1;
      uint64_t TXRQST24:1;
      uint64_t TXRQST25:1;
      uint64_t TXRQST26:1;
      uint64_t TXRQST27:1;
      uint64_t TXRQST28:1;
      uint64_t TXRQST29:1;
      uint64_t TXRQST30:1;
      uint64_t TXRQST31:1;
      uint64_t TXRQST32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TREQR2;

  uint8_t res7[12];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NEWDAT1:1;
      uint64_t NEWDAT2:1;
      uint64_t NEWDAT3:1;
      uint64_t NEWDAT4:1;
      uint64_t NEWDAT5:1;
      uint64_t NEWDAT6:1;
      uint64_t NEWDAT7:1;
      uint64_t NEWDAT8:1;
      uint64_t NEWDAT9:1;
      uint64_t NEWDAT10:1;
      uint64_t NEWDAT11:1;
      uint64_t NEWDAT12:1;
      uint64_t NEWDAT13:1;
      uint64_t NEWDAT14:1;
      uint64_t NEWDAT15:1;
      uint64_t NEWDAT16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NEWDT1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NEWDAT17:1;
      uint64_t NEWDAT18:1;
      uint64_t NEWDAT19:1;
      uint64_t NEWDAT20:1;
      uint64_t NEWDAT21:1;
      uint64_t NEWDAT22:1;
      uint64_t NEWDAT23:1;
      uint64_t NEWDAT24:1;
      uint64_t NEWDAT25:1;
      uint64_t NEWDAT26:1;
      uint64_t NEWDAT27:1;
      uint64_t NEWDAT28:1;
      uint64_t NEWDAT29:1;
      uint64_t NEWDAT30:1;
      uint64_t NEWDAT31:1;
      uint64_t NEWDAT32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NEWDT2;

  uint8_t res8[12];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t INTPND1:1;
      uint64_t INTPND2:1;
      uint64_t INTPND3:1;
      uint64_t INTPND4:1;
      uint64_t INTPND5:1;
      uint64_t INTPND6:1;
      uint64_t INTPND7:1;
      uint64_t INTPND8:1;
      uint64_t INTPND9:1;
      uint64_t INTPND10:1;
      uint64_t INTPND11:1;
      uint64_t INTPND12:1;
      uint64_t INTPND13:1;
      uint64_t INTPND14:1;
      uint64_t INTPND15:1;
      uint64_t INTPND16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) INTPND1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t INTPND17:1;
      uint64_t INTPND18:1;
      uint64_t INTPND19:1;
      uint64_t INTPND20:1;
      uint64_t INTPND21:1;
      uint64_t INTPND22:1;
      uint64_t INTPND23:1;
      uint64_t INTPND24:1;
      uint64_t INTPND25:1;
      uint64_t INTPND26:1;
      uint64_t INTPND27:1;
      uint64_t INTPND28:1;
      uint64_t INTPND29:1;
      uint64_t INTPND30:1;
      uint64_t INTPND31:1;
      uint64_t INTPND32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) INTPND2;

  uint8_t res9[12];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSGVAL1:1;
      uint64_t MSGVAL2:1;
      uint64_t MSGVAL3:1;
      uint64_t MSGVAL4:1;
      uint64_t MSGVAL5:1;
      uint64_t MSGVAL6:1;
      uint64_t MSGVAL7:1;
      uint64_t MSGVAL8:1;
      uint64_t MSGVAL9:1;
      uint64_t MSGVAL10:1;
      uint64_t MSGVAL11:1;
      uint64_t MSGVAL12:1;
      uint64_t MSGVAL13:1;
      uint64_t MSGVAL14:1;
      uint64_t MSGVAL15:1;
      uint64_t MSGVAL16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MSGVAL1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSGVAL17:1;
      uint64_t MSGVAL18:1;
      uint64_t MSGVAL19:1;
      uint64_t MSGVAL20:1;
      uint64_t MSGVAL21:1;
      uint64_t MSGVAL22:1;
      uint64_t MSGVAL23:1;
      uint64_t MSGVAL24:1;
      uint64_t MSGVAL25:1;
      uint64_t MSGVAL26:1;
      uint64_t MSGVAL27:1;
      uint64_t MSGVAL28:1;
      uint64_t MSGVAL29:1;
      uint64_t MSGVAL30:1;
      uint64_t MSGVAL31:1;
      uint64_t MSGVAL32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MSGVAL2;

