iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res5[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_3:8;
      uint64_t DATA_2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTA2_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_1:8;
      uint64_t DATA_0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTA1_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_7:8;
      uint64_t DATA_6:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTB2_B;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DATA_5:8;
      uint64_t DATA_4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IF2DTB1_B;

  uint8_t res6[24];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TXRQST1:1;
      uint64_t TXRQST2:1;
      uint64_t TXRQST3:1;
      uint64_t TXRQST4:1;
      uint64_t TXRQST5:1;
      uint64_t TXRQST6:1;
      uint64_t TXRQST7:1;
      uint64_t TXRQST8:1;
      uint64_t TXRQST9:1;
      uint64_t TXRQST10:1;
      uint64_t TXRQST11:1;
      uint64_t TXRQST12:1;
      uint64_t TXRQST13:1;
      uint64_t TXRQST14:1;
      uint64_t TXRQST15:1;
      uint64_t TXRQST16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TREQR1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TXRQST17:1;
      uint64_t TXRQST18:1;
      uint64_t TXRQST19:1;
      uint64_t TXRQST20:1;
      uint64_t TXRQST21:1;
      uint64_t TXRQST22:1;
      uint64_t TXRQST23:1;
      uint64_t TXRQST24:1;
      uint64_t TXRQST25:1;
      uint64_t TXRQST26:1;
      uint64_t TXRQST27:1;
      uint64_t TXRQST28:1;
      uint64_t TXRQST29:1;
      uint64_t TXRQST30:1;
      uint64_t TXRQST31:1;
      uint64_t TXRQST32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TREQR2;

  uint8_t res7[12];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NEWDAT1:1;
      uint64_t NEWDAT2:1;
      uint64_t NEWDAT3:1;
      uint64_t NEWDAT4:1;
      uint64_t NEWDAT5:1;
      uint64_t NEWDAT6:1;
      uint64_t NEWDAT7:1;
      uint64_t NEWDAT8:1;
      uint64_t NEWDAT9:1;
      uint64_t NEWDAT10:1;
      uint64_t NEWDAT11:1;
      uint64_t NEWDAT12:1;
      uint64_t NEWDAT13:1;
      uint64_t NEWDAT14:1;
      uint64_t NEWDAT15:1;
      uint64_t NEWDAT16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NEWDT1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NEWDAT17:1;
      uint64_t NEWDAT18:1;
      uint64_t NEWDAT19:1;
      uint64_t NEWDAT20:1;
      uint64_t NEWDAT21:1;
      uint64_t NEWDAT22:1;
      uint64_t NEWDAT23:1;
      uint64_t NEWDAT24:1;
      uint64_t NEWDAT25:1;
      uint64_t NEWDAT26:1;
      uint64_t NEWDAT27:1;
      uint64_t NEWDAT28:1;
      uint64_t NEWDAT29:1;
      uint64_t NEWDAT30:1;
      uint64_t NEWDAT31:1;
      uint64_t NEWDAT32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NEWDT2;

  uint8_t res8[12];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t INTPND1:1;
      uint64_t INTPND2:1;
      uint64_t INTPND3:1;
      uint64_t INTPND4:1;
      uint64_t INTPND5:1;
      uint64_t INTPND6:1;
      uint64_t INTPND7:1;
      uint64_t INTPND8:1;
      uint64_t INTPND9:1;
      uint64_t INTPND10:1;
      uint64_t INTPND11:1;
      uint64_t INTPND12:1;
      uint64_t INTPND13:1;
      uint64_t INTPND14:1;
      uint64_t INTPND15:1;
      uint64_t INTPND16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) INTPND1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t INTPND17:1;
      uint64_t INTPND18:1;
      uint64_t INTPND19:1;
      uint64_t INTPND20:1;
      uint64_t INTPND21:1;
      uint64_t INTPND22:1;
      uint64_t INTPND23:1;
      uint64_t INTPND24:1;
      uint64_t INTPND25:1;
      uint64_t INTPND26:1;
      uint64_t INTPND27:1;
      uint64_t INTPND28:1;
      uint64_t INTPND29:1;
      uint64_t INTPND30:1;
      uint64_t INTPND31:1;
      uint64_t INTPND32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) INTPND2;

  uint8_t res9[12];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSGVAL1:1;
      uint64_t MSGVAL2:1;
      uint64_t MSGVAL3:1;
      uint64_t MSGVAL4:1;
      uint64_t MSGVAL5:1;
      uint64_t MSGVAL6:1;
      uint64_t MSGVAL7:1;
      uint64_t MSGVAL8:1;
      uint64_t MSGVAL9:1;
      uint64_t MSGVAL10:1;
      uint64_t MSGVAL11:1;
      uint64_t MSGVAL12:1;
      uint64_t MSGVAL13:1;
      uint64_t MSGVAL14:1;
      uint64_t MSGVAL15:1;
      uint64_t MSGVAL16:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MSGVAL1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSGVAL17:1;
      uint64_t MSGVAL18:1;
      uint64_t MSGVAL19:1;
      uint64_t MSGVAL20:1;
      uint64_t MSGVAL21:1;
      uint64_t MSGVAL22:1;
      uint64_t MSGVAL23:1;
      uint64_t MSGVAL24:1;
      uint64_t MSGVAL25:1;
      uint64_t MSGVAL26:1;
      uint64_t MSGVAL27:1;
      uint64_t MSGVAL28:1;
      uint64_t MSGVAL29:1;
      uint64_t MSGVAL30:1;
      uint64_t MSGVAL31:1;
      uint64_t MSGVAL32:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) MSGVAL2;

};

#define CAN1_1 (*(volatile struct CAN1_1_tag *) 0x40063000)

struct SDIF_1_tag
{
  uint32_t DUMMY;
};

#define SDIF_1 (*(volatile struct SDIF_1_tag *) 0x4006e000)

struct PPB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_RVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CVR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SYST_CALIB;

  uint8_t res0[224];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISER;

  uint8_t res1[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRENA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICER;

  uint8_t res2[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SETPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ISPR;

  uint8_t res3[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLRPEND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_ICPR;

  uint8_t res4[380];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_0:8;
      uint64_t PRI_1:8;
      uint64_t PRI_2:8;
      uint64_t PRI_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_0:8;
      uint64_t PRI_1:8;
      uint64_t PRI_2:8;
      uint64_t PRI_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_0:8;
      uint64_t PRI_1:8;
      uint64_t PRI_2:8;
      uint64_t PRI_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_0:8;
      uint64_t PRI_1:8;
      uint64_t PRI_2:8;
      uint64_t PRI_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_0:8;
      uint64_t PRI_1:8;
      uint64_t PRI_2:8;
      uint64_t PRI_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_0:8;
      uint64_t PRI_1:8;
      uint64_t PRI_2:8;
      uint64_t PRI_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_0:8;
      uint64_t PRI_1:8;
      uint64_t PRI_2:8;
      uint64_t PRI_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRI_0:8;
      uint64_t PRI_1:8;
      uint64_t PRI_2:8;
      uint64_t PRI_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NVIC_IPR7;

  uint8_t res5[2272];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t Revision:4;
      uint64_t PartNo:12;
      uint64_t Architecture:4;
      uint64_t Variant:4;
      uint64_t Implementer:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VECTACTIVE:6;
      uint64_t reservedSpace0:6;
      uint64_t VECTPENDING:6;
      uint64_t reservedSpace1:4;
      uint64_t ISRPENDING:1;
      uint64_t reservedSpace2:2;
      uint64_t PENDSTCLR:1;
      uint64_t PENDSTSET:1;
      uint64_t PENDSVCLR:1;
      uint64_t PENDSVSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSR;

