iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t SYSRESETREQ:1;
      uint64_t reservedSpace1:12;
      uint64_t ENDIANNESS:1;
      uint64_t VECTKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SLEEPONEXIT:1;
      uint64_t SLEEPDEEP:1;
      uint64_t reservedSpace1:1;
      uint64_t SEVONPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t UNALIGN_TRP:1;
      uint64_t reservedSpace1:5;
      uint64_t STKALIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PRI_11:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PRI_14:8;
      uint64_t PRI_15:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:15;
      uint64_t SVCALLPENDED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHCSR;

};

#define PPB (*(volatile struct PPB_tag *) 0xe000e010)

struct ERU0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXS0A:2;
      uint64_t EXS0B:2;
      uint64_t EXS1A:2;
      uint64_t EXS1B:2;
      uint64_t EXS2A:2;
      uint64_t EXS2B:2;
      uint64_t EXS3A:2;
      uint64_t EXS3B:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXISEL;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_3;

};

#define ERU0 (*(volatile struct ERU0_tag *) 0x40010600)

struct ERU1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t EXS0A:2;
      uint64_t EXS0B:2;
      uint64_t EXS1A:2;
      uint64_t EXS1B:2;
      uint64_t EXS2A:2;
      uint64_t EXS2B:2;
      uint64_t EXS3A:2;
      uint64_t EXS3B:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXISEL;

  uint8_t res0[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PE:1;
      uint64_t LD:1;
      uint64_t RE:1;
      uint64_t FE:1;
      uint64_t OCS:3;
      uint64_t FL:1;
      uint64_t SS:2;
      uint64_t NA:1;
      uint64_t NB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXICON_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ISS:2;
      uint64_t GEEN:1;
      uint64_t PDR:1;
      uint64_t GP:2;
      uint64_t reservedSpace0:6;
      uint64_t IPEN0:1;
      uint64_t IPEN1:1;
      uint64_t IPEN2:1;
      uint64_t IPEN3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EXOCON_3;

