iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define ERU1 (*(volatile struct ERU1_tag *) 0x40010630)

struct MATH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DVDRC:3;
      uint64_t DVSRC:3;
      uint64_t CORDXRC:2;
      uint64_t reservedSpace0:1;
      uint64_t CORDYRC:2;
      uint64_t reservedSpace1:1;
      uint64_t CORDZRC:2;
      uint64_t reservedSpace2:2;
      uint64_t SUSCFG:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLBCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVEOCIEN:1;
      uint64_t DIVERRIEN:1;
      uint64_t CDEOCIEN:1;
      uint64_t CDERRIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVEOC:1;
      uint64_t DIVERR:1;
      uint64_t CDEOC:1;
      uint64_t CDERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVEOCS:1;
      uint64_t DIVERRS:1;
      uint64_t CDEOCS:1;
      uint64_t CDERRS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVEOCC:1;
      uint64_t DIVERRC:1;
      uint64_t CDEOCC:1;
      uint64_t CDERRC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFCR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DVD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DVS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QUOT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RMD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVST;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST:1;
      uint64_t STMODE:1;
      uint64_t USIGN:1;
      uint64_t DIVMODE:2;
      uint64_t reservedSpace0:3;
      uint64_t QSCNT:5;
      uint64_t reservedSpace1:2;
      uint64_t QSDIR:1;
      uint64_t DVDSLC:5;
      uint64_t reservedSpace2:3;
      uint64_t DVSSRC:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVCON;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BSY:1;
      uint64_t reservedSpace0:4;
      uint64_t KEEPX:1;
      uint64_t KEEPY:1;
      uint64_t KEEPZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STATC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ST:1;
      uint64_t MODE:2;
      uint64_t ROTVEC:1;
      uint64_t ST_MODE:1;
      uint64_t X_USIGN:1;
      uint64_t MPS:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORDX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORDY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t DATA:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORDZ;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t RESULT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORRX;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t RESULT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORRY;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t RESULT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CORRZ;

};

#define MATH (*(volatile struct MATH_tag *) 0x40030004)

struct PAU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t AVAIL5:1;
      uint64_t AVAIL6:1;
      uint64_t AVAIL7:1;
      uint64_t reservedSpace1:12;
      uint64_t AVAIL20:1;
      uint64_t AVAIL21:1;
      uint64_t AVAIL22:1;
      uint64_t AVAIL23:1;
      uint64_t AVAIL24:1;
      uint64_t AVAIL25:1;
      uint64_t AVAIL26:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AVAIL0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVAIL0:1;
      uint64_t AVAIL1:1;
      uint64_t reservedSpace0:2;
      uint64_t AVAIL4:1;
      uint64_t AVAIL5:1;
      uint64_t AVAIL6:1;
      uint64_t AVAIL7:1;
      uint64_t AVAIL8:1;
      uint64_t AVAIL9:1;
      uint64_t AVAIL10:1;
      uint64_t AVAIL11:1;
      uint64_t AVAIL12:1;
      uint64_t reservedSpace1:3;
      uint64_t AVAIL16:1;
      uint64_t AVAIL17:1;
      uint64_t reservedSpace2:7;
      uint64_t AVAIL25:1;
      uint64_t AVAIL26:1;
      uint64_t AVAIL27:1;
      uint64_t AVAIL28:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AVAIL1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AVAIL0:1;
      uint64_t AVAIL1:1;
      uint64_t AVAIL2:1;
      uint64_t AVAIL3:1;
      uint64_t reservedSpace0:8;
      uint64_t AVAIL12:1;
      uint64_t reservedSpace1:2;
      uint64_t AVAIL15:1;
      uint64_t AVAIL16:1;
      uint64_t AVAIL17:1;
      uint64_t AVAIL18:1;
      uint64_t AVAIL19:1;
      uint64_t AVAIL20:1;
      uint64_t AVAIL21:1;
      uint64_t reservedSpace2:1;
      uint64_t AVAIL23:1;
      uint64_t reservedSpace3:4;
      uint64_t AVAIL28:1;
      uint64_t AVAIL29:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AVAIL2;

