iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res0[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PDIS2:1;
      uint64_t reservedSpace1:2;
      uint64_t PDIS5:1;
      uint64_t PDIS6:1;
      uint64_t PDIS7:1;
      uint64_t reservedSpace2:11;
      uint64_t PDIS19:1;
      uint64_t PDIS20:1;
      uint64_t PDIS21:1;
      uint64_t PDIS22:1;
      uint64_t PDIS23:1;
      uint64_t PDIS24:1;
      uint64_t PDIS25:1;
      uint64_t PDIS26:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRIVDIS0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIS0:1;
      uint64_t PDIS1:1;
      uint64_t reservedSpace0:3;
      uint64_t PDIS5:1;
      uint64_t PDIS6:1;
      uint64_t PDIS7:1;
      uint64_t PDIS8:1;
      uint64_t PDIS9:1;
      uint64_t PDIS10:1;
      uint64_t PDIS11:1;
      uint64_t PDIS12:1;
      uint64_t reservedSpace1:3;
      uint64_t PDIS16:1;
      uint64_t PDIS17:1;
      uint64_t reservedSpace2:7;
      uint64_t PDIS25:1;
      uint64_t PDIS26:1;
      uint64_t PDIS27:1;
      uint64_t PDIS28:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRIVDIS1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIS0:1;
      uint64_t PDIS1:1;
      uint64_t PDIS2:1;
      uint64_t PDIS3:1;
      uint64_t reservedSpace0:8;
      uint64_t PDIS12:1;
      uint64_t PDIS13:1;
      uint64_t PDIS14:1;
      uint64_t PDIS15:1;
      uint64_t PDIS16:1;
      uint64_t PDIS17:1;
      uint64_t PDIS18:1;
      uint64_t PDIS19:1;
      uint64_t PDIS20:1;
      uint64_t PDIS21:1;
      uint64_t reservedSpace1:1;
      uint64_t PDIS23:1;
      uint64_t reservedSpace2:4;
      uint64_t PDIS28:1;
      uint64_t PDIS29:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRIVDIS2;

  uint8_t res1[884];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t ADDR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ROMSIZE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:12;
      uint64_t ADDR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FLSIZE;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t ADDR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAM0SIZE;

};

#define PAU (*(volatile struct PAU_tag *) 0x40000040)

struct NVM_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t BUSY:1;
      uint64_t SLEEP:1;
      uint64_t VERR:2;
      uint64_t ECC1READ:1;
      uint64_t ECC2READ:1;
      uint64_t WRPERR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NVMSTATUS;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ACTION:8;
      uint64_t reservedSpace0:4;
      uint64_t RSTVERR:1;
      uint64_t RSTECC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NVMPROG;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t HRLEV:2;
      uint64_t reservedSpace1:1;
      uint64_t SECPROT:8;
      uint64_t reservedSpace2:2;
      uint64_t INT_ON:1;
      uint64_t NVM_ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) NVMCONF;

};

#define NVM (*(volatile struct NVM_tag *) 0x40050000)

struct WDT_1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENB:1;
      uint64_t PRE:1;
      uint64_t reservedSpace0:2;
      uint64_t DSP:1;
      uint64_t reservedSpace1:3;
      uint64_t SPW:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRV:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRV;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WLB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WLB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WUB:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WUB;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALMS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTSTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALMC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) WDTCLR;

};

#define WDT_1 (*(volatile struct WDT_1_tag *) 0x40020000)

struct RTC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENB:1;
      uint64_t SUS:1;
      uint64_t reservedSpace0:14;
      uint64_t DIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPSE:1;
      uint64_t RPMI:1;
      uint64_t RPHO:1;
      uint64_t RPDA:1;
      uint64_t reservedSpace0:1;
      uint64_t RPMO:1;
      uint64_t RPYE:1;
      uint64_t reservedSpace1:1;
      uint64_t RAI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RAWSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPSE:1;
      uint64_t SPMI:1;
      uint64_t SPHO:1;
      uint64_t SPDA:1;
      uint64_t reservedSpace0:1;
      uint64_t SPMO:1;
      uint64_t SPYE:1;
      uint64_t reservedSpace1:1;
      uint64_t SAI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MPSE:1;
      uint64_t MPMI:1;
      uint64_t MPHO:1;
      uint64_t MPDA:1;
      uint64_t reservedSpace0:1;
      uint64_t MPMO:1;
      uint64_t MPYE:1;
      uint64_t reservedSpace1:1;
      uint64_t MAI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSKSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RPSE:1;
      uint64_t RPMI:1;
      uint64_t RPHO:1;
      uint64_t RPDA:1;
      uint64_t reservedSpace0:1;
      uint64_t RPMO:1;
      uint64_t RPYE:1;
      uint64_t reservedSpace1:1;
      uint64_t RAI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLRSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ASE:6;
      uint64_t reservedSpace0:2;
      uint64_t AMI:6;
      uint64_t reservedSpace1:2;
      uint64_t AHO:5;
      uint64_t reservedSpace2:3;
      uint64_t ADA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATIM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t AMO:4;
      uint64_t reservedSpace1:4;
      uint64_t AYE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ATIM1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SE:6;
      uint64_t reservedSpace0:2;
      uint64_t MI:6;
      uint64_t reservedSpace1:2;
      uint64_t HO:5;
      uint64_t reservedSpace2:3;
      uint64_t DA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAWE:3;
      uint64_t reservedSpace0:5;
      uint64_t MO:4;
      uint64_t reservedSpace1:4;
      uint64_t YE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIM1;

