iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define RTC_2 (*(volatile struct RTC_2_tag *) 0x40010a00)

struct PRNG_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t RDATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WORD;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RDV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHK;

  uint8_t res1[6];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RDBS:2;
      uint64_t KLD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CTRL;

};

#define PRNG (*(volatile struct PRNG_tag *) 0x48020000)

struct LEDTS0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS_EN:1;
      uint64_t LD_EN:1;
      uint64_t CMTR:1;
      uint64_t ENSYNC:1;
      uint64_t reservedSpace0:4;
      uint64_t SUSCFG:1;
      uint64_t MASKVAL:3;
      uint64_t FENVAL:1;
      uint64_t ITS_EN:1;
      uint64_t ITF_EN:1;
      uint64_t ITP_EN:1;
      uint64_t CLK_PS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADT:3;
      uint64_t PADTSW:1;
      uint64_t EPULL:1;
      uint64_t FNCOL:3;
      uint64_t reservedSpace0:8;
      uint64_t ACCCNT:4;
      uint64_t TSCCMP:1;
      uint64_t TSOEXT:2;
      uint64_t TSCTRR:1;
      uint64_t TSCTRSAT:1;
      uint64_t NR_TSIN:3;
      uint64_t COLLEV:1;
      uint64_t NR_LEDCOL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FNCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSF:1;
      uint64_t TFF:1;
      uint64_t TPF:1;
      uint64_t TSCTROVF:1;
      uint64_t reservedSpace0:12;
      uint64_t CTSF:1;
      uint64_t CTFF:1;
      uint64_t CTPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSCTRVALR:16;
      uint64_t TSCTRVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_0:8;
      uint64_t LINE_1:8;
      uint64_t LINE_2:8;
      uint64_t LINE_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_4:8;
      uint64_t LINE_5:8;
      uint64_t LINE_6:8;
      uint64_t LINE_A:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_LD0:8;
      uint64_t CMP_LD1:8;
      uint64_t CMP_LD2:8;
      uint64_t CMP_LD3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDCMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_LD4:8;
      uint64_t CMP_LD5:8;
      uint64_t CMP_LD6:8;
      uint64_t CMP_LDA_TSCOM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDCMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_TS0:8;
      uint64_t CMP_TS1:8;
      uint64_t CMP_TS2:8;
      uint64_t CMP_TS3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSCMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_TS4:8;
      uint64_t CMP_TS5:8;
      uint64_t CMP_TS6:8;
      uint64_t CMP_TS7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSCMP1;

};

#define LEDTS0 (*(volatile struct LEDTS0_tag *) 0x50020000)

struct LEDTS1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS_EN:1;
      uint64_t LD_EN:1;
      uint64_t CMTR:1;
      uint64_t ENSYNC:1;
      uint64_t reservedSpace0:4;
      uint64_t SUSCFG:1;
      uint64_t MASKVAL:3;
      uint64_t FENVAL:1;
      uint64_t ITS_EN:1;
      uint64_t ITF_EN:1;
      uint64_t ITP_EN:1;
      uint64_t CLK_PS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADT:3;
      uint64_t PADTSW:1;
      uint64_t EPULL:1;
      uint64_t FNCOL:3;
      uint64_t reservedSpace0:8;
      uint64_t ACCCNT:4;
      uint64_t TSCCMP:1;
      uint64_t TSOEXT:2;
      uint64_t TSCTRR:1;
      uint64_t TSCTRSAT:1;
      uint64_t NR_TSIN:3;
      uint64_t COLLEV:1;
      uint64_t NR_LEDCOL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FNCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSF:1;
      uint64_t TFF:1;
      uint64_t TPF:1;
      uint64_t TSCTROVF:1;
      uint64_t reservedSpace0:12;
      uint64_t CTSF:1;
      uint64_t CTFF:1;
      uint64_t CTPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSCTRVALR:16;
      uint64_t TSCTRVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_0:8;
      uint64_t LINE_1:8;
      uint64_t LINE_2:8;
      uint64_t LINE_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_4:8;
      uint64_t LINE_5:8;
      uint64_t LINE_6:8;
      uint64_t LINE_A:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_LD0:8;
      uint64_t CMP_LD1:8;
      uint64_t CMP_LD2:8;
      uint64_t CMP_LD3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDCMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_LD4:8;
      uint64_t CMP_LD5:8;
      uint64_t CMP_LD6:8;
      uint64_t CMP_LDA_TSCOM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDCMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_TS0:8;
      uint64_t CMP_TS1:8;
      uint64_t CMP_TS2:8;
      uint64_t CMP_TS3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSCMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_TS4:8;
      uint64_t CMP_TS5:8;
      uint64_t CMP_TS6:8;
      uint64_t CMP_TS7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSCMP1;

