iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define LEDTS1 (*(volatile struct LEDTS1_tag *) 0x50020400)

struct LEDTS2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TS_EN:1;
      uint64_t LD_EN:1;
      uint64_t CMTR:1;
      uint64_t ENSYNC:1;
      uint64_t reservedSpace0:4;
      uint64_t SUSCFG:1;
      uint64_t MASKVAL:3;
      uint64_t FENVAL:1;
      uint64_t ITS_EN:1;
      uint64_t ITF_EN:1;
      uint64_t ITP_EN:1;
      uint64_t CLK_PS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PADT:3;
      uint64_t PADTSW:1;
      uint64_t EPULL:1;
      uint64_t FNCOL:3;
      uint64_t reservedSpace0:8;
      uint64_t ACCCNT:4;
      uint64_t TSCCMP:1;
      uint64_t TSOEXT:2;
      uint64_t TSCTRR:1;
      uint64_t TSCTRSAT:1;
      uint64_t NR_TSIN:3;
      uint64_t COLLEV:1;
      uint64_t NR_LEDCOL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FNCTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSF:1;
      uint64_t TFF:1;
      uint64_t TPF:1;
      uint64_t TSCTROVF:1;
      uint64_t reservedSpace0:12;
      uint64_t CTSF:1;
      uint64_t CTFF:1;
      uint64_t CTPF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TSCTRVALR:16;
      uint64_t TSCTRVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSVAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_0:8;
      uint64_t LINE_1:8;
      uint64_t LINE_2:8;
      uint64_t LINE_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINE0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LINE_4:8;
      uint64_t LINE_5:8;
      uint64_t LINE_6:8;
      uint64_t LINE_A:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LINE1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_LD0:8;
      uint64_t CMP_LD1:8;
      uint64_t CMP_LD2:8;
      uint64_t CMP_LD3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDCMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_LD4:8;
      uint64_t CMP_LD5:8;
      uint64_t CMP_LD6:8;
      uint64_t CMP_LDA_TSCOM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LDCMP1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_TS0:8;
      uint64_t CMP_TS1:8;
      uint64_t CMP_TS2:8;
      uint64_t CMP_TS3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSCMP0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CMP_TS4:8;
      uint64_t CMP_TS5:8;
      uint64_t CMP_TS6:8;
      uint64_t CMP_TS7:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TSCMP1;

};

#define LEDTS2 (*(volatile struct LEDTS2_tag *) 0x50020800)

struct USIC0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define USIC0 (*(volatile struct USIC0_tag *) 0x48000008)

struct USIC1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

};

#define USIC1 (*(volatile struct USIC1_tag *) 0x48004008)

struct CAN_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISR:1;
      uint64_t DISS:1;
      uint64_t reservedSpace0:1;
      uint64_t EDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLC;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STEP:10;
      uint64_t reservedSpace0:4;
      uint64_t DM:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FDR;

  uint8_t res1[240];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BEGIN:8;
      uint64_t END:8;
      uint64_t SIZE:8;
      uint64_t EMPTY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LIST_15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PND:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSPND_7;

  uint8_t res2[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSID_7;

  uint8_t res3[32];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IM:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MSIMASK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PANCMD:8;
      uint64_t BUSY:1;
      uint64_t RBUSY:1;
      uint64_t reservedSpace0:6;
      uint64_t PANAR1:8;
      uint64_t PANAR2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PANCTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CLKSEL:4;
      uint64_t reservedSpace0:8;
      uint64_t MPSEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MITR;

