iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define CAN (*(volatile struct CAN_tag *) 0x50040000)

struct CAN_NODE0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t TRIE:1;
      uint64_t LECIE:1;
      uint64_t ALIE:1;
      uint64_t CANDIS:1;
      uint64_t TXDIS:1;
      uint64_t CCE:1;
      uint64_t CALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TXOK:1;
      uint64_t RXOK:1;
      uint64_t ALERT:1;
      uint64_t EWRN:1;
      uint64_t BOFF:1;
      uint64_t LLE:1;
      uint64_t LOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALINP:4;
      uint64_t LECINP:4;
      uint64_t TRINP:4;
      uint64_t CFCINP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NIPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSEL:3;
      uint64_t reservedSpace0:5;
      uint64_t LBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSEG1:4;
      uint64_t TSEG2:3;
      uint64_t DIV8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NBTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REC:8;
      uint64_t TEC:8;
      uint64_t EWRNLVL:8;
      uint64_t LETD:1;
      uint64_t LEINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NECNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFC:16;
      uint64_t CFSEL:3;
      uint64_t CFMOD:2;
      uint64_t reservedSpace0:1;
      uint64_t CFCIE:1;
      uint64_t CFCOV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NFCR;

};

#define CAN_NODE0 (*(volatile struct CAN_NODE0_tag *) 0x50040200)

struct CAN_NODE1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t INIT:1;
      uint64_t TRIE:1;
      uint64_t LECIE:1;
      uint64_t ALIE:1;
      uint64_t CANDIS:1;
      uint64_t TXDIS:1;
      uint64_t CCE:1;
      uint64_t CALM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LEC:3;
      uint64_t TXOK:1;
      uint64_t RXOK:1;
      uint64_t ALERT:1;
      uint64_t EWRN:1;
      uint64_t BOFF:1;
      uint64_t LLE:1;
      uint64_t LOE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALINP:4;
      uint64_t LECINP:4;
      uint64_t TRINP:4;
      uint64_t CFCINP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NIPR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSEL:3;
      uint64_t reservedSpace0:5;
      uint64_t LBM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NPCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BRP:6;
      uint64_t SJW:2;
      uint64_t TSEG1:4;
      uint64_t TSEG2:3;
      uint64_t DIV8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NBTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REC:8;
      uint64_t TEC:8;
      uint64_t EWRNLVL:8;
      uint64_t LETD:1;
      uint64_t LEINC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NECNT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CFC:16;
      uint64_t CFSEL:3;
      uint64_t CFMOD:2;
      uint64_t reservedSpace0:1;
      uint64_t CFCIE:1;
      uint64_t CFCOV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) NFCR;

};

#define CAN_NODE1 (*(volatile struct CAN_NODE1_tag *) 0x50040300)

struct SCU_GENERAL_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t MANUFID:11;
      uint64_t PARTNO:16;
      uint64_t VERSION:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DBGROMID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IDCHIP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IDCHIP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DAT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SSW0;

  uint8_t res1[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODE:2;
      uint64_t PROTS:1;
      uint64_t PASS:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PASSWD;

  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GSC40:1;
      uint64_t GSC41:1;
      uint64_t reservedSpace0:6;
      uint64_t GSC80:1;
      uint64_t GSC81:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCUCON;

  uint8_t res3[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RTC_CTR:1;
      uint64_t RTC_ATIM0:1;
      uint64_t RTC_ATIM1:1;
      uint64_t RTC_TIM0:1;
      uint64_t RTC_TIM1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIRRSTS;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MTENS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PMTSR;

  uint8_t res5[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PFUBYP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFUCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL0:2;
      uint64_t INTSEL1:2;
      uint64_t INTSEL2:2;
      uint64_t INTSEL3:2;
      uint64_t INTSEL4:2;
      uint64_t INTSEL5:2;
      uint64_t INTSEL6:2;
      uint64_t INTSEL7:2;
      uint64_t INTSEL8:2;
      uint64_t INTSEL9:2;
      uint64_t INTSEL10:2;
      uint64_t INTSEL11:2;
      uint64_t INTSEL12:2;
      uint64_t INTSEL13:2;
      uint64_t INTSEL14:2;
      uint64_t INTSEL15:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t INTSEL16:2;
      uint64_t INTSEL17:2;
      uint64_t INTSEL18:2;
      uint64_t INTSEL19:2;
      uint64_t INTSEL20:2;
      uint64_t INTSEL21:2;
      uint64_t INTSEL22:2;
      uint64_t INTSEL23:2;
      uint64_t INTSEL24:2;
      uint64_t INTSEL25:2;
      uint64_t INTSEL26:2;
      uint64_t INTSEL27:2;
      uint64_t INTSEL28:2;
      uint64_t INTSEL29:2;
      uint64_t INTSEL30:2;
      uint64_t INTSEL31:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTCR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HWCON:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STSTAT;

