iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define SCU_GENERAL (*(volatile struct SCU_GENERAL_tag *) 0x40010000)

struct SCU_INTERRUPT_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRWARN:1;
      uint64_t PI:1;
      uint64_t AI:1;
      uint64_t VDDPI:1;
      uint64_t ACMP0I:1;
      uint64_t ACMP1I:1;
      uint64_t ACMP2I:1;
      uint64_t VDROPI:1;
      uint64_t ORC0I:1;
      uint64_t ORC1I:1;
      uint64_t ORC2I:1;
      uint64_t ORC3I:1;
      uint64_t ORC4I:1;
      uint64_t ORC5I:1;
      uint64_t ORC6I:1;
      uint64_t ORC7I:1;
      uint64_t LOCI:1;
      uint64_t PESRAMI:1;
      uint64_t PEU0I:1;
      uint64_t FLECC2I:1;
      uint64_t FLCMPLTI:1;
      uint64_t VCLIPI:1;
      uint64_t SBYCLKFI:1;
      uint64_t reservedSpace0:1;
      uint64_t RTC_CTR:1;
      uint64_t RTC_ATIM0:1;
      uint64_t RTC_ATIM1:1;
      uint64_t RTC_TIM0:1;
      uint64_t RTC_TIM1:1;
      uint64_t TSE_DONE:1;
      uint64_t TSE_HIGH:1;
      uint64_t TSE_LOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRRAW;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRWARN:1;
      uint64_t reservedSpace0:2;
      uint64_t VDDPI:1;
      uint64_t ACMP0I:1;
      uint64_t ACMP1I:1;
      uint64_t ACMP2I:1;
      uint64_t VDROPI:1;
      uint64_t ORC0I:1;
      uint64_t ORC1I:1;
      uint64_t ORC2I:1;
      uint64_t ORC3I:1;
      uint64_t ORC4I:1;
      uint64_t ORC5I:1;
      uint64_t ORC6I:1;
      uint64_t ORC7I:1;
      uint64_t LOCI:1;
      uint64_t PESRAMI:1;
      uint64_t PEU0I:1;
      uint64_t FLECC2I:1;
      uint64_t reservedSpace1:1;
      uint64_t VCLIPI:1;
      uint64_t SBYCLKFI:1;
      uint64_t reservedSpace2:1;
      uint64_t RTC_CTR:1;
      uint64_t RTC_ATIM0:1;
      uint64_t RTC_ATIM1:1;
      uint64_t RTC_TIM0:1;
      uint64_t RTC_TIM1:1;
      uint64_t TSE_DONE:1;
      uint64_t TSE_HIGH:1;
      uint64_t TSE_LOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRMSK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRWARN:1;
      uint64_t PI:1;
      uint64_t AI:1;
      uint64_t VDDPI:1;
      uint64_t ACMP0I:1;
      uint64_t ACMP1I:1;
      uint64_t ACMP2I:1;
      uint64_t VDROPI:1;
      uint64_t ORC0I:1;
      uint64_t ORC1I:1;
      uint64_t ORC2I:1;
      uint64_t ORC3I:1;
      uint64_t ORC4I:1;
      uint64_t ORC5I:1;
      uint64_t ORC6I:1;
      uint64_t ORC7I:1;
      uint64_t LOCI:1;
      uint64_t PESRAMI:1;
      uint64_t PEU0I:1;
      uint64_t FLECC2I:1;
      uint64_t FLCMPLTI:1;
      uint64_t VCLIPI:1;
      uint64_t SBYCLKFI:1;
      uint64_t reservedSpace0:1;
      uint64_t RTC_CTR:1;
      uint64_t RTC_ATIM0:1;
      uint64_t RTC_ATIM1:1;
      uint64_t RTC_TIM0:1;
      uint64_t RTC_TIM1:1;
      uint64_t TSE_DONE:1;
      uint64_t TSE_HIGH:1;
      uint64_t TSE_LOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRWARN:1;
      uint64_t PI:1;
      uint64_t AI:1;
      uint64_t VDDPI:1;
      uint64_t ACMP0I:1;
      uint64_t ACMP1I:1;
      uint64_t ACMP2I:1;
      uint64_t VDROPI:1;
      uint64_t ORC0I:1;
      uint64_t ORC1I:1;
      uint64_t ORC2I:1;
      uint64_t ORC3I:1;
      uint64_t ORC4I:1;
      uint64_t ORC5I:1;
      uint64_t ORC6I:1;
      uint64_t ORC7I:1;
      uint64_t LOCI:1;
      uint64_t PESRAMI:1;
      uint64_t PEU0I:1;
      uint64_t FLECC2I:1;
      uint64_t FLCMPLTI:1;
      uint64_t VCLIPI:1;
      uint64_t SBYCLKFI:1;
      uint64_t reservedSpace0:1;
      uint64_t RTC_CTR:1;
      uint64_t RTC_ATIM0:1;
      uint64_t RTC_ATIM1:1;
      uint64_t RTC_TIM0:1;
      uint64_t RTC_TIM1:1;
      uint64_t TSE_DONE:1;
      uint64_t TSE_HIGH:1;
      uint64_t TSE_LOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRSET;

  uint8_t res0[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACMP3I:1;
      uint64_t LOECI:1;
      uint64_t PEU1I:1;
      uint64_t PEMCI:1;
      uint64_t DCO1OFSI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRRAW1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACMP3I:1;
      uint64_t LOECI:1;
      uint64_t PEU1I:1;
      uint64_t PEMCI:1;
      uint64_t DCO1OFSI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRMSK1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACMP3I:1;
      uint64_t LOECI:1;
      uint64_t PEU1I:1;
      uint64_t PEMCI:1;
      uint64_t DCO1OFSI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRCLR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACMP3I:1;
      uint64_t LOECI:1;
      uint64_t PEU1I:1;
      uint64_t PEMCI:1;
      uint64_t DCO1OFSI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRSET1;

};

#define SCU_INTERRUPT (*(volatile struct SCU_INTERRUPT_tag *) 0x40010038)

struct SCU_POWER_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t VCLIP:1;
      uint64_t VDDPPW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VDESR;

};

#define SCU_POWER (*(volatile struct SCU_POWER_tag *) 0x40010200)

struct SCU_CLK_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDIV:8;
      uint64_t IDIV:8;
      uint64_t PCLKSEL:1;
      uint64_t RTCCLKSEL:3;
      uint64_t CNTADJ:10;
      uint64_t VDDC2LOW:1;
      uint64_t VDDC2HIGH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FPD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PWRSVCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VADC_bitfield:1;
      uint64_t CCU80_bitfield:1;
      uint64_t CCU40_bitfield:1;
      uint64_t USIC0_bitfield:1;
      uint64_t BCCU0_bitfield:1;
      uint64_t LEDTS0_bitfield:1;
      uint64_t LEDTS1_bitfield:1;
      uint64_t POSIF0_bitfield:1;
      uint64_t MATH_bitfield:1;
      uint64_t WDT:1;
      uint64_t RTC:1;
      uint64_t reservedSpace0:5;
      uint64_t CCU81_bitfield:1;
      uint64_t CCU41_bitfield:1;
      uint64_t USIC1_bitfield:1;
      uint64_t LEDTS2_bitfield:1;
      uint64_t POSIF1_bitfield:1;
      uint64_t MCAN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATSTAT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VADC_bitfield:1;
      uint64_t CCU80_bitfield:1;
      uint64_t CCU40_bitfield:1;
      uint64_t USIC0_bitfield:1;
      uint64_t BCCU0_bitfield:1;
      uint64_t LEDTS0_bitfield:1;
      uint64_t LEDTS1_bitfield:1;
      uint64_t POSIF0_bitfield:1;
      uint64_t MATH_bitfield:1;
      uint64_t WDT:1;
      uint64_t RTC:1;
      uint64_t reservedSpace0:5;
      uint64_t CCU81_bitfield:1;
      uint64_t CCU41_bitfield:1;
      uint64_t USIC1_bitfield:1;
      uint64_t LEDTS2_bitfield:1;
      uint64_t POSIF1_bitfield:1;
      uint64_t MCAN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATSET0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VADC_bitfield:1;
      uint64_t CCU80_bitfield:1;
      uint64_t CCU40_bitfield:1;
      uint64_t USIC0_bitfield:1;
      uint64_t BCCU0_bitfield:1;
      uint64_t LEDTS0_bitfield:1;
      uint64_t LEDTS1_bitfield:1;
      uint64_t POSIF0_bitfield:1;
      uint64_t MATH_bitfield:1;
      uint64_t WDT:1;
      uint64_t RTC:1;
      uint64_t reservedSpace0:5;
      uint64_t CCU81_bitfield:1;
      uint64_t CCU41_bitfield:1;
      uint64_t USIC1_bitfield:1;
      uint64_t LEDTS2_bitfield:1;
      uint64_t POSIF1_bitfield:1;
      uint64_t MCAN0:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CGATCLR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OSC2L:1;
      uint64_t OSC2H:1;
      uint64_t reservedSpace0:6;
      uint64_t DCO1PD:1;
      uint64_t reservedSpace1:7;
      uint64_t OWDRES:1;
      uint64_t OWDEN:1;
      uint64_t reservedSpace2:6;
      uint64_t XOWDRES:1;
      uint64_t XOWDEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OSCCSR;

