iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FDIV:2;
      uint64_t reservedSpace0:6;
      uint64_t ADCCLKSEL:1;
      uint64_t DCLKSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLKCR1;

};

#define SCU_CLK (*(volatile struct SCU_CLK_tag *) 0x40010300)

struct SCU_RESET_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSTSTAT:10;
      uint64_t LCKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t LCKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTSET;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RSCLR:1;
      uint64_t reservedSpace0:9;
      uint64_t LCKEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTCLR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECCRSTEN:1;
      uint64_t LOCRSTEN:1;
      uint64_t SPERSTEN:1;
      uint64_t U0PERSTEN:1;
      uint64_t U1PERSTEN:1;
      uint64_t MPERSTEN:1;
      uint64_t LOECRSTEN:1;
      uint64_t reservedSpace0:9;
      uint64_t MRSTEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RSTCON;

};

#define SCU_RESET (*(volatile struct SCU_RESET_tag *) 0x40010400)

struct COMPARATOR_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENORC0:1;
      uint64_t ENORC1:1;
      uint64_t ENORC2:1;
      uint64_t ENORC3:1;
      uint64_t ENORC4:1;
      uint64_t ENORC5:1;
      uint64_t ENORC6:1;
      uint64_t ENORC7:1;
      uint64_t reservedSpace0:8;
      uint64_t CNF0:1;
      uint64_t CNF1:1;
      uint64_t CNF2:1;
      uint64_t CNF3:1;
      uint64_t CNF4:1;
      uint64_t CNF5:1;
      uint64_t CNF6:1;
      uint64_t CNF7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ORCCTRL;

  uint8_t res0[2904];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_EN:1;
      uint64_t CMP_FLT_OFF:1;
      uint64_t reservedSpace0:1;
      uint64_t CMP_INV_OUT:1;
      uint64_t CMP_HYST_ADJ:2;
      uint64_t ACMP0_SEL:1;
      uint64_t reservedSpace1:1;
      uint64_t CMP_LPWR:1;
      uint64_t reservedSpace2:6;
      uint64_t CMP_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANACMP0;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_EN:1;
      uint64_t CMP_FLT_OFF:1;
      uint64_t reservedSpace0:1;
      uint64_t CMP_INV_OUT:1;
      uint64_t CMP_HYST_ADJ:2;
      uint64_t REF_DIV_EN:1;
      uint64_t reservedSpace1:8;
      uint64_t CMP_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANACMP1;

  uint8_t res2[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_EN:1;
      uint64_t CMP_FLT_OFF:1;
      uint64_t reservedSpace0:1;
      uint64_t CMP_INV_OUT:1;
      uint64_t CMP_HYST_ADJ:2;
      uint64_t ACMP2_SEL:1;
      uint64_t reservedSpace1:8;
      uint64_t CMP_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANACMP2;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CMP_EN:1;
      uint64_t CMP_FLT_OFF:1;
      uint64_t reservedSpace0:1;
      uint64_t CMP_INV_OUT:1;
      uint64_t CMP_HYST_ADJ:2;
      uint64_t ACMP3_SEL:1;
      uint64_t reservedSpace1:8;
      uint64_t CMP_OUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANACMP3;

};

#define COMPARATOR (*(volatile struct COMPARATOR_tag *) 0x40010500)

struct SCU_ANALOG_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t TSE_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANATSECTRL;

  uint8_t res0[10];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TSE_IH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANATSEIH;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TSE_IL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANATSEIL;

  uint8_t res2[10];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TSE_MON:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANATSEMON;

  uint8_t res3[14];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VDEL_SELECT:2;
      uint64_t VDEL_TIM_ADJ:2;
      uint64_t VDEL_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANAVDEL;

  uint8_t res4[26];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ADJL_OFFSET:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANAOFFSET;

  uint8_t res5[10];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SYNC_PRELOAD:14;
      uint64_t SYNC_DCO_EN:1;
      uint64_t XTAL_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANASYNC1;

  uint8_t res6[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRESCALER:11;
      uint64_t reservedSpace0:1;
      uint64_t SYNC_READY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANASYNC2;

  uint8_t res7[14];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANAOSCLPCTRL;

  uint8_t res8[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SHBY:1;
      uint64_t GAINSEL:2;
      uint64_t MODE:2;
      uint64_t HYSCTRL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANAOSCHPCTRL;

};

#define SCU_ANALOG (*(volatile struct SCU_ANALOG_tag *) 0x40011024)

struct CCU40_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRBC:3;
      uint64_t reservedSpace0:1;
      uint64_t PCIS:2;
      uint64_t reservedSpace1:2;
      uint64_t SUSCFG:2;
      uint64_t MSE0:1;
      uint64_t MSE1:1;
      uint64_t MSE2:1;
      uint64_t MSE3:1;
      uint64_t MSDE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0I:1;
      uint64_t S1I:1;
      uint64_t S2I:1;
      uint64_t S3I:1;
      uint64_t reservedSpace0:4;
      uint64_t PRB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GSTAT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SS0I:1;
      uint64_t SS1I:1;
      uint64_t SS2I:1;
      uint64_t SS3I:1;
      uint64_t reservedSpace0:4;
      uint64_t CPRB:1;
      uint64_t PSIC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIDLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CS0I:1;
      uint64_t CS1I:1;
      uint64_t CS2I:1;
      uint64_t CS3I:1;
      uint64_t reservedSpace0:4;
      uint64_t SPRB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GIDLC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SE:1;
      uint64_t S0DSE:1;
      uint64_t S0PSE:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SE:1;
      uint64_t S1DSE:1;
      uint64_t S1PSE:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SE:1;
      uint64_t S2DSE:1;
      uint64_t S2PSE:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SE:1;
      uint64_t S3DSE:1;
      uint64_t S3PSE:1;
      uint64_t reservedSpace3:1;
      uint64_t S0STS:1;
      uint64_t S1STS:1;
      uint64_t S2STS:1;
      uint64_t S3STS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCSS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SC:1;
      uint64_t S0DSC:1;
      uint64_t S0PSC:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SC:1;
      uint64_t S1DSC:1;
      uint64_t S1PSC:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SC:1;
      uint64_t S2DSC:1;
      uint64_t S2PSC:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SC:1;
      uint64_t S3DSC:1;
      uint64_t S3PSC:1;
      uint64_t reservedSpace3:1;
      uint64_t S0STC:1;
      uint64_t S1STC:1;
      uint64_t S2STC:1;
      uint64_t S3STC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCSC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t S0SS:1;
      uint64_t S0DSS:1;
      uint64_t S0PSS:1;
      uint64_t reservedSpace0:1;
      uint64_t S1SS:1;
      uint64_t S1DSS:1;
      uint64_t S1PSS:1;
      uint64_t reservedSpace1:1;
      uint64_t S2SS:1;
      uint64_t S2DSS:1;
      uint64_t S2PSS:1;
      uint64_t reservedSpace2:1;
      uint64_t S3SS:1;
      uint64_t S3DSS:1;
      uint64_t S3PSS:1;
      uint64_t reservedSpace3:1;
      uint64_t CC40ST:1;
      uint64_t CC41ST:1;
      uint64_t CC42ST:1;
      uint64_t CC43ST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GCST;

  uint8_t res0[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MODR:8;
      uint64_t MODT:8;
      uint64_t MODN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MIDR;

