iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res2[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMP:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MCMPS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCSM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MNPS:1;
      uint64_t STHR:1;
      uint64_t STMR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MNPC:1;
      uint64_t MPC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMC;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MSS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) MCMF;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PALS:1;
      uint64_t PBLS:1;
      uint64_t PHS:1;
      uint64_t reservedSpace0:1;
      uint64_t ICM:2;
      uint64_t reservedSpace1:2;
      uint64_t DVAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QDC;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHES:1;
      uint64_t WHES:1;
      uint64_t HIES:1;
      uint64_t reservedSpace0:1;
      uint64_t MSTS:1;
      uint64_t reservedSpace1:3;
      uint64_t INDXS:1;
      uint64_t ERRS:1;
      uint64_t CNTS:1;
      uint64_t DIRS:1;
      uint64_t PCLKS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECHE:1;
      uint64_t EWHE:1;
      uint64_t EHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t EMST:1;
      uint64_t reservedSpace1:3;
      uint64_t EINDX:1;
      uint64_t EERR:1;
      uint64_t ECNT:1;
      uint64_t EDIR:1;
      uint64_t EPCLK:1;
      uint64_t reservedSpace2:3;
      uint64_t CHESEL:1;
      uint64_t WHESEL:1;
      uint64_t HIESEL:1;
      uint64_t reservedSpace3:1;
      uint64_t MSTSEL:1;
      uint64_t reservedSpace4:3;
      uint64_t INDSEL:1;
      uint64_t ERRSEL:1;
      uint64_t CNTSEL:1;
      uint64_t DIRSEL:1;
      uint64_t PCLSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PFLGE;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SCHE:1;
      uint64_t SWHE:1;
      uint64_t SHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t SMST:1;
      uint64_t reservedSpace1:3;
      uint64_t SINDX:1;
      uint64_t SERR:1;
      uint64_t SCNT:1;
      uint64_t SDIR:1;
      uint64_t SPCLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SPFLG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RCHE:1;
      uint64_t RWHE:1;
      uint64_t RHIE:1;
      uint64_t reservedSpace0:1;
      uint64_t RMST:1;
      uint64_t reservedSpace1:3;
      uint64_t RINDX:1;
      uint64_t RERR:1;
      uint64_t RCNT:1;
      uint64_t RDIR:1;
      uint64_t RPCLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RPFLG;

  uint8_t res5[128];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QCSV:2;
      uint64_t QPSV:2;
      uint64_t IVAL:1;
      uint64_t HSP:3;
      uint64_t LPP0:6;
      uint64_t reservedSpace0:2;
      uint64_t LPP1:6;
      uint64_t LPP2:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDBG;

};

#define POSIF1 (*(volatile struct POSIF1_tag *) 0x50014000)

struct VADC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t DISR:1;
      uint64_t DISS:1;
      uint64_t reservedSpace0:1;
      uint64_t EDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CLC;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  uint8_t res1[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TGS:2;
      uint64_t TGB:1;
      uint64_t TG_P:1;
      uint64_t reservedSpace0:20;
      uint64_t SUS:4;
      uint64_t SUS_P:1;
      uint64_t SUSSTA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OCS;

  uint8_t res2[84];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVA:5;
      uint64_t reservedSpace0:2;
      uint64_t DCMSB:1;
      uint64_t DIVD:2;
      uint64_t reservedSpace1:5;
      uint64_t DIVWC:1;
      uint64_t DPCAL0:1;
      uint64_t DPCAL1:1;
      uint64_t reservedSpace2:13;
      uint64_t SUCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBCFG;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APC0:1;
      uint64_t APC1:1;
      uint64_t reservedSpace0:13;
      uint64_t APEM:1;
      uint64_t API0:1;
      uint64_t API1:1;
      uint64_t reservedSpace1:13;
      uint64_t APGC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACCPROT0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t APS0:1;
      uint64_t APS1:1;
      uint64_t reservedSpace0:13;
      uint64_t APTF:1;
      uint64_t APR0:1;
      uint64_t APR1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ACCPROT1;

  uint8_t res4[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STCS:5;
      uint64_t reservedSpace0:3;
      uint64_t CMS:3;
      uint64_t reservedSpace1:5;
      uint64_t STCE:5;
      uint64_t reservedSpace2:3;
      uint64_t CME:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBICLASS_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t STCS:5;
      uint64_t reservedSpace0:3;
      uint64_t CMS:3;
      uint64_t reservedSpace1:5;
      uint64_t STCE:5;
      uint64_t reservedSpace2:3;
      uint64_t CME:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBICLASS_1;

  uint8_t res5[16];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BOUNDARY0:12;
      uint64_t reservedSpace0:4;
      uint64_t BOUNDARY1:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBBOUND;

  uint8_t res6[36];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEVGLB:1;
      uint64_t reservedSpace0:7;
      uint64_t REVGLB:1;
      uint64_t reservedSpace1:7;
      uint64_t SEVGLBCLR:1;
      uint64_t reservedSpace2:7;
      uint64_t REVGLBCLR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBEFLAG;

