iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
  uint8_t res7[92];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SEV0NP:4;
      uint64_t reservedSpace0:12;
      uint64_t REV0NP:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBEVNP;

  uint8_t res8[60];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSELG0:1;
      uint64_t CHSELG1:1;
      uint64_t CHSELG2:1;
      uint64_t CHSELG3:1;
      uint64_t CHSELG4:1;
      uint64_t CHSELG5:1;
      uint64_t CHSELG6:1;
      uint64_t CHSELG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSSEL_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHSELG0:1;
      uint64_t CHSELG1:1;
      uint64_t CHSELG2:1;
      uint64_t CHSELG3:1;
      uint64_t CHSELG4:1;
      uint64_t CHSELG5:1;
      uint64_t CHSELG6:1;
      uint64_t CHSELG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSSEL_1;

  uint8_t res9[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHPNDG0:1;
      uint64_t CHPNDG1:1;
      uint64_t CHPNDG2:1;
      uint64_t CHPNDG3:1;
      uint64_t CHPNDG4:1;
      uint64_t CHPNDG5:1;
      uint64_t CHPNDG6:1;
      uint64_t CHPNDG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSPND_0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHPNDG0:1;
      uint64_t CHPNDG1:1;
      uint64_t CHPNDG2:1;
      uint64_t CHPNDG3:1;
      uint64_t CHPNDG4:1;
      uint64_t CHPNDG5:1;
      uint64_t CHPNDG6:1;
      uint64_t CHPNDG7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSPND_1;

  uint8_t res10[56];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRCRESREG:4;
      uint64_t reservedSpace0:4;
      uint64_t XTSEL:4;
      uint64_t XTLVL:1;
      uint64_t XTMODE:2;
      uint64_t XTWC:1;
      uint64_t GTSEL:4;
      uint64_t GTLVL:1;
      uint64_t reservedSpace1:2;
      uint64_t GTWC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSCTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENGT:2;
      uint64_t ENTR:1;
      uint64_t ENSI:1;
      uint64_t SCAN:1;
      uint64_t LDM:1;
      uint64_t reservedSpace0:1;
      uint64_t REQGT:1;
      uint64_t CLRPND:1;
      uint64_t LDEV:1;
      uint64_t reservedSpace1:6;
      uint64_t RPTDIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BRSMR;

  uint8_t res11[120];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t DRCTR:4;
      uint64_t reservedSpace1:4;
      uint64_t WFR:1;
      uint64_t reservedSpace2:6;
      uint64_t SRGEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBRCR;

  uint8_t res12[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:16;
      uint64_t GNR:4;
      uint64_t CHNR:5;
      uint64_t EMUX:3;
      uint64_t CRS:2;
      uint64_t FCR:1;
      uint64_t VF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBRES;

  uint8_t res13[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RESULT:16;
      uint64_t GNR:4;
      uint64_t CHNR:5;
      uint64_t EMUX:3;
      uint64_t CRS:2;
      uint64_t FCR:1;
      uint64_t VF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBRESD;

  uint8_t res14[108];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMUXGRP0:4;
      uint64_t EMUXGRP1:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EMUXSEL;

};

#define VADC (*(volatile struct VADC_tag *) 0x48030000)

struct SHS0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  uint8_t res0[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVS:4;
      uint64_t reservedSpace0:6;
      uint64_t AREF:2;
      uint64_t ANOFF:1;
      uint64_t reservedSpace1:1;
      uint64_t ANRDY:1;
      uint64_t SCWC:1;
      uint64_t SP0:1;
      uint64_t SP1:1;
      uint64_t reservedSpace2:6;
      uint64_t TC:4;
      uint64_t STATE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHSCFG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t KSEL0:3;
      uint64_t SEN0:1;
      uint64_t KSEL1:3;
      uint64_t SEN1:1;
      uint64_t KSEL2:3;
      uint64_t SEN2:1;
      uint64_t KSEL3:3;
      uint64_t SEN3:1;
      uint64_t KSEL4:3;
      uint64_t SEN4:1;
      uint64_t KSEL5:3;
      uint64_t SEN5:1;
      uint64_t KSEL6:3;
      uint64_t SEN6:1;
      uint64_t KSEL7:3;
      uint64_t SEN7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) STEPCFG;

  uint8_t res1[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LPCH0:5;
      uint64_t reservedSpace0:3;
      uint64_t LPSH0:1;
      uint64_t reservedSpace1:6;
      uint64_t LPEN0:1;
      uint64_t LPCH1:5;
      uint64_t reservedSpace2:3;
      uint64_t LPSH1:1;
      uint64_t reservedSpace3:6;
      uint64_t LPEN1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOOP;

  uint8_t res2[44];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AT:1;
      uint64_t reservedSpace0:3;
      uint64_t FCRT:4;
      uint64_t SST:6;
      uint64_t reservedSpace1:2;
      uint64_t TGEN:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCFG0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AT:1;
      uint64_t reservedSpace0:3;
      uint64_t FCRT:4;
      uint64_t SST:6;
      uint64_t reservedSpace1:2;
      uint64_t TGEN:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TIMCFG1;

  uint8_t res3[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALORD:1;
      uint64_t reservedSpace0:7;
      uint64_t CALGNSTC:6;
      uint64_t reservedSpace1:2;
      uint64_t SUCALVAL:7;
      uint64_t reservedSpace2:1;
      uint64_t CALMAX:6;
      uint64_t reservedSpace3:1;
      uint64_t SUCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALCTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALGNVALS:14;
      uint64_t reservedSpace0:1;
      uint64_t GNSWC:1;
      uint64_t CALGNVALA:14;
      uint64_t reservedSpace1:1;
      uint64_t GNAWC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALGC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALGNVALS:14;
      uint64_t reservedSpace0:1;
      uint64_t GNSWC:1;
      uint64_t CALGNVALA:14;
      uint64_t reservedSpace1:1;
      uint64_t GNAWC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALGC1;

  uint8_t res4[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALOFFVAL0:7;
      uint64_t reservedSpace0:1;
      uint64_t CALOFFVAL1:7;
      uint64_t OFFWC:1;
      uint64_t CALOFFVAL2:7;
      uint64_t reservedSpace1:1;
      uint64_t CALOFFVAL3:7;
      uint64_t DISCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALOC0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CALOFFVAL0:7;
      uint64_t reservedSpace0:1;
      uint64_t CALOFFVAL1:7;
      uint64_t OFFWC:1;
      uint64_t CALOFFVAL2:7;
      uint64_t reservedSpace1:1;
      uint64_t CALOFFVAL3:7;
      uint64_t DISCAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALOC1;

  uint8_t res5[152];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN0:4;
      uint64_t GAIN1:4;
      uint64_t GAIN2:4;
      uint64_t GAIN3:4;
      uint64_t GAIN4:4;
      uint64_t GAIN5:4;
      uint64_t GAIN6:4;
      uint64_t GAIN7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GNCTR00;

  uint8_t res6[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GAIN0:4;
      uint64_t GAIN1:4;
      uint64_t GAIN2:4;
      uint64_t GAIN3:4;
      uint64_t GAIN4:4;
      uint64_t GAIN5:4;
      uint64_t GAIN6:4;
      uint64_t GAIN7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GNCTR10;

