iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define SHS0 (*(volatile struct SHS0_tag *) 0x48034008)

struct BCCU0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TM:1;
      uint64_t reservedSpace0:1;
      uint64_t TRDEL:2;
      uint64_t SUSCFG:2;
      uint64_t TRAPIS:4;
      uint64_t TRAPED:1;
      uint64_t reservedSpace1:1;
      uint64_t LTRS:4;
      uint64_t WDMBN:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FCLK_PS:12;
      uint64_t reservedSpace0:3;
      uint64_t BCS:1;
      uint64_t DCLK_PS:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBCLK;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MOD_REV:8;
      uint64_t MOD_TYPE0:8;
      uint64_t MOD_NUMBER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECH0:1;
      uint64_t ECH1:1;
      uint64_t ECH2:1;
      uint64_t ECH3:1;
      uint64_t ECH4:1;
      uint64_t ECH5:1;
      uint64_t ECH6:1;
      uint64_t ECH7:1;
      uint64_t ECH8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0OP:1;
      uint64_t CH1OP:1;
      uint64_t CH2OP:1;
      uint64_t CH3OP:1;
      uint64_t CH4OP:1;
      uint64_t CH5OP:1;
      uint64_t CH6OP:1;
      uint64_t CH7OP:1;
      uint64_t CH8OP:1;
      uint64_t reservedSpace0:7;
      uint64_t CH0TPE:1;
      uint64_t CH1TPE:1;
      uint64_t CH2TPE:1;
      uint64_t CH3TPE:1;
      uint64_t CH4TPE:1;
      uint64_t CH5TPE:1;
      uint64_t CH6TPE:1;
      uint64_t CH7TPE:1;
      uint64_t CH8TPE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHOCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ET0:1;
      uint64_t ET1:1;
      uint64_t ET2:1;
      uint64_t ET3:1;
      uint64_t ET4:1;
      uint64_t ET5:1;
      uint64_t ET6:1;
      uint64_t ET7:1;
      uint64_t ET8:1;
      uint64_t reservedSpace0:7;
      uint64_t TOS0:1;
      uint64_t TOS1:1;
      uint64_t TOS2:1;
      uint64_t TOS3:1;
      uint64_t TOS4:1;
      uint64_t TOS5:1;
      uint64_t TOS6:1;
      uint64_t TOS7:1;
      uint64_t TOS8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHTRIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CH0S:1;
      uint64_t CH1S:1;
      uint64_t CH2S:1;
      uint64_t CH3S:1;
      uint64_t CH4S:1;
      uint64_t CH5S:1;
      uint64_t CH6S:1;
      uint64_t CH7S:1;
      uint64_t CH8S:1;
      uint64_t reservedSpace0:7;
      uint64_t CH0A:1;
      uint64_t CH1A:1;
      uint64_t CH2A:1;
      uint64_t CH3A:1;
      uint64_t CH4A:1;
      uint64_t CH5A:1;
      uint64_t CH6A:1;
      uint64_t CH7A:1;
      uint64_t CH8A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHSTRCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LTOL0:1;
      uint64_t LTOL1:1;
      uint64_t LTOL2:1;
      uint64_t LTOL3:1;
      uint64_t LTOL4:1;
      uint64_t LTOL5:1;
      uint64_t LTOL6:1;
      uint64_t LTOL7:1;
      uint64_t LTOL8:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LTCHOL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDE0:1;
      uint64_t EDE1:1;
      uint64_t EDE2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DEEN;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DE0S:1;
      uint64_t DE1S:1;
      uint64_t DE2S:1;
      uint64_t reservedSpace0:13;
      uint64_t DE0A:1;
      uint64_t DE1A:1;
      uint64_t DE2A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DESTRCON;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GLOBDIM:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) GLOBDIM;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0IEN:1;
      uint64_t T1IEN:1;
      uint64_t FIEN:1;
      uint64_t EIEN:1;
      uint64_t TPIEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVIER;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0F:1;
      uint64_t T1F:1;
      uint64_t FF:1;
      uint64_t EF:1;
      uint64_t TPF:1;
      uint64_t reservedSpace0:1;
      uint64_t TPSF:1;
      uint64_t TPINL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0FS:1;
      uint64_t T1FS:1;
      uint64_t FFS:1;
      uint64_t EFS:1;
      uint64_t TPFS:1;
      uint64_t reservedSpace0:1;
      uint64_t TPS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t T0FC:1;
      uint64_t T1FC:1;
      uint64_t FFC:1;
      uint64_t EFC:1;
      uint64_t TPFC:1;
      uint64_t reservedSpace0:1;
      uint64_t TPC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) EVFCR;

};

#define BCCU0 (*(volatile struct BCCU0_tag *) 0x50030000)

struct BCCU0_CH0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKTH:3;
      uint64_t PEN:1;
      uint64_t DSEL:3;
      uint64_t DBP:1;
      uint64_t GEN:1;
      uint64_t WEN:1;
      uint64_t TRED:1;
      uint64_t ENFT:1;
      uint64_t reservedSpace0:4;
      uint64_t LINPRES:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCMP:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCNTVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCNTVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCNTR;

