iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define BCCU0_CH0 (*(volatile struct BCCU0_CH0_tag *) 0x5003003c)

struct BCCU0_CH1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKTH:3;
      uint64_t PEN:1;
      uint64_t DSEL:3;
      uint64_t DBP:1;
      uint64_t GEN:1;
      uint64_t WEN:1;
      uint64_t TRED:1;
      uint64_t ENFT:1;
      uint64_t reservedSpace0:4;
      uint64_t LINPRES:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCMP:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCNTVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCNTVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCNTR;

};

#define BCCU0_CH1 (*(volatile struct BCCU0_CH1_tag *) 0x50030050)

struct BCCU0_CH2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKTH:3;
      uint64_t PEN:1;
      uint64_t DSEL:3;
      uint64_t DBP:1;
      uint64_t GEN:1;
      uint64_t WEN:1;
      uint64_t TRED:1;
      uint64_t ENFT:1;
      uint64_t reservedSpace0:4;
      uint64_t LINPRES:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCMP:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCNTVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCNTVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCNTR;

};

#define BCCU0_CH2 (*(volatile struct BCCU0_CH2_tag *) 0x50030064)

struct BCCU0_CH3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKTH:3;
      uint64_t PEN:1;
      uint64_t DSEL:3;
      uint64_t DBP:1;
      uint64_t GEN:1;
      uint64_t WEN:1;
      uint64_t TRED:1;
      uint64_t ENFT:1;
      uint64_t reservedSpace0:4;
      uint64_t LINPRES:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCMP:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCNTVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCNTVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCNTR;

};

#define BCCU0_CH3 (*(volatile struct BCCU0_CH3_tag *) 0x50030078)

struct BCCU0_CH4_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKTH:3;
      uint64_t PEN:1;
      uint64_t DSEL:3;
      uint64_t DBP:1;
      uint64_t GEN:1;
      uint64_t WEN:1;
      uint64_t TRED:1;
      uint64_t ENFT:1;
      uint64_t reservedSpace0:4;
      uint64_t LINPRES:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCMP:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCNTVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCNTVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCNTR;

};

#define BCCU0_CH4 (*(volatile struct BCCU0_CH4_tag *) 0x5003008c)

struct BCCU0_CH5_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKTH:3;
      uint64_t PEN:1;
      uint64_t DSEL:3;
      uint64_t DBP:1;
      uint64_t GEN:1;
      uint64_t WEN:1;
      uint64_t TRED:1;
      uint64_t ENFT:1;
      uint64_t reservedSpace0:4;
      uint64_t LINPRES:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCMP:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCNTVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCNTVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCNTR;

};

#define BCCU0_CH5 (*(volatile struct BCCU0_CH5_tag *) 0x500300a0)

struct BCCU0_CH6_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKTH:3;
      uint64_t PEN:1;
      uint64_t DSEL:3;
      uint64_t DBP:1;
      uint64_t GEN:1;
      uint64_t WEN:1;
      uint64_t TRED:1;
      uint64_t ENFT:1;
      uint64_t reservedSpace0:4;
      uint64_t LINPRES:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCMP:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCNTVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCNTVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCNTR;

