iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define BCCU0_CH6 (*(volatile struct BCCU0_CH6_tag *) 0x500300b4)

struct BCCU0_CH7_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKTH:3;
      uint64_t PEN:1;
      uint64_t DSEL:3;
      uint64_t DBP:1;
      uint64_t GEN:1;
      uint64_t WEN:1;
      uint64_t TRED:1;
      uint64_t ENFT:1;
      uint64_t reservedSpace0:4;
      uint64_t LINPRES:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCMP:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCNTVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCNTVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCNTR;

};

#define BCCU0_CH7 (*(volatile struct BCCU0_CH7_tag *) 0x500300c8)

struct BCCU0_CH8_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TCHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INTS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CHINT:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) INT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PKTH:3;
      uint64_t PEN:1;
      uint64_t DSEL:3;
      uint64_t DBP:1;
      uint64_t GEN:1;
      uint64_t WEN:1;
      uint64_t TRED:1;
      uint64_t ENFT:1;
      uint64_t reservedSpace0:4;
      uint64_t LINPRES:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CHCONFIG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCMP:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCMP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCMP;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OFFCNTVAL:8;
      uint64_t reservedSpace0:8;
      uint64_t ONCNTVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PKCNTR;

};

#define BCCU0_CH8 (*(volatile struct BCCU0_CH8_tag *) 0x500300dc)

struct BCCU0_DE0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDLEV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLEV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIMDIV:10;
      uint64_t reservedSpace0:6;
      uint64_t DTEN:1;
      uint64_t CSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTT;

};

#define BCCU0_DE0 (*(volatile struct BCCU0_DE0_tag *) 0x5003017c)

struct BCCU0_DE1_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDLEV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLEV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIMDIV:10;
      uint64_t reservedSpace0:6;
      uint64_t DTEN:1;
      uint64_t CSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTT;

};

#define BCCU0_DE1 (*(volatile struct BCCU0_DE1_tag *) 0x50030188)

struct BCCU0_DE2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TDLEV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DLS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DLEV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIMDIV:10;
      uint64_t reservedSpace0:6;
      uint64_t DTEN:1;
      uint64_t CSEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DTT;

};

#define BCCU0_DE2 (*(volatile struct BCCU0_DE2_tag *) 0x50030194)

struct PORT0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0:1;
      uint64_t P1:1;
      uint64_t P2:1;
      uint64_t P3:1;
      uint64_t P4:1;
      uint64_t P5:1;
      uint64_t P6:1;
      uint64_t P7:1;
      uint64_t P8:1;
      uint64_t P9:1;
      uint64_t P10:1;
      uint64_t P11:1;
      uint64_t P12:1;
      uint64_t P13:1;
      uint64_t P14:1;
      uint64_t P15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS0:1;
      uint64_t PS1:1;
      uint64_t PS2:1;
      uint64_t PS3:1;
      uint64_t PS4:1;
      uint64_t PS5:1;
      uint64_t PS6:1;
      uint64_t PS7:1;
      uint64_t PS8:1;
      uint64_t PS9:1;
      uint64_t PS10:1;
      uint64_t PS11:1;
      uint64_t PS12:1;
      uint64_t PS13:1;
      uint64_t PS14:1;
      uint64_t PS15:1;
      uint64_t PR0:1;
      uint64_t PR1:1;
      uint64_t PR2:1;
      uint64_t PR3:1;
      uint64_t PR4:1;
      uint64_t PR5:1;
      uint64_t PR6:1;
      uint64_t PR7:1;
      uint64_t PR8:1;
      uint64_t PR9:1;
      uint64_t PR10:1;
      uint64_t PR11:1;
      uint64_t PR12:1;
      uint64_t PR13:1;
      uint64_t PR14:1;
      uint64_t PR15:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OMR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PC0:6;
      uint64_t reservedSpace1:2;
      uint64_t PC1:6;
      uint64_t reservedSpace2:2;
      uint64_t PC2:6;
      uint64_t reservedSpace3:2;
      uint64_t PC3:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PC4:6;
      uint64_t reservedSpace1:2;
      uint64_t PC5:6;
      uint64_t reservedSpace2:2;
      uint64_t PC6:6;
      uint64_t reservedSpace3:2;
      uint64_t PC7:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PC8:6;
      uint64_t reservedSpace1:2;
      uint64_t PC9:6;
      uint64_t reservedSpace2:2;
      uint64_t PC10:6;
      uint64_t reservedSpace3:2;
      uint64_t PC11:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PC12:6;
      uint64_t reservedSpace1:2;
      uint64_t PC13:6;
      uint64_t reservedSpace2:2;
      uint64_t PC14:6;
      uint64_t reservedSpace3:2;
      uint64_t PC15:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCR12;

