iSYSTEMLabs/winIDEAExampleWorkspaces/Infineon/XMC1400/targetInit/XMC1400_sfr.h
};

#define PORT1 (*(volatile struct PORT1_tag *) 0x40040100)

struct PORT2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0:1;
      uint64_t P1:1;
      uint64_t P2:1;
      uint64_t P3:1;
      uint64_t P4:1;
      uint64_t P5:1;
      uint64_t P6:1;
      uint64_t P7:1;
      uint64_t P8:1;
      uint64_t P9:1;
      uint64_t P10:1;
      uint64_t P11:1;
      uint64_t P12:1;
      uint64_t P13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS0:1;
      uint64_t PS1:1;
      uint64_t PS2:1;
      uint64_t PS3:1;
      uint64_t PS4:1;
      uint64_t PS5:1;
      uint64_t PS6:1;
      uint64_t PS7:1;
      uint64_t PS8:1;
      uint64_t PS9:1;
      uint64_t PS10:1;
      uint64_t PS11:1;
      uint64_t PS12:1;
      uint64_t PS13:1;
      uint64_t reservedSpace0:2;
      uint64_t PR0:1;
      uint64_t PR1:1;
      uint64_t PR2:1;
      uint64_t PR3:1;
      uint64_t PR4:1;
      uint64_t PR5:1;
      uint64_t PR6:1;
      uint64_t PR7:1;
      uint64_t PR8:1;
      uint64_t PR9:1;
      uint64_t PR10:1;
      uint64_t PR11:1;
      uint64_t PR12:1;
      uint64_t PR13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OMR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PC0:6;
      uint64_t reservedSpace1:2;
      uint64_t PC1:6;
      uint64_t reservedSpace2:2;
      uint64_t PC2:6;
      uint64_t reservedSpace3:2;
      uint64_t PC3:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PC4:6;
      uint64_t reservedSpace1:2;
      uint64_t PC5:6;
      uint64_t reservedSpace2:2;
      uint64_t PC6:6;
      uint64_t reservedSpace3:2;
      uint64_t PC7:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PC8:6;
      uint64_t reservedSpace1:2;
      uint64_t PC9:6;
      uint64_t reservedSpace2:2;
      uint64_t PC10:6;
      uint64_t reservedSpace3:2;
      uint64_t PC11:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PC12:6;
      uint64_t reservedSpace1:2;
      uint64_t PC13:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IOCR12;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0:1;
      uint64_t P1:1;
      uint64_t P2:1;
      uint64_t P3:1;
      uint64_t P4:1;
      uint64_t P5:1;
      uint64_t P6:1;
      uint64_t P7:1;
      uint64_t P8:1;
      uint64_t P9:1;
      uint64_t P10:1;
      uint64_t P11:1;
      uint64_t P12:1;
      uint64_t P13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IN;

  uint8_t res2[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PH0:1;
      uint64_t reservedSpace1:3;
      uint64_t PH1:1;
      uint64_t reservedSpace2:3;
      uint64_t PH2:1;
      uint64_t reservedSpace3:3;
      uint64_t PH3:1;
      uint64_t reservedSpace4:3;
      uint64_t PH4:1;
      uint64_t reservedSpace5:3;
      uint64_t PH5:1;
      uint64_t reservedSpace6:3;
      uint64_t PH6:1;
      uint64_t reservedSpace7:3;
      uint64_t PH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PHCR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PH8:1;
      uint64_t reservedSpace1:3;
      uint64_t PH9:1;
      uint64_t reservedSpace2:3;
      uint64_t PH10:1;
      uint64_t reservedSpace3:3;
      uint64_t PH11:1;
      uint64_t reservedSpace4:3;
      uint64_t PH12:1;
      uint64_t reservedSpace5:3;
      uint64_t PH13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PHCR1;

  uint8_t res3[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PDIS0:1;
      uint64_t PDIS1:1;
      uint64_t PDIS2:1;
      uint64_t PDIS3:1;
      uint64_t PDIS4:1;
      uint64_t PDIS5:1;
      uint64_t PDIS6:1;
      uint64_t PDIS7:1;
      uint64_t PDIS8:1;
      uint64_t PDIS9:1;
      uint64_t PDIS10:1;
      uint64_t PDIS11:1;
      uint64_t PDIS12:1;
      uint64_t PDIS13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PDISC;

  uint8_t res4[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PPS0:1;
      uint64_t PPS1:1;
      uint64_t PPS2:1;
      uint64_t PPS3:1;
      uint64_t PPS4:1;
      uint64_t PPS5:1;
      uint64_t PPS6:1;
      uint64_t PPS7:1;
      uint64_t PPS8:1;
      uint64_t PPS9:1;
      uint64_t PPS10:1;
      uint64_t PPS11:1;
      uint64_t PPS12:1;
      uint64_t PPS13:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PPS;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HW0:2;
      uint64_t HW1:2;
      uint64_t HW2:2;
      uint64_t HW3:2;
      uint64_t HW4:2;
      uint64_t HW5:2;
      uint64_t HW6:2;
      uint64_t HW7:2;
      uint64_t HW8:2;
      uint64_t HW9:2;
      uint64_t HW10:2;
      uint64_t HW11:2;
      uint64_t HW12:2;
      uint64_t HW13:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) HWSEL;

};

#define PORT2 (*(volatile struct PORT2_tag *) 0x40040200)

struct PORT3_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t P0:1;
      uint64_t P1:1;
      uint64_t P2:1;
      uint64_t P3:1;
      uint64_t P4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OUT;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PS0:1;
      uint64_t PS1:1;
      uint64_t PS2:1;
      uint64_t PS3:1;
      uint64_t PS4:1;
      uint64_t reservedSpace0:11;
      uint64_t PR0:1;
      uint64_t PR1:1;
      uint64_t PR2:1;
      uint64_t PR3:1;
      uint64_t PR4:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OMR;

